[
{"colour": "", "id": 1, "brand": "beautyblender", "product_description": "Beautyblender Sur.Face Simple Makeup Application Palette allows you to experiment and create a customisable colour effortlessly.\nAllowing for full creative control, Sur.Face Simple Makeup Application Palette ensures that the perfect shade for your skin tone can be mixed. Including a blending spatula and a tight-lock lid, Sur.Face Simple Makeup Application Palette acts as an easel upon which a multitude of hues can be designed and created.\nGet the look you desire with Sur.Face Simple Makeup Application Palette.", "price": "HK $220.00", "product_name": "Sur.Face Simple Makeup Application Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0035F_1_L.jpg/4f2bb25b9f4748eaa499ad3e09360732/BEBL0035F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/surfacesimplemakeupapplicationpalette/"},
{"colour": "", "id": 2, "brand": "Velour Lashes", "product_description": "Lightweight yet dramatic, a lash that has it all.\nCreated with 100% mink fibres, Strip Down falsies sit seamlessly on the lash-line for a full, spidery effect finish. The long length individual hairs are placed along an invisible band for a covert volumised appearance, ideal for those lash lovers who want to look and feel glamourous without tell-tale giveaways.", "price": "HK $244.40", "product_name": "Strip Down", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0043F_1_L.jpg/fd53526630b1c3d05942d5b632c75117/VELA0043F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/stripdown/"},
{"colour": "", "id": 3, "brand": "Lilly Lashes", "product_description": "Add depth and dimension to your favourite eye looks with these intensely black lashes.\nDesigned with an especially dense lash-line, the Roya 3D Faux Mink Band-Less Lashes have an invisible band and wispie length, ideal for adding a smoky finish to your chosen look.", "price": "HK $212.60", "product_name": "Roya 3D Faux Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0005F_1_L.jpg/e4e3c018453b923eb38be6fc8ac335d9/LILL0005F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/roya3dfauxminkbandlesslashes/"},
{"colour": "", "id": 4, "brand": "Velour Lashes", "product_description": "False lashes with a gradual gradient in thickness that give a semi natural finish.\nSilk My Life's Complete lashes are super lightweight to create comfortable wear. Increasing in length and thickness towards the out corner they create a subtle flared out finish. Innovatively handmade, the silk hairs are bonded to a cotton threaded band and are incredibly durable, with up to 20 wears, making them perfect for day time glam.", "price": "HK $157.30", "product_name": "Silk My Life's Complete", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0038F_1_L.jpg/0e96ea83f71ca95c3f6e12b05b0cffc4/VELA0038F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/silkmylifescomplete/"},
{"colour": "", "id": 5, "brand": "Lilly Lashes", "product_description": "A mesmerising set of lashes that deliver volume and length to all the right places.\nHarbouring clusters of the finest mink hair, the Kuwait City 3D Mink Lashes provide both volume and length in the most flattering of ways. Focussing the majority of the length on the centre of the lash-line these falsies create the illusion of wider eyes.", "price": "HK $318.80", "product_name": "Kuwait City 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0025F_1_L.jpg/a248b8ad56e606f1c71ccacf82216434/LILL0025F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/kuwaitcity3dminklashes/"},
{"colour": "", "id": 6, "brand": "beautyblender", "product_description": "Beautyblender Pure Sponge has been specially developed for sensitive skin but still delivers the same outstanding results as the original Beauty Blender Sponge.\nA flawless look starts with the perfect canvas Í clean, beautiful and even skin. Celebrity makeup artist Rea Ann Silva, creator of the original beautyblender© is taking her expertise in creating a flawless face one step further with the introduction of beautyblender© PureÙ.\nBeautyblender Pure Sponge has a patent-pending elliptical shape which makes application fool proof by allowing you to access hard-to-reach areas with stunning ease. The suede texture is sensual to the touch and its unique curves fit the contours of your face, leaving your makeup dazzling and undetectable.\nBeautyblender Pure is colour free, latex free, non-allergenic and odour free and helps you to look like a movie star without the pricey services of a major makeup artist. Forget your fingers or sharp-edged triangular sponges, these application methods waste makeup and can leave visible streaks; beautyblender Pure Sponge lets you achieve the ultimate flawless finish for your make up, allowing you to blend to perfection, which is not always easy to do.", "price": "HK $153.00", "product_name": "Pure Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0007F_1_L.jpg/76802841785da2422f5d89b98f629ea2/BEBL0007F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/puresponge/"},
{"colour": "", "id": 7, "brand": "Oh K!", "product_description": "A zip fastening makeup bag.\nStoring your must have products, Oh K! Panda Cosmetic Bag is perfect for travel. Zipped for extra security, the wipe clean, panda print bag is compact and lightweight for easy and stylish organisation.", "price": "HK $106.30", "product_name": "Oh K! Panda Cosmetic Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/OHKB0024F_1_L.jpg/a7680c3ae3849ae25b47451fca06a8be/OHKB0024F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ohk/ohkpandacosmeticbag/"},
{"colour": "", "id": 8, "brand": "beautyblender", "product_description": "Beautyblender Liner.Designer Eye Liner Application Tool allows you to craft the perfect cat eye or winged effect with you chosen eyeliner.\nFeaturing a mirrored compact which can be attached to any flat surface using a sucker pad, Liner.Designer Eye Liner Application Tool ensures that a steady, straight line can be created effortlessly.\nThe little triangular sponge has a straight edge which lends a helping hand when applying liquid, gel or powder eyeliner to the lash line, removing the risk of smudging or causing a mess. Also acting as a shield against product fall-out, Liner.Designer Eye Liner Application Tool certifies itself as a true cosmetic necessity.\nDon't be afraid of your eyeliner anymore thanks to the innovative Liner.Designer Eye Liner Application Tool.", "price": "HK $133.90", "product_name": "Liner.Designer Eye Liner Application Tool", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0036F_1_L.jpg/e7e30fe45fd4df01c868ccdeceebbc74/BEBL0036F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/linerdesignereyelinerapplicationtool/"},
{"colour": "", "id": 9, "brand": "Lilly Lashes", "product_description": "A unique pair of false lashes that work to deliver a sultry, sweeping finish.\nCreated by well-known beauty and fashion vlogger Janice Joostemaa, the Janice 3D Mink Band-Less Lashes are the embodiment of glamour. The unique design uses multiple clusters in an array of lengths ranging from the inner to outer corner to accentuate the eyes to deliver a flirty finish.", "price": "HK $223.20", "product_name": "Janice 3D Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0017F_1_L.jpg/c638c79ce86049cbfb35dcf2f28c0a4c/LILL0017F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/janice3dminkbandlesslashes/"},
{"colour": "", "id": 10, "brand": "Lilly Lashes", "product_description": "A lightweight set of false lashes for adding intense volume.\nDesigned to add instant depth to your favourite eye looks, the Layla 3D Faux Mink Band-Less Lashes are an essential for your favourite party looks. Attached to an invisible band, the silk-like fibres form a criss-cross pattern that mimics the illusion of natural volume.", "price": "HK $265.70", "product_name": "Layla 3D Faux Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0003F_1_L.jpg/8441fcbc8034d5b7f2a92a6c976a1b69/LILL0003F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/layla3dfauxminkbandlesslashes/"},
{"colour": "", "id": 11, "brand": "Lilly Lashes", "product_description": "Achieving volume and length has never been so easy, thanks to these super wispie lashes.\nDesigned with a gradient of length ranging from the inner to outer corner, the Sophia 3D Faux Mink Band-Less Lashes are ideal for adding a glamourous finish to your favourite looks. Attached to an invisible band the lightweight, silk-like fibres blend seamlessly with the natural lashes for a flawless finish.", "price": "HK $265.70", "product_name": "Sophia 3D Faux Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0006F_1_L.jpg/c4825d3bf081f2dda529eb9c3c42bf39/LILL0006F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/sophia3dfauxminkbandlesslashes/"},
{"colour": "", "id": 12, "brand": "Morphe", "product_description": "A hygienic and practical storage solution for your favourite makeup brushes.\nKeep your makeup brushes safe and neatly stowed with the BCS10 10 Slot Pro Leatherine Case from Morphe Brushes. Made from stylish and wipe clean leatherine, it features 10 slots to snuggly hold your favourite brushes, plus a protective flap to keep bristles safe in transit.", "price": "HK $61.80", "product_name": "BCS10 10 Slot Pro Leatherine Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0505F_1_L.jpg/2a07b3e278002c0293a3cf9d8bbbce4c/MOBR0505F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/bcs1010slotproleatherinecase/"},
{"colour": "", "id": 13, "brand": "Unicorn Lashes ", "product_description": "A pair of lengthening eyelashes.\nCreating extreme length, Mink Crystal Lashes Alanala dramatically curl for maximum impact. Becoming gradually longer, the outer corners of the eye flutter and feather for the ultimate doe eyed effect.", "price": "HK $249.80", "product_name": "Mink Crystal Lashes Alanala", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0026F_1_L.jpg/3042b5db92bdafca5fe93131e216214f/UNLA0026F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minkcrystallashesalanala/"},
{"colour": "", "id": 14, "brand": "Crimes Of Beauty", "product_description": "A small statement cosmetic bag.\nWith a detachable wrist strap, If You Can Do Liquid Eyeliner Small Wristlet Makeup Bag stores all your makeup essentials with ease. Designed with a faux leather finish, wipe clean and keep secure with a silver zip fastening.", "price": "HK $126.20", "product_name": "If You Can Do Liquid Eyeliner Small Wristlet Makeup Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/CROB0007F_1_L.jpg/bd56d8b46923b2a63522c56243fb16b4/CROB0007F_1_L.jpg", "product_url": "http://beautybay.com/accessories/crimesofbeauty/ifyoucandoliquideyelinersmallwristletmakeupbag/"},
{"colour": "", "id": 15, "brand": "beautyblender", "product_description": "An innovatively created absorbent sponge designed to keep oily skin at bay whilst out and about.\nDesigned with the unique foam technology that beautyblender are known for, the Blotterazzi Pro is a must-have for your handbag. Encased in a mirrored compact the tear drop shaped sponge is ideal for travel-friendly blotting even in the difficult areas of the face. Simply pressed onto the skin, the super-absorbant sponge diminishes the appearance of oiliness without moving your makeup for a perfected matte finish that lasts all day.", "price": "HK $153.00", "product_name": "Blotterazzi Pro", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0039F_1_L.jpg/b064991b85d6742f6f0239593d245588/BEBL0039F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/blotterazzipro/"},
{"colour": "Liquid BlenderCleanser 150ml – HK $143.50,\nLiquid BlenderCleanser 295ml – HK $220.00", "id": 16, "brand": "beautyblender", "product_description": "Beautyblender Liquid BlenderCleanser is a Soy-based cleanser for cleaning makeup sponges and brushes.\nUsing a low-sud formula with a light Lavender scent, Liquid BlenderCleanser breaks down residue and germs rapidly, certifying its status as truly environmentally friendly. Liquid BlenderCleanser retains the integrity of your beautyblender sponges or makeup brushes, leaving the applicator completely clean ready for the next makeup application.\nFree from Dyes and skin irritants, Liquid BlenderCleanser draws out dirt and impurities from your sponge making each application of makeup fresh and new.\nTake care of your beautyblender Sponge with Liquid BlenderCleanser.", "price": "HK $143.50", "product_name": "Liquid BlenderCleanser", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL-beautyblenderliquidblendercleanser_1_gl.jpg/9ce1c5e3364541f226ef52d29593d7e3/beautyblenderliquidblendercleanser_1_gl.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/liquidblendercleanser/"},
{"colour": "Mini Round Metal Pans – HK $47.90,\nMini Round Metal Pans – HK $69.10", "id": 17, "brand": "Z Palette", "product_description": "Z Palette Round Mini Round Metal Pans are your no limit customising tools for your chosen Z Palette.\nMini Round Metal Pans are already magnetised, ready to pop right onto the base of your Z Palette.\nWhether your palette is large, small or medium, the sturdy designs are ideal for lipsticks, concealers and foundations and Mini Round Metal Pans allow you to press loose pigments in to create your own shadows for limitless makeup creation.\nLabelling shade names is simple - just write them on the bottom of the pan so you know where to find your go-to shade quickly and easily.\n_Tip: We recommend using Z Palette's Spatula to help de-pot your pans from your branded Palettes to any Z Palette. _", "price": "HK $47.90", "product_name": "Mini Round Metal Pans", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL-zpaletteminiroundmetalpans_1_gl.jpg/c895b4a96f9264216bc0338a39eb4c5a/zpaletteminiroundmetalpans_1_gl.jpg", "product_url": "http://beautybay.com/accessories/zpalette/miniroundmetalpans/"},
{"colour": "", "id": 18, "brand": "Unicorn Lashes ", "product_description": "Dramatic false eyelashes.\nVarying in length, Mink Crystal Lashes Vespertine create natural volume. With a clear band and thick base, the feathery edges lengthen and detract for a subtly dramatic look.", "price": "HK $249.80", "product_name": "Mink Crystal Lashes Vespertine", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0028F_1_L.jpg/67d1bc97b3a90319f59354b05ac6201a/UNLA0028F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minkcrystallashesvespertine/"},
{"colour": "", "id": 19, "brand": "Morphe", "product_description": "A set of short, spiky lashes.\nFor a bold, eye enhancing look, ML30 Premium Lashes provide heavy volume at the band to draw attention. Transforming any look, the synthetic lashes are cruelty free and high quality for long, uninterrupted wear that's lightweight and comfortable.", "price": "HK $20.60", "product_name": "ML30 Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0779F_1_L.jpg/7d3c3d966091537612575a6bae9e3857/MOBR0779F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/ml30premiumlashes/"},
{"colour": "Sky Blue – HK $186.00,\nPearl White – HK $186.00,\nLavender – HK $186.00", "id": 20, "brand": "Z Palette", "product_description": "Z Palette Sunset Collection Large Magnetic Palette is the ultimate customisable palette created to store your makeup simply and easily.\nWe are all guilty of having our makeup stashes in different drawers and leaving our palettes on messy bathroom counter tops, Z Palette's Sunset Collection Large Magnetic Palette is our makeup organising saviour!\nPerfect for makeup artists and especially our makeup drawers, Sunset Collection Large Magnetic Palette allows you to put all your eye shadows, blushers and pressed powders in one compact space. Created to fit any size, shape or brand the metals pans stick to the magnetic base allowing you to mix and match both square and round pans. Sunset Collection Large Magnetic Palette has a clear window so you can see all your compacts at a glance and also features a lid that completely folds back giving you easy access to your makeup.\nMagnetic stickers come with Sunset Collection Large Magnetic Palette just in case your pans don't stick to the magnet base and if you have trouble finding your favourite powder, you can write what brand and colour the powder is on the bottom of the pan or sticker so you know exactly where to find your go-to shade. With everything in one place, Sunset Collection Large Magnetic Palette also allows you to be more creative by using shades you may not have had the chance to use before.\nLightweight, durable and eco-friendly, Sunset Collection Large Magnetic Palette's sleek slim designs are available in a range of styles allowing your Palette to be just as unique as your makeup!\n_Tip: We recommend using Z Palette's Spatula to help de-pot your pans from your branded Palettes to any Z Palette. _", "price": "HK $186.00", "product_name": "Sunset Collection Large Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL-zpalettesunsetcollectionlargepalette_1_gl.jpg/3e09de27f598afddf3f2c56277a4724d/zpalettesunsetcollectionlargepalette_1_gl.jpg", "product_url": "http://beautybay.com/accessories/zpalette/sunsetcollectionlargemagneticpalette/"},
{"colour": "", "id": 21, "brand": "Unicorn Lashes ", "product_description": "An incredibly fluffy set of false lashes that boast both volume and length.\nCrafted to give a sultry doe-eyed finish to any eye look, the 3D Mink Lashes Bambi are perfect for wearing both day and night. The comfortably lightweight falsies have been created with 100% mink hair secured to a deep black band offering you both durability and seamless glamour.", "price": "HK $244.30", "product_name": "3D Mink Lashes Bambi", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0002F_1_L.jpg/6cdea3a50ed9ddf34d8ff84d83c818c3/UNLA0002F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dminklashesbambi/"},
{"colour": "", "id": 22, "brand": "iWhite", "product_description": "iWhite Teeth Whitening Kit whitens teeth by up to 7 shades for a brighter, healthier smile.\nDesigned for instant, professional results in the comfort of your own home, iWhite Teeth Whitening Kit is an innovative one step system which actively removes stains and strengthens your teeth whilst delivering a natural whitening effect.\nFeaturing a new, revolutionary whitening gel which has been clinically proven to be safe and instantly effective, iWhite Teeth Whitening Kit is easy to wear and effortless to use. The product is composed of 10 thin and flexible trays to ensure a comfortable fit and maximum performance. No need to clean or boil mouthpieces, mess with syringes or brushes, measure gel or use special toothpastes or rinses. The individually packaged single use whitening trays are one size fits all and designed for optimal convenience and hygiene. This at home treatment should be worn 20 minutes a day during 5 consecutive days for an amazingly brighter smile that is up to 7 shades whiter.\niWhite Teeth Whitening Kit is based on a unique Film-Crystallised Calcium Technology which provides an instant whitening effect, actively removes stains and remineralises the teeth simultaneously. The white crystals used in combination with strong film forming Polymeric Agents will physically fix the crystals on the targeted tooth surface which will lead to an optical whitening effect.\nThis high performance teeth whitening kit also contains Phthalimido Peroxycaproic Acid (PAP), this unique patented ingredient targets and dissolves the unnatural double bounds which cause the dental discoloration without affecting the dental structure.\nThe whitening trays are manufactured with soft transparent material to improve the flexibility of the mouthpiece. The pressure gradient, which is one of the most important catalysing parameters of the whitening reaction is optimised and pushes the active gel on the teeth surface for maximum whitening results. The tray is designed to whiten both the front and the back of the teeth which is important because teeth are translucent and stains on the back can show through the front.\niWhite Teeth Whitening Kit leaves the teeth looking visibly whiter and brighter for a healthier smile whilst the teeth are strengthened with stains and discolouration effectively eliminated.", "price": "HK $318.30", "product_name": "Teeth Whitening Kit", "image_url": "http://images.contentful.com/eoaaqxyywn6o/IWHT0001U_2_L.jpg/b999f565f3532b1472baeb1d2209ed36/IWHT0001U_2_L.jpg", "product_url": "http://beautybay.com/accessories/iwhite/teethwhiteningkit/"},
{"colour": "", "id": 23, "brand": "Morphe", "product_description": "Morphe Brushes ZMB3 Roomy Set Bag is an extra-large storage solution for your makeup collection.\nIdeal for under bed or cupboard storage of your makeup and beauty essentials, ZMB3 Roomy Set Bag also allows for easy transportation and is loved by professional makeup artists. With one large compartment, ZMB3 Roomy Set Bag is ideal for those messy beauty addicts and is sure to keep all your makeup must haves together.\n", "price": "HK $239.20", "product_name": "ZMB3 Roomy Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0108F_1_L.jpg/ebe716ca825ad8b57cec485039b0f760/MOBR0108F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zmb3roomysetbag/"},
{"colour": "", "id": 24, "brand": "My Kit Co.", "product_description": "A synthetic pair of false eyelashes for maximum impact.\nFull and elongated, My Divine Lashes create a smoky feline finish. Adding volume and depth, the fuller outer corners add extreme drama, making the perfect accessory for a heavy, night out eye look.", "price": "HK $191.30", "product_name": "My Divine Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0073F_1_L.jpg/c1b7e2545cf44996a4820adb73795bc5/MYKI0073F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mydivinelashes/"},
{"colour": "", "id": 25, "brand": "Unicorn Lashes ", "product_description": "Add a sultry depth and whimsical curl to your favourite looks with these beautifully understated falsies.\nBigger is not always better and with these false lashes, the saying rings true; created with super-soft mink hair and a highly durable band, you can rely on these for your daily dose of drama. The 3D Mink Lashes Majestic AF are definitely a one of a kind pair that are an essential for any lash-lover's collection.", "price": "HK $212.50", "product_name": "3D Mink Lashes Majestic AF", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0007F_1_L.jpg/3ef4e06bcd6d48acd0a0b59d824e16ba/UNLA0007F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dminklashesmajesticaf/"},
{"colour": "", "id": 26, "brand": "Lilly Lashes", "product_description": "If length is what you seek, length is what you will get with these super long and wispie lashes.\nCreated to add a wide-eyed finish to your favourite looks, the Opulence Luxury Mink Lashes are a must-have for any lash-lover. Designed with super fine mink hairs, the lightweight lashes sit seamlessly along the lash-line delivering incomparable length and an effortlessly natural finish.", "price": "HK $212.60", "product_name": "Opulence Luxury Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0013F_1_L.jpg/564e1c9ae90b5dc8e3391d63b5d6ba5e/LILL0013F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/opulenceluxuryminklashes/"},
{"colour": "", "id": 27, "brand": "My Kit Co.", "product_description": "A large, clear makeup bag.\nAn ideal storage solution for bigger skincare items, My PVC Box Bag can hold larger bottles in an upright position. With a convenient handle and zip fastening, load, stack and carry for easy access.", "price": "HK $97.80", "product_name": "My PVC Box Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0028F_1_L.jpg/54a13f9f5125e9245beec6d658b2c4b4/MYKI0028F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mypvcboxbag/"},
{"colour": "", "id": 28, "brand": "Blinc", "product_description": "Blinc Heated Eyelash Curler shapes the lashes in seconds with extravagant, long lasting curves.\nDesigned to work without clamping the lashes or applying excessive pressure, Heated Eyelash Curler curls the lashes without unnecessary damage. Not only is it safer for the lashes but heated curls last longer than curls created by pressure and allows you to customise your lash curls to make your eyes look wider, more alert and youthful.\nHeated Eyelash Curler delivers the precise amount of heat that can set a long lasting curl and has a simple yet advanced design which offers optimal control and allows you to curl even the finest and shortest of lashes.\nReady to use in just 30 seconds, Heated Eyelash Curler has a built in safety guard which prevents contact with your eyes and skin.", "price": "HK $186.50", "product_name": "Heated Eyelash Curler", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BLIC0012F_1_L.jpg/b5fd6d494bfd14b0b9347ce1c6ece81c/BLIC0012F_1_L.jpg", "product_url": "http://beautybay.com/accessories/blinc/heatedeyelashcurler/"},
{"colour": "", "id": 29, "brand": "Morphe", "product_description": "A practical travel solution for your makeup essentials.\nCleverly designed with two exterior zip-close pockets and a main zip-topped compartment, the ZMB7 Collector Set Bag is the perfect way to carry your makeup kit with you wherever you go. Wipe clean, with transparent walls plus carry handles and an adjustable shoulder strap, it's the perfect choice for professional makeup artists and makeup lovers alike.\nMeasurements: 13''L x 6.5''W x 8.75''H\n_Please note, bag is supplied empty - makeup products are for illustrative purposes only and are not included. _", "price": "HK $175.20", "product_name": "ZMB7 Collector Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0513F_1_L.jpg/363a10ec9e3421d14a68529619b10bd3/MOBR0513F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zmb7collectorsetbag/"},
{"colour": "", "id": 30, "brand": "Festival Face", "product_description": "A pack of four henna sheets.\nInspired by traditional Indian and Persian embroidery, Zardozi White and Gold Metallic Tattoo Collection creates a delicate, bohemian vibe. Designed to be layered, apply the metallic patterns with matte accents all over the body for an effortlessly glam beach and festival accessory.", "price": "HK $212.60", "product_name": "Zardozi White and Gold Metallic Tattoo Collection", "image_url": "http://images.contentful.com/eoaaqxyywn6o/FEFA0028F_2_L.jpg/4144b1a83954a1e8cf6af8c0d6f29520/FEFA0028F_2_L.jpg", "product_url": "http://beautybay.com/accessories/festivalface/zardoziwhiteandgoldmetallictattoocollection/"},
{"colour": "", "id": 31, "brand": "Tweezerman", "product_description": "An exfoliating face tool.\nRemoving dead skin cells, Bright Complexion Facial Dermaplaner creates a brighter and clearer complexion. Gentle on the skin, comfortably hold in the palm of the hand and glide over skin in both directions to eliminate fine hair and dull skin.", "price": "HK $333.20", "product_name": "Bright Complexion Facial Dermaplaner", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0252U_1_L.jpg/ab08dbd7b658eb94654f58645eb1530f/TWEE0252U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/brightcomplexionfacialdermaplaner/"},
{"colour": "", "id": 32, "brand": "Lilly Lashes", "product_description": "Achieve daytime glam with these super subtle false lashes.\nDeveloped with silk-like fibres that effortlessly blend with your natural lashes, the Olivia 3D Faux Mink Band-Less Lashes are ideal for daily wear. The invisible band sits discreetly along the lash-line for a barely there finish.", "price": "HK $265.70", "product_name": "Olivia 3D Faux Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0004F_1_L.jpg/35b8b1c1a01df7d0a1bced4b64486e67/LILL0004F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/olivia3dfauxminkbandlesslashes/"},
{"colour": "Round Metal Pans – HK $47.90,\nRound Metal Pans – HK $69.10", "id": 33, "brand": "Z Palette", "product_description": "Z Palette Round Metal Pans are the ultimate tools for customising your chosen Z Palette.\nIf the pans from your branded Palette don't stick to the magnetic base of your chosen Z Palette, look no further!  Round Metal Pans are already magnetised, ready to pop right onto the base of your Z Palette.\nWhether your Palette is large, small or medium, the rounded compact designs are ideal for lipsticks, concealers and foundations and Round Metal Pans allow you to press loose pigments in to create your own shadows for limitless makeup creation or to help you make your own custom highlight and contour platform.\nLabelling shade names is simple - just write them on the bottom of the pan so you know where to find your go-to shade quickly and easily.\n_Tip: We recommend using Z Palette's Spatula to help de-pot your pans from your branded Palettes to any Z Palette. _", "price": "HK $47.90", "product_name": "Round Metal Pans", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL-zpaletteroundmetalpans_1_gl.jpg/9eae71e18e59f0d587521df128aec4b5/zpaletteroundmetalpans_1_gl.jpg", "product_url": "http://beautybay.com/accessories/zpalette/roundmetalpans/"},
{"colour": "", "id": 34, "brand": "Velour Lashes", "product_description": "Velour Lashes You Complete Me are the ideal false lash choice for girls who already have decently long lashes but want some extra thickness.\nThe pattern of these natural lashes gradually gets thicker as you reach the outer corner of the eye, with more fur concentrated at the ends. Beautifully handcrafted with 100% authentic Mink Hair, You Complete Me are easy to apply and can be reused up to 25 times.\nOffering a lightweight, natural look, Velour Lashes are cruelty free with Mink Hair ethically sourced from free range zoos, the luxurious Mink Hair is recycled during the shedding seasons and then sterilised to ensure it is completely safe for use.", "price": "HK $244.40", "product_name": "You Complete Me", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0004F_1_L.jpg/3969029d68e5ca584f998bcd37db5ade/VELA0004F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/youcompleteme/"},
{"colour": "", "id": 35, "brand": "Velour Lashes", "product_description": "Velour Lashes Guilty! Lashaholic are super dramatic Mink Hair false lashes.\nCombining the designs of the ever popular Hey Shawty! and Strike a Pose, Guilty! Lashaholic have a super thick and voluminous design with an extra short layer to create the thickness and the longest length is at the centre of the lash band for a truly glamorous lash flutter.\nThe perfect choice for any falsie addict, Guilty! Lashaholic have been beautifully handcrafted with 100% authentic Mink Hair, are easy to apply and can be reused up to 25 times. Offering a lightweight, natural look, Velour Lashes are cruelty free with Mink Hair ethically sourced from free range zoos, the luxurious Mink Hair is recycled during the shedding seasons and then sterilised to ensure it is completely safe for use.", "price": "HK $244.40", "product_name": "Guilty! Lashaholic", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0010F_1_L.jpg/bc1e4f1457312296a12d92a92fe67f02/VELA0010F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/guiltylashaholic/"},
{"colour": "", "id": 36, "brand": "My Kit Co.", "product_description": "A limited edition makeup bag.\nCreated to celebrate My Kit Co's first anniversary, My Prism Bag is a zipped, holographic travel bag. Embossed with the company's logo, fill with your favourite products to stack, store or carry everywhere you go.", "price": "HK $102.00", "product_name": "My Prism Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0033F_1_L.jpg/f6566233c305831b27fe80dba21eb389/MYKI0033F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myprismbag/"},
{"colour": "", "id": 37, "brand": "Alpha-H", "product_description": "Created to gently remove stubborn make up and residue from the surface of the skin, Everyday Fresh Cotton Cloths are the ideal partners in crime for your facial cleanser. Made from nothing but 100% pure cotton, the muslin cloths allow you to cleanse daily without the worry of irritation and abrasion on the skin, revealing a rejuvenated and glowing complexion every time.", "price": "HK $159.40", "product_name": "Everyday Fresh Cotton Cloths 7Pieces", "image_url": "http://a0.bb-cdn.com/assets/productimages/large/alph0128f_1_l.jpg", "product_url": "http://beautybay.com/skincare/alphah/everydayfreshcottoncloths/"},
{"colour": "", "id": 38, "brand": "Velour Lashes", "product_description": "Velour Lashes T Dot Ohhh! are a pair of unique Mink lashes which create a natural looking two tone effect.\nExquisitely handcrafted with 100% authentic Mink Hair derived ethically from free range zoos, T Dot Ohhh! has a semi dramatic design with a pattern that gradually gets longer towards the ends giving you the Taylor Swift wing at the corner of the eye.\nSuitable for all occasions from rock concerts and cocktails to a casual day look, T Dot Ohhh! will suit all eye shapes and were recently seen on Nicole Ritchie at the Met Gala. Offering a lightweight, natural look, Velour Lashes can be reused up to 25 times and are sure to be a Beauty Bay best-seller.", "price": "HK $244.40", "product_name": "T Dot Ohhh!", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0006F_1_L.jpg/10f626f417cd46fd6d60c6efce602a9a/VELA0006F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/tdotohhh/"},
{"colour": "", "id": 39, "brand": "Lilly Lashes", "product_description": "Fluttery, false lashes.\nDesigned by a celebrity makeup artist, Ash Kholm 3D Mink Lashes accentuate all eye shapes. Adding subtle volume and definition, each strip lash adds dramatic wings that can be reused up to twenty times.", "price": "HK $318.80", "product_name": "Ash Kholm 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0043F_1_L.jpg/83e177571124b2a0165c1ecc8834eaa8/LILL0043F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/ashkholm3dminklashes/"},
{"colour": "Limited Edition Deep Sleep Heavenly Candle 220g – HK $212.60", "id": 40, "brand": "This Works", "product_description": "This Works Limited Edition Deep Sleep Heavenly Candle is a lovingly hand poured wax candle that is 100% Cruelty free.\nWith a spicy blend of Cinnamon and warm, woody scents of Frankincense, Myrrh and Cedar, this opulent candle fills any home with comforting, refreshing scent. Balancing both the body and soul, Limited Edition Deep Sleep Heavenly Candle has a burn time of 4 hours and has a rich infusion of Essential Aromatherapy Oils which allows for an exquisite sensory experience.\nThe ultimate luxury, Limited Edition Deep Sleep Heavenly Candle is perfect companion for your home.", "price": "HK $212.60", "product_name": "Limited Edition Deep Sleep Heavenly Candle", "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0233U_1_L.jpg/3e067f94e53f3a85841502aa1d79eac0/THWO0233U_1_L.jpg", "product_url": "http://beautybay.com/accessories/thisworks/limitededitiondeepsleepheavenlycandle/"},
{"colour": "", "id": 41, "brand": "Ardell", "product_description": "Ardell Fashion Lashes 105 are natural looking curved false lashes with added volume.\nReusable and easy-to-apply, Fashion Lashes 105 can be used for up to three weeks and help to accentual the volume, length and definition of your natural lashes. Made from 100% sterilised human hair, Fashion Lashes 105 are a Beauty Bay best-seller and are perfect for any occasion.", "price": "HK $44.70", "product_name": "Fashion Lashes 105", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE0002F_1_L.jpg/e4c6823c2206aa3e55a0d9fc8f473311/ARDE0002F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/fashionlashes105/105"},
{"colour": "", "id": 42, "brand": "St.Tropez", "product_description": "St.Tropez Tan Remover Mitt effortlessly removes tan build-up and eliminates patchiness and streaks.\nA must for any regular self-tanner, Tan Remover Mitt is the first multi-purpose tanning accessory which effectively removes and evens out a fully developed self tan. Designed to give confidence to even the most nervous self tanner, Tan Remover Mitt is expertly crafted with a 4-way Mesh which gently removes any build-up, streaks or mistakes in application and buffs away dry skin for a smoother tan application.\nEven after your tan has fully developed the mitt can be used to help correct tanning mistakes and regular use will ensure super soft, silky, perfectly tanned skin.", "price": "HK $46.80", "product_name": "Tan Remover Mitt", "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0058F_1_L.jpg/17eadf6a5fd5c12702839df8dc94724a/STTR0058F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sttropez/tanremovermitt/"},
{"colour": "", "id": 43, "brand": "Lilly Lashes", "product_description": "Flirty and fluttery, these falsies are a lash-lover's dream.\nWith varying lengths and a super black finish, the Tease Luxury Mink Lashes are a must-have for any beauty collection. The fine, wispie mink hairs are attached to a black band to provide a sultry effect with added depth.", "price": "HK $212.60", "product_name": "Tease Luxury Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0014F_1_L.jpg/0f14533ff9e1a628ba820b0f88306ce1/LILL0014F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/teaseluxuryminklashes/"},
{"colour": "", "id": 44, "brand": "My Kit Co.", "product_description": "A small, clear makeup bag.\nWith a clear front, My Small Canvas Pouch allows for easy, convenient storage. With the ability to see what's inside, fill and stack for the ultimate organisation and easy travel solution.", "price": "HK $59.50", "product_name": "My Small Canvas Pouch", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0017F_1_L.jpg/13fa1b8d5cc164e809e99f4dd3452a8a/MYKI0017F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mysmallcanvaspouch/"},
{"colour": "", "id": 45, "brand": "Sigma Beauty", "product_description": "Deeply clean and dry your brushes with this innovative travel friendly gadget from Sigma.\nDeveloped to combine two of Sigma's best-selling brush care innovations, the Dry'n Shape Spa is ideal for the on-the-go beauty lover. Harbouring a number of raised surfaces the cylindrical cleaning utensil ensures the deepest of cleanses no matter what the brush or bristle type. Held alongside the multiple surface on the same barrel is space for eighteen brushes to be dried and shaped to perfection meaning you can now get your tools looking as good as new anywhere.", "price": "HK $255.10", "product_name": "Dry'n Shape Spa", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0155F_1_L.jpg/7895693bc9169cc44cd7aa3ad9df1b61/SIGM0155F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/drynshapespa/"},
{"colour": "", "id": 46, "brand": "Tweezerman", "product_description": "A rose gold tweezing set.\nWith a stylish rose gold finish, Rose Gold Mini Slant Tweezer & Mirror Set offers precise and accurate tweezing. Designed with suction cups, the 10X magnifying mirror allows easy, hands free use of the hand-filed, slanted tweezers.", "price": "HK $272.60", "product_name": "Rose Gold Mini Slant Tweezer & Mirror Set", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0249U_1_L.jpg/16a5e276cf189769a7026f16a07d7bad/TWEE0249U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/rosegoldminislanttweezermirrorset/"},
{"colour": "", "id": 47, "brand": "Mr. Blanc", "product_description": "Mr Blanc Professional Teeth Whitening Strips 2 Weeks Supply is a teeth whitening wonder that will reveal a pearly white smile.\nThe flexible tooth-whitening strips are designed to follow the contour of your teeth for easy and comfortable teeth whitening with no fuss.\nThe strips are layered with a tooth whitening gel which removes deeply embedded stains beneath the surface of the enamel in a safe and effective way. Visibly whitening teeth in up to 14 days, Professional Teeth Whitening Strips 2 Weeks Supply prevents the generation of future stains and need to be applied to the teeth for up to 30 minutes in order for the teeth whitening strip to work their magic.\nThe Peroxide Free strips eliminate stains without leaving any sensitivity, so even if you do have sensitive teeth, the treatment will be painless and the best thing about Professional Teeth Whitening Strips 2 Weeks is that the gel used on the strips does not have any unusual after taste which is often associated with whitening your teeth.\nFor healthier, whiter and cleaner teeth with ultimate sparkle, let Mr Blanc do the work and be smile ready for any occasion!", "price": "HK $239.10", "product_name": "Professional Teeth Whitening Strips 2 Weeks Supply", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MRBL0001U_1_L.jpg/5f1159dc0288085e5d6f59c54099cda9/MRBL0001U_1_L.jpg", "product_url": "http://beautybay.com/accessories/mrblanc/professionalteethwhiteningstrips2weekssupply/"},
{"colour": "", "id": 48, "brand": "Sigma Beauty", "product_description": "A convenient place for storing drying brushes without the ever ending struggle for space.\nHolding up to ninety two brushes, the Sigma Dry'N Shape Tower Full Set allows for the simple drying of your whole collection. Creating with conveniently spaced clips and drying bands, brushes hang upside down to ensure for the complete removal of moisture whilst keeping their shape.", "price": "HK $701.40", "product_name": "Dry'N Shape Tower Full Set", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0101F_1_L.jpg/391238ade10a03b5a280553127c9ffe6/SIGM0101F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/drynshapetowerfullset/"},
{"colour": "", "id": 49, "brand": "Unicorn Lashes ", "product_description": "Dramatic false eyelashes.\nVolumising and defining, Mink Crystal Lashes Amalthea create a dramatic, high impact eye look. Thick and dark, seamlessly apply the clear band to the lash line for the perfect finishing touch.", "price": "HK $249.80", "product_name": "Mink Crystal Lashes Amalthea", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0030F_1_L.jpg/8e55932ebafec13acabe7d0600325a6a/UNLA0030F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minkcrystallashesamalthea/"},
{"colour": "", "id": 50, "brand": "Morphe", "product_description": "Medium sized magnetic eyeshadow palette.\nMade for fifteen individual eyeshadows, ACC10 Empty Magnetic Palette is the easiest way to take your favourite colours everywhere. Snap any single, standard Morphe shadow in to the empty palette for a versatile storage or travel solution.", "price": "HK $72.20", "product_name": "ACC10 Empty Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0696F_1_L.jpg/09e5026b1a9ebce1e55431b8d8bf260d/MOBR0696F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/acc10emptymagneticpalette/"},
{"colour": "", "id": 51, "brand": "My Kit Co.", "product_description": "A professional brush holder.\nCarry and store your makeup brushes with My Brush Buddy. With a detachable and extendable strap, wear your brushes for ultimate easy access at home or on set. Wipe clean, the clear sides make it easier to see what's inside and the divider separates clean and used brushes.", "price": "HK $276.30", "product_name": "My Brush Buddy", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0063F_1_L.jpg/3b575141b8cefeb53b0c1d5577b3ba78/MYKI0063F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mybrushbuddy/"},
{"colour": "", "id": 52, "brand": "Morphe", "product_description": "A clear makeup case for holding all your beauty essentials.\nWith a convenient transparent design so you can see all your makeup at a glance, the ZMB2 Packer Set Bag is an essential for toting your makeup necessities with you wherever you go. Whether you're a makeup professional, or simply a fan, it has a host of features which will prove invaluable. From its wipe clean material for easy clear ups, to the multitude of pockets of varying sizes to hold all your favourites with ease, plus two carrying handles and an adjustable shoulder strap makes it easy to carry.\nMeasurements: 16''L x 6.5''W x 8.5''H\n_Please note, bag is supplied empty - makeup products are for illustrative purposes only and are not included. _", "price": "HK $309.30", "product_name": "ZMB2 Packer Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0511F_1_L.jpg/3a59654c8c834c3ca5c8655ea626eb23/MOBR0511F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zmb2packersetbag/"},
{"colour": "", "id": 53, "brand": "My Kit Co.", "product_description": "Versatile makeup sponges.\nIn a clear, zip-lock bag, My Super Set Sponges comes with five latex-free sponges. Easily manipulated, shape them as you like to apply and blend cream and powder products.", "price": "HK $38.30", "product_name": "My Super Set Sponges", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0004F_1_L.jpg/1bf3a99dee93185dc92f2b290cec0138/MYKI0004F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mysupersetsponges/"},
{"colour": "", "id": 54, "brand": "Velour Lashes", "product_description": "Velour Lashes Whispie Me Away are demi whispie false lashes beautifully handcrafted with Mink Hair.\nAs seen on Demi Lovato and Julianne Hough, Whispie Me Away are made with ethically sourced and sterilised Mink Hair from free range zoosand have been designed for everyday wear with the fur distributed with a gradient effect along the Cotton band.\nReusable for up to 25 times, Whispie Me Away are suitable for all eye shapes and are easy to apply. This semi natural lash gives you a gradient effect getting longer towards the outer corners while maintaining a very natural look of \"clusters\" along your eyes. With these lashes, you'll have prince charming knocking at your door in no time!", "price": "HK $244.40", "product_name": "Whispie Me Away", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0011F_1_L.jpg/b660e097e72c85589cad9030f778657f/VELA0011F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/whispiemeaway/"},
{"colour": "", "id": 55, "brand": "Paul & Joe", "product_description": "Paul & Joe Gel Foundation Case is a stylish storage case for the Gel Foundation Refill (sold separately).\nThe perfect addition for any makeup bag, Gel Foundation Refill is the perfect storage solution for your Paul & Joe Gel Foundation. With a signature champagne gold design with chrysanthemum motif, Gel Foundation Refill allows you to create your own unique foundation compact and is a handbag essential.\n", "price": "HK $75.90", "product_name": "Gel Foundation Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC1469F_1_L.jpg/c35d22aef2d4d10d225ec0916c3f5b05/PAJC1469F_1_L.jpg", "product_url": "http://beautybay.com/accessories/pauljoe/gelfoundationcase/"},
{"colour": "", "id": 56, "brand": "Mr. Blanc", "product_description": "Mr Blanc Express Teeth Whitening Top Ups work tirelessly to whiten and brighten the teeth whilst on-the-go.\nWith the ability to provide instantly whiter and fresher teeth in just fourteen days, Express Teeth Whitening Top Ups gently yet effectively eradicates traces of stains and discolouration that can build up throughout daily life.\nEffortless to use and perfect for those who are constantly busy, these sensational strips apply easily to the teeth and then slowly dissolve, leaving you with a pure, illuminated smile that is guaranteed to be noticed.\nSlipping seamlessly into any beauty regime, Express Teeth Whitening Top Ups remove stains caused by numerous food and drinks, such as coffee, tea, fruit juice and red wine, making it a certified cosmetic essential for everyone.\nActing exquisitely as a top-up before a vital social event, these transparent and thin strips have been proven to miraculously whiten the teeth by up to four shades lighter, without the use of Peroxide.\nGuaranteeing to cause little to no discomfort, Express Teeth Whitening Top Ups are the latest offering from the beauty experts at Mr Blanc, where convenience collides with cosmetic necessity.\nSmile and make the world a brighter place with Express Teeth Whitening Top Ups.", "price": "HK $191.20", "product_name": "Express Teeth Whitening Top Ups", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MRBL0002U_1_L.jpg/b15fd01d3f49afc2123719307b2d8097/MRBL0002U_1_L.jpg", "product_url": "http://beautybay.com/accessories/mrblanc/expressteethwhiteningtopups/"},
{"colour": "", "id": 57, "brand": "Violet Voss", "product_description": "Full, voluminous lashes.\nA pair of tapered false eyelashes, Eye Need You Premium 3D Faux Mink Lashes add drama and definition. Made with high quality synthetic fibres, the handmade, criss-cross layers create a natural fullness that can be reused up to ten times.", "price": "HK $100.40", "product_name": "Eye Need You Premium 3D Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0082F_1_L.jpg/fa917ecb16d151c2ce98d176035ea149/VIVO0082F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/eyeneedyoupremium3dfauxminklashes/"},
{"colour": "Stainless Steel – HK $186.70,\nMidnight Sky – HK $186.70,\nGranite Sky – HK $186.70,\nPretty In Pink – HK $186.70,\nBlue Jewel – HK $186.70", "id": 58, "brand": "Tweezerman", "product_description": "Tweezerman Slant Tweezer is an award winning general use pair of tweezers designed for expert brow shaping.\nRenowned for their precision and quality, Tweezerman's legendry Slant Tweezers are available in an array of colours. Perfect for transforming unruly brows into sleek, sexy and shapely arches, Slant Tweezers are constantly recommended by top eyebrow artists and are a BeautyBay essential.\nSlant Tweezer features slanted tips which are hand filed and perfectly aligned to grab the hair every time for ease of use and perfectly groomed brows. We've all been annoyed by using tweezers that don't properly grip. With superior calibrated tension and perfectly aligned, hand-filed precision tips, Tweezerman tweezers close evenly and firmly, creating the cleanest, most advanced pulling power. These are the tweezers you'll own your lifetime.", "price": "HK $186.70", "product_name": "Slant Tweezer", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE-tweezermanslanttweezer_1_GL.jpg/6b7c0a6bd918810211bb4693544df4ce/tweezermanslanttweezer_1_GL.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/slanttweezer/"},
{"colour": "", "id": 59, "brand": "beautyblender", "product_description": "A duo of mini sponges created to apply makeup to even the smallest of areas.\nCreated in a new black shade as a nod to makeup artists world-wide, the Micro.Mini Pro Blenders are the must-have little sisters to the Orignial beautyblender. Hand cut from the brands innovative foam technology, the smaller sponges are the perfect companion for blending into the harder to reach areas of the face such as the inner corners, the under-eyes and along the brow bone for a precisely perfected finish.", "price": "HK $138.70", "product_name": "Micro.Mini Pro Blenders", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0040F_1_L.jpg/f3b2fb6df36bebb7ba15a26f2c95928a/BEBL0040F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/microminiproblenders/"},
{"colour": "", "id": 60, "brand": "Lilly Lashes", "product_description": "A volume and length boosting set of false lashes ideal for giving your looks a feminine finish.\nCreated with the finest mink hairs, the Divine Luxury Mink Lashes are a super lightweight addition to any finished look. Incredibly full, the unique lashes flare out towards the outer edge for wide-eyed, elegant results.", "price": "HK $212.60", "product_name": "Divine Luxury Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0009F_1_L.jpg/a737d6e519a194701224e217a8c597a8/LILL0009F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/divineluxuryminklashes/"},
{"colour": "", "id": 61, "brand": "Violet Voss", "product_description": "Dramatic false eyelashes.\nEyes Eyes Baby Premium 3D Faux Mink Lashes, add length, volume and definition. Straight and angled, they create a natural effect with a full and playful finish. Attracting attention to the layered band the volumising, high quality synthetics can be worn up to ten times.", "price": "HK $100.40", "product_name": "Eyes Eyes Baby Premium 3D Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0085F_1_L.jpg/72e51e227f44e22ffacb9f0666f7653d/VIVO0085F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/eyeseyesbabypremium3dfauxminklashes/"},
{"colour": "", "id": 62, "brand": "beautyblender", "product_description": "An all-inclusive kit for beginners and pro artists alike.\nDesigned to offer all the tools you need to create an effortlessly flawless base, the All.About.Face Collection is a must-have introduction into the beautyblender world. Whether you're looking to sculpt, highlight or construct a flawless base, this set holds all of the answers.", "price": "HK $334.80", "product_name": "All.About.Face Collection", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0044F_1_L.jpg/2785443c5efba8806699f564cb91989c/BEBL0044F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/allaboutfacecollection/"},
{"colour": "", "id": 63, "brand": "Lilly Lashes", "product_description": "An ultra-wispie set of false lashes ideal for achieving an Insta-worthy finish.\nKylie Jenner's favourite of the Lilly Lashes range, Miami 3D Mink Lashes are the perfect way to gain a seductive finish to your favourite looks. Ultra-long, yet incredibly lightweight, these lashes sit seamlessly along the lash-line for comfortable wear with enviable results.", "price": "HK $318.80", "product_name": "Miami 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0020F_1_L.jpg/77d2cf7d1e422fb36c0a43b3ffbcf45d/LILL0020F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/miami3dminklashes/"},
{"colour": "Square Metal Pans – HK $33.50,\nSquare Metal Pans – HK $69.10", "id": 64, "brand": "Z Palette", "product_description": "Z Palette Square Metal Pans are your no limit customising tools for your chosen Z Palette.\nWhether your Palette is large, small or medium, the square sturdy designs are ideal for lipsticks, concealers and foundations and allow you to press loose pigments in to create your own shadows for limitless makeup creation. Labelling shade names is simple - just write them on the bottom of the pan so you know where to find your go-to shade quickly and easily.\nSquare Metal Pans are already magnetised, ready to pop right onto the base of your Z Palette letting you get straight into your makeup application.", "price": "HK $33.50", "product_name": "Square Metal Pans", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL-zpalettesquaremetalpans_1_gl.jpg/162a3671fa3f2d6a2da62a2f75c4b2fd/zpalettesquaremetalpans_1_gl.jpg", "product_url": "http://beautybay.com/accessories/zpalette/squaremetalpans/"},
{"colour": "", "id": 65, "brand": "Morphe", "product_description": "Delicate and customisable individual lashes.\nPerfect for the lower lash line, ML Flare U Premium Lashes add subtle definition and volume. For tiny, natural flares they can also be applied to the upper lash line. Transforming any look, the synthetic lashes are cruelty free and high quality for long, uninterrupted wear that's lightweight and comfortable.", "price": "HK $41.20", "product_name": "ML Flare U Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0786F_1_L.jpg/2f19a076edef8117eedb58b21eacb53a/MOBR0786F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/mlflareupremiumlashes/"},
{"colour": "", "id": 66, "brand": "BH Cosmetics", "product_description": "An eight pocket, transparent travel case.\nDeveloped with seven exterior pockets and one central compartment, the Studio Pro Large Set Bag has been created to store and carry your entire beauty collection. Complete with adjustable straps and an easy wipe finish, this sturdy storage solution offers optimum organisation.", "price": "HK $306.10", "product_name": "Studio Pro Large Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BHCO0145F_1_L.jpg/a256640d4957ba42deddd90c24ec99bd/BHCO0145F_1_L.jpg", "product_url": "http://beautybay.com/accessories/bhcosmetics/studioprolargesetbag/"},
{"colour": "", "id": 67, "brand": "Z Palette", "product_description": "Z Palette Extra Large Magnetic Palette Black is a customisable palette created to store your make-up simply and easily.\nThe patented Z Palette was created by makeup artist and Emmy award-winning Zena Shteysel, who after years of lugging her heavy, cumbersome make-up kit from place to place knew that there had to be a better way to lighten her load and get organised and so the Z Palette was born.\nThe largest size palette in Z Palette's line-up, Extra Large Magnetic Palette Black allows you to put all your eye shadows, blushers and pressed powders in one compact space. Created to fit any size, shape or brand the metals pans stick to the magnetic base allowing you to fit up to 35 standard sized pans in the Palette.\n10 round metal stickers and 10 square metal stickers come with Extra Large Magnetic Palette Black just in-case your pans don't stick to the magnetic base and if you have trouble finding your favourite powder, you can write what brand and colour the powderis on the bottom of the pan or sticker so you can keep track of all your favourite shades. Extra Large Magnetic Palette Black features a clear window so you can see all your compacts at a glance and also has a lid that completely folds back giving you easy access to your make-up.\nLightweight, durable and eco-friendly, Extra Large Magnetic Palette Black's sleek slim design makes it ideal for makeup artists, travel and saving space in your drawers - meaning you can go ahead and add more make-up to your collection!\n_Tip: We recommend using Z Palette's Spatula to help de-pot your pans from your branded palettes to any Z Palette. _", "price": "HK $239.20", "product_name": "Extra Large Magnetic Palette Black", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0001F_2_L.jpg/d64f4635541fcb411735ba07423e39b9/ZPAL0001F_2_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/extralargemagneticpaletteblack/black"},
{"colour": "", "id": 68, "brand": "This Works", "product_description": "This Works Baby Sleep Pillow Spray Sleep like a Prince is calming pillow sprays to help the little Prince in your life have a restful sleep.\nTo celebrate the arrival of Kate and William's second child, this Limited Edition spray is expertly blended with the highest grade Essential Oils.\nA blend of Lavender, Vetivert and Wild Chamomile is renowned for its sedative and calming properties and will help to relax and ease the baby to sleep. Sleep Like A Prince has a safety approved formula which utilises a 100% natural fragrance which won't irritate the skin or stain fabrics.\nSleep Like A Prince promotes a good nights sleep for all ages and creates a relaxing atmosphere.", "price": "HK $195.60", "product_name": "Baby Sleep Pillow Spray Sleep Like A Prince 120ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0212F_1_L.jpg/7ec4d5c40f9528e176b5e9c769a74861/THWO0212F_1_L.jpg", "product_url": "http://beautybay.com/accessories/thisworks/babysleeppillowspraysleeplikeaprince/"},
{"colour": "", "id": 69, "brand": "Unicorn Lashes ", "product_description": "A set of subtle false lashes to add natural looking length.\nKeeping all the length towards the outer corner, the Mink Lashes Wanderlust offer a sultry touch of daring drama. Crafted with only the finest mink hairs and an incredible durable black band, worn either daily or for special occasions these will definitely add an eye-catching finish.", "price": "HK $212.50", "product_name": "Mink Lashes Wanderlust", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0011F_1_L.jpg/a16af48f4152abae7d49b8d201830ea7/UNLA0011F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minklasheswanderlust/"},
{"colour": "", "id": 70, "brand": "Velour Lashes", "product_description": "Velour Lashes Girl You Craazy are the ideal false lash choice for girls who want to create wild and daring lash looks.\nThis unique and exclusive design by Velour Lashes is a Beauty Bay favourite; the design mimics a layering lash with thick thin pattern stacked on top of a criss cross pattern lash, giving your eyes the volume it needs with even thickness throughout the entire eye. Beautifully handcrafted with 100% authentic Mink Hair, Girl You Craazy are easy to apply and can be reused up to 25 times.\nOffering a lightweight, natural look, Velour Lashes are cruelty free with Mink Hair ethically sourced from free range zoos, the luxurious Mink Hair is recycled during the shedding seasons and then sterilised to ensure it is completely safe for use.", "price": "HK $244.40", "product_name": "Girl You Craazy", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0013F_1_L.jpg/9a7e82fb01d99922f64726a03be08992/VELA0013F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/girlyoucraazy/"},
{"colour": "", "id": 71, "brand": "Crimes Of Beauty", "product_description": "A small statement cosmetic bag.\nWith a detachable wrist strap, Slay Embossed Small Wristlet Makeup Bag stores all your makeup essentials with ease. Designed with a faux leather finish, wipe clean and keep secure with a silver zip fastening.", "price": "HK $126.20", "product_name": "Slay Embossed Small Wristlet Makeup Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/CROB0006F_1_L.jpg/a671b0925028a47eb919cf1585e11f68/CROB0006F_1_L.jpg", "product_url": "http://beautybay.com/accessories/crimesofbeauty/slayembossedsmallwristletmakeupbag/"},
{"colour": "", "id": 72, "brand": "Velour Lashes", "product_description": "Velour Lashes Take It And Go are the ideal false lash choice for girls who crave that wispy lash effect that is constantly in trend.\nThe pattern of these natural criss-crossed lashes starts thicker at the base and gradually disperses for a flutter-worthy effect. Beautifully handcrafted with 100% authentic Mink Hair, Take It And Go are easy to apply and can be reused up to 25 times for added convenience.\nOffering a lightweight, natural look, Velour Lashes are Cruelty-free with Mink Hair ethically sourced from free range zoos, the luxurious Mink Hair is recycled during the shedding seasons and then sterilised to ensure it is completely safe for use.\nFind that perfect balance between drama and nature with the iconic Take It And Go from the experts at Velour Lashes.", "price": "HK $244.40", "product_name": "Take It And Go", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0024F_1_L.jpg/279f8a9c96078427287a0789d47fc444/VELA0024F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/takeitandgo/"},
{"colour": "", "id": 73, "brand": "beautyblender", "product_description": "Beautyblender Bling Ring is a beautiful ring stand for your Beautyblender Sponge.\nAdding a fabulous touch of sparkle to your dressing table, Bling Ring provides the perfect storage for your beautyblender Sponge whilst it dries out. The pink and silver gemstone stand supports your BeautyBlender Sponge keeping it free from bacteria, germs and residue.\nComplete with the Bling Ring stand, this pretty set also contains a beautyblender Sponge in Pink. Invented by top Hollywood makeup artists Rea Ann Silva and Veronica Lorenz, beautyblender Sponge has a patent-pending elliptical shape which makes application fool proof by allowing you to access hard-to-reach areas with stunning ease.\nThe unique suede texture is sensual to the touch whilst the curves fit the contours of your face, leaving your makeup dazzling and undetectable. Latex free, non-allergenic and odour free, Beauty Blender Sponge issuitable for all skin types and is a BeautyBay best-seller.", "price": "HK $210.40", "product_name": "Bling Ring", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0022F_1_L.jpg/96a5c12f25ebeb8638f064b8e01777fc/BEBL0022F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/blingring/"},
{"colour": "Leopard – HK $101.00,\nHot Pink – HK $101.00,\nBlack – HK $101.00", "id": 74, "brand": "Z Palette", "product_description": "Z Palette Small Magnetic Palette is a customisable palette created for loose pans that need a place to call home.\nFitting into your handbag or clutch bag, Small Magnetic Palette is perfect for on-the-go touch ups and fits up to 9 standard-sized round pans so you can easily switch out shades for whatever style of makeup you're feeling that day. Featuring an open window so you can see all your compacts at a glance, Small Palette also features a lid that completely folds back giving you easy access to your makeup whilst saving space.\nMagnetic stickers come with Small  Magnetic Palette just in case your pans don't stick to the magnet base and if you have trouble finding your favourite powder, you can write what brand and colour the powder is on the bottom of the pan or sticker so you know exactly where to find favourite shades.\nLightweight, durable and Eco-Friendly, Small Magnetic Palette is available in a range of unique designs and will fit just about anywhere making sure your makeup is at its best all day long and way into the night.", "price": "HK $101.00", "product_name": "Small Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL-zpalettesmallpalette_1_gl.jpg/cab618bb974ef226f6c6df71f4331ac5/zpalettesmallpalette_1_gl.jpg", "product_url": "http://beautybay.com/accessories/zpalette/smallmagneticpalette/"},
{"colour": "", "id": 75, "brand": "Velour Lashes", "product_description": "Velour Lashes Keep It On The Low are innovative Mink false lashes specifically designed to enhance the lower lashes.\nBe the first to nail the latest trend which sees lower lashes taking over; Keep It On The Low have a stylish criss cross design which dramatically opens up your eyes. Unlike the harsh synthetic lashes, Keep It On The Low used Mink Fur to create a natural feathery look.\nThe perfect choice for any falsie addict, Keep It On The Low have been beautifully handcrafted with 100% authentic Mink Hair, are easy to apply and can be reused up to 25 times. Offering a lightweight, natural look, Velour Lashes are cruelty free with Mink Hair ethically sourced from free range zoos, the luxurious Mink Hair is recycled during the shedding seasons and then sterilised to ensure it is completely safe for use.", "price": "HK $212.60", "product_name": "Keep It On The Low", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0021F_1_L.jpg/1621bff0fa5e4c5ff001df50823d4991/VELA0021F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/keepitonthelow/"},
{"colour": "", "id": 76, "brand": "Velour Lashes", "product_description": "Velour Lashes Doll Me Up are handcrafted Mink lashes which create an unforgettable doll-like eye look.\nMake a lasting impression with these 100% natural and cruelty free false lashes; handcrafted with 100% authentic Mink Hair, Doll Me Up will give you extra length and create a stylishly sexy impact. The design of these lashes follow a long-short pattern, with more mink concentrated at the longer sections. The actual pattern is evenly distributed along the entire band allowing for a dramatic result.\nAs seen on Marina and the Diamonds, Doll Me Up are easy to apply and can be reused up to 25 times. Offering a lightweight, natural look, Velour Lashes are cruelty free with Mink Hair ethically sourced from free range zoos, the luxurious Mink Hair is recycled during the shedding seasons and then sterilised to ensure it is completely safe for use.", "price": "HK $244.40", "product_name": "Doll Me Up", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0005F_1_L.jpg/ac251fc1364f3965f218a6ac34442c57/VELA0005F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/dollmeup/"},
{"colour": "", "id": 77, "brand": "beautyblender", "product_description": "Beautyblender Micro Mini Duo is a micro sized blending sponge ideal for applying and blending makeup on the smaller areas of the face.\nBlend, baby, blend! Micro Mini Duo offers the same 360 degrees of edgeless perfection as it's grown up predecessor the Original beautyblender but with more precision. The unique suede texture is sensual to the touch whilst the curves fit the contours of your face, leaving your makeup dazzling and undetectable. Latex free, non-allergenic and odour free, Micro Mini Duo is suitable for all skin types and keeps your makeup on the surface of the sponge rather than absorbing it and creating unnecessary wastage.\nPerfect for effortlessly blending concealer, eye primer and creamy eye shadow, Micro Mini Duo is specifically made for smaller areas such as under the eye, inner eye corners, eyelids, brow bones, sides of the nose and top of the cheeks, it can also be used on targeted acne spots for flawless coverage.\nMicro Mini Duo contains two sponges to ensure you are never without this makeup miracle worker and is a Beauty Bay essential for modernising your makeup regime.", "price": "HK $138.70", "product_name": "Micro Mini Duo", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0019F_1_L.jpg/f566fa9662d60229ce9e774492595c61/BEBL0019F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/microminiduo/"},
{"colour": "", "id": 78, "brand": "Nails Inc", "product_description": "Nails Inc Exercise Slogan Cosmetic Bag is a PVC makeup bag with enough space to fit all of you favourite beauty and nail care essentials!\nThis bag has attitude and we love it! The eye-catching design wipes clean with ease and fits perfectly into your handbag or suitcase making it your emergency makeup saviour! Emblazoned with the tongue-in-cheek affirmation 'Did you just say EXCERSISE? Sorry, I thought you said EXTRA FRIES' and a truly unique patterned design, Exercise Slogan Cosmetic Bag is a must-have for any Nails Inc fanatic!\nTake care of your cosmetic collection using the highly-coveted Exercise Slogan Cosmetic Bag.", "price": "HK $113.10", "product_name": "Exercise Slogan Cosmetic Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NAIN0638F_1_L.jpg/fa7d14ac8fda395473ea181d5fea0cb2/NAIN0638F_1_L.jpg", "product_url": "http://beautybay.com/accessories/nailsinc/exerciseslogancosmeticbag/"},
{"colour": "", "id": 79, "brand": "My Kit Co.", "product_description": "A latex free blending sponge.\nIn a tear-drop shape, My Flawless Blender Droplet applies and blends makeup seamlessly. With a super soft touch, cream and powder products are applied evenly with a subtle, natural finish.", "price": "HK $59.50", "product_name": "My Flawless Blender Droplet", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0005F_1_L.jpg/2f1262d9983951babda2cb47c6c01d31/MYKI0005F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myflawlessblenderdroplet/"},
{"colour": "", "id": 80, "brand": "Velour Lashes", "product_description": "Velour Lashes Oops! Naughty Me are seductive looking false lashes handcrafted with luxurious Mink Hair.\nExquisitely handcrafted with ethically sourced and sterilised Mink Hair from free range zoos, Oops! Naughty Me have been designed with a pattern that is short at the ends and longest at the centre with sensuous style and extra length.\nReusable for up to 25 times, Oops! Naughty Me are suitable for all eye shapes and are easy to apply. Flirt, seduce, and tease with these criss-cross falsies; with multiple layers of overlap, these lashes create a thick feathery look which is sure to grab the attention of any admirer.", "price": "HK $244.40", "product_name": "Oops! Naughty Me", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0007F_1_L.jpg/6f911b7d9bbe413c8613434a7ae2baa9/VELA0007F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/oopsnaughtyme/"},
{"colour": "Natural 10g – HK $43.00", "id": 81, "brand": "Palladio", "product_description": "Doubled sided blotting sheets, perfect for the removal of oil on the go.\nRice Paper Oil Absorbing Blotting Tissue is created using natural rice for optimum oil retention performance. With a matte side to blot away shine and a powdered side for touch ups throughout the day, the small convenient packaging is perfectly sized to slot in your purse for an oil defying travel companion you never have to be without.", "price": "HK $43.00", "product_name": "Rice Paper Oil Absorbing Blotting Tissues - Natural 10g", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PALL0056F_1_L.jpg/f024d02dfa4c7d66878177961893c688/PALL0056F_1_L.jpg", "product_url": "http://beautybay.com/accessories/palladio/ricepaperoilabsorbingblottingtissues/natural"},
{"colour": "", "id": 82, "brand": "Z Palette", "product_description": "Z Palette Medium Magnetic Palette Black is an eco-friendly palette for storing all your favourite eye shadows, blushers and pressed powders.\nWhether you are brand new to makeup or a self-proclaimed Beauty Junkie, Medium Magnetic Palette Black makes sure that everyone benefits from a little less clutter in their life.\nMedium Magnetic Palette Black is extra deep, not only allowing you to store all your favourite shades but also allows you to store your make-up brushes in there as well making it perfect for those on-the-go touch ups. The universal magnetic base allows you to fit an entire face worth of makeup into the palette and is small enough to pop into your handbag, gym bag or in your desk or locker.\nMagnetic stickers come with Medium Magnetic Palette Black just in case your pans don't stick to the magnetic base and if you have trouble finding your favourite powder, you can write what brand and colour the powder is on the bottom of the pan or sticker so you know exactly where to find your go-to shade.", "price": "HK $172.70", "product_name": "Medium Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0008F_1_L.jpg/4b24ce36798226ab1440448cd9eb8dfc/ZPAL0008F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/mediummagneticpalette/black"},
{"colour": "", "id": 83, "brand": "Molly Cosmetics", "product_description": "A silicone makeup applicator.\nWith non-absorbent properties, Original SiliSponge applies and blends liquid and cream products without any waste. Rounded for precision, reach in and around the corners of the face with this hygienic, easy-clean and completely clear sponge.", "price": "HK $70.80", "product_name": "Original SiliSponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOCO0001F_1_L.jpg/38677bf48218db43ac3b47178f5584f5/MOCO0001F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mollycosmetics/originalsilisponge/"},
{"colour": "037 – HK $63.30,\n038 – HK $63.30,\n039 – HK $63.30", "id": 84, "brand": "Paul & Joe", "product_description": "Spring print lipstick case.\nSoft and lightweight, Limited Edition Lipstick Case CS is made from paper for a unique feel and look. Designed for any Paul & Joe Lipstick Refill, your case can be reused over and over again for protecting and carrying your favourite lipstick stylishly.", "price": "HK $63.30", "product_name": "Limited Edition Lipstick Case CS", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC-paulandjoelimitedlipstickcase_1_gl.jpg/2ec7f39be74be74056f62725c512bcbe/paulandjoelimitedlipstickcase_1_gl.jpg", "product_url": "http://beautybay.com/accessories/pauljoe/limitededitionlipstickcasecs/"},
{"colour": "", "id": 85, "brand": "Tweezerman", "product_description": "Tweezerman Classic Eyelash Curler is a best-selling eyelash curler designed to create an enduring curl.\nExperience the perfect merging of form and function, Classic Eyelash Curler creates the most expressive eyes and is one of the finest metal eyelash curlers available. Featuring extra sturdy construction and a smooth opening and closing action, Classic Eyelash Curler has a round, thick Silicone lash pad to form an intense curl without creasing or damaging lashes.\nClassic Eyelash Curler leaves lashes looking dramatically curled for a flirtatious flutter.", "price": "HK $161.50", "product_name": "Classic Eyelash Curler", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0010U_1_L.jpg/64a9d66fdc9b7f7c9c807034db9c3ccb/TWEE0010U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/classiceyelashcurler/"},
{"colour": "", "id": 86, "brand": "This Works", "product_description": "This Works Deep Sleep Pillow Talk contains all the essentials needed to promote a deep and peaceful slumber.\nCreate a peaceful haven before bedtime with this calming double act. Combining two precious products formulated with Lavender and Chamomile Essential Oils, Pillow Talk is specially designed to help you sleep.\nThe best-selling Deep Sleep Pillow Spray is enriched with a peaceful blend of Lavender, Vetivert and Chamomile Essential Oils to promote relaxation, whilst the newly developed Deep Sleep Stress Less Rollerball is enriched with Eucalyptus and Lavender Oils to help you breathe easily and calm your senses.\nSure to become an essential step in your bedtime ritual, Deep Sleep Pillow Talk is the ideal introduction to the This Works Deep Sleep range.", "price": "HK $283.20", "product_name": "Deep Sleep Pillow Talk", "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0075F_2_L.jpg/0ad1dff2472eb8cb63f4e3ebeb34c439/THWO0075F_2_L.jpg", "product_url": "http://beautybay.com/bathandbody/thisworks/deepsleeppillowtalk/"},
{"colour": "", "id": 87, "brand": "My Kit Co.", "product_description": "A pack of 50 small cotton buds.\nThe ultimate corrector tool, My Small 'On Point' Buds remove all traces of smudged makeup. With a fine tip, neatly wipe away stray flicks and smudged lipstick to create a neat and tidy edge with ultimate precision.", "price": "HK $29.80", "product_name": "My Small 'On Point' Buds", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0002F_1_L.jpg/71439657d1ec942576a24074fe4d45b9/MYKI0002F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mysmallonpointbuds/"},
{"colour": "", "id": 88, "brand": "beautyblender", "product_description": "Beautyblender Nude Sponge is a skin coloured high-definition cosmetic sponge applicator for a high definition finish.\nWith a cutting edge neutral hue, Nude Sponge's edgeless shape delivers fast, fool proof results and effectively eliminates visible lines and streaks. The non-Latex sponge has an open cell structure which when wet with water fills the air opening to prevent the sponge from absorbing the products you're wearing meaning after each use you won't need to use as much makeup.\nPerfect for blending foundation and concealers, Nude Sponge is soft-to-the-touch with a unique suede texture and delivers full coverage to the face.\nFrom creams and liquids to powders and minerals, Nude Sponge works to cover blemishes and blends makeup without creating changes in the texture or tone of your skin leaving a perfect finish. Expertly crafted, the pointed tip of Nude Sponge is designed for the hard-to-reach areas of the face such as under the eyes and the nose and mouth whilst the rounded base is perfect for larger areas such as the cheeks, forehead and chin.\nEnsuring a streak-free application with minimal makeup waste everybody will want to know the secret to your flawless airbrushed look.\nGo nude and don't look back with the stylish Nude Sponge from the icons at beautyblender.", "price": "HK $153.00", "product_name": "Nude Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0031F_1_L.jpg/8751974e44ae0ee15e60961b62def5f9/BEBL0031F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/nudesponge/"},
{"colour": "", "id": 89, "brand": "Velour Lashes", "product_description": "Innovatively placed lashes form a unique criss-cross pattern to give full, thick looking lashes.\nGradually increasing in length from inner to outer corner, this set of lashes give a gorgeous flared out cat eye effect. Bonded to a durable cotton band the 100% handmade silk Flare-y Godmom lashes can be used up to 20 times whilst still maintaining their luxurious fluffiness.", "price": "HK $233.80", "product_name": "Silk Flare-y Godmom", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0033F_1_L.jpg/fc6528a0c167daa448303ad4bd3c1443/VELA0033F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/silkflareygodmom/"},
{"colour": "", "id": 90, "brand": "iWhite", "product_description": "iWhite Instant Whitening Toothpaste is an advanced whitening toothpaste which restores whiteness and strengthens the teeth.\nFeaturing Triple Action Whitening Technology, Instant Whitening Toothpaste restores the natural whiteness of your teeth for a healthier, brighter smile. Working to care for your teeth every day, this clinically proven toothpaste inhibits tooth discolouration whilst combatting plaque and tartar.\nFormulated with Fluoride, Instant Whitening Toothpaste restores the enamel of your teeth and actively removes stains and strengthens the teeth. Instant Whitening Toothpaste offers instant, everyday whitening results and leaves the teeth up to 8 shades whiter.", "price": "HK $95.10", "product_name": "Instant Whitening Toothpaste 75ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/IWHT0002U_1_L.jpg/196e09b210493fe4cd92a1abca6996ab/IWHT0002U_1_L.jpg", "product_url": "http://beautybay.com/accessories/iwhite/instantwhiteningtoothpaste/"},
{"colour": "", "id": 91, "brand": "My Kit Co.", "product_description": "A clear makeup bag.\nMy PVC Bag is a zip fastening makeup organiser. Made from durable PVC with clear sides, store and carry skincare, makeup and accessories for compact convenience.", "price": "HK $68.00", "product_name": "My PVC Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0019F_1_L.jpg/decce73090f531597efbfbb821017dc6/MYKI0019F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mypvcbag/"},
{"colour": "", "id": 92, "brand": "Morphe", "product_description": "A practical case for storing your favourite makeup brushes safely.\nThe HC18 18 Slot Case is a must have for anyone who's serious about their makeup brushes. With allocated spaces for brushes of various sizes, it's designed with a rigid shape to keep brushes safe during transit, whilst the surface is entirely wipe clean, too.", "price": "HK $103.10", "product_name": "HC18 18 Slot Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0507F_1_L.jpg/be07b4e6da736e31e6b96290d65b4bdd/MOBR0507F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/hc1818slotcase/"},
{"colour": "", "id": 93, "brand": "Lilly Lashes", "product_description": "Add a subtle flourish of depth and volume with this set of false lashes.\nCreated to appear effortlessly natural, the Luxe Luxury Mink Lashes are ideal for day to day wear. The unique lashes boast the finest mink fibres in a range of lengths in an effort to mimic the appearance of natural hair. Attached to a black band, the super-lightweight falsies offer added depth and fullness.", "price": "HK $212.60", "product_name": "Luxe Luxury Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0012F_1_L.jpg/aa2b900d8288689f0667a07ad9702224/LILL0012F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/luxeluxuryminklashes/"},
{"colour": "", "id": 94, "brand": "Morphe", "product_description": "A stylish and convenient way to store your favourite makeup brushes.\nEnsure your beloved makeup brushes are well looked after with the HC22 22 Slot Case from Morphe Brushes. This rigid folder design features 22 slots of various sizes to snugly hold your makeup brushes. Entirely wipe clean, it's a hygienic way to keep your brushes safely stowed both at home and during transit.", "price": "HK $149.50", "product_name": "HC22 22 Slot Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0508F_1_L.jpg/78d69bf1894eb61b76ab97ddf343c54d/MOBR0508F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/hc2222slotcase/"},
{"colour": "", "id": 95, "brand": "Tweezerman", "product_description": "Tweezerman No Mess Mascara Guard enables application of mascara to the lashes without smudging the eye makeup.\nConveniently sized, No Mess Mascara Guard guarantees effortless yet effective application with absolutely no mess. Used by professional makeup artists to ensure a flawless finish, this revolutionary applicator promises to make mascara stay on the lashes and completely off the face.\nEasy to clean and aesthetically pleasing, No Mess Mascara Guard helps to add texture and volume to the lashes beautifully without disrupting freshly applied concealer, eyeshadow and foundation. This miraculous beauty tool can be used for both the upper and lower lash lines for extreme precision.\nBe on your guard with No Mess Mascara Guard.", "price": "HK $121.20", "product_name": "No Mess Mascara Guard", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0207U_1_L.jpg/de902a1b3f2d5e21bffe989358d291e4/TWEE0207U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/nomessmascaraguard/"},
{"colour": "", "id": 96, "brand": "My Kit Co.", "product_description": "A small makeup bag.\nMade with durable PVC, My Small PVC Bag is a clear, zip fastened bag. Easily stackable, fill one or more bags with smaller cosmetics for optimum organisation and a travel friendly tip.", "price": "HK $55.30", "product_name": "My Small PVC Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0015F_1_L.jpg/aa38105531d69f5d3ba2777672f7d929/MYKI0015F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mysmallpvcbag/"},
{"colour": "", "id": 97, "brand": "Paul & Joe", "product_description": "Paul & Joe Pressed Powder Puff is specially designed for the application of Pressed Face Powder Refill (sold separately).\nDecadently designed, Pressed Powder Puff luxuriously blends and buffs the powder onto the complexion, ensuring that a flawless finish is effortlessly achieved. Divinely gliding across the skin, this elegant applicator remains gentle to the skin whilst providing a delightful experience and an even, smooth effect.\nApply powder the indulgent way with Pressed Powder Puff.", "price": "HK $36.10", "product_name": "Pressed Powder Puff", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC1513F_1_L.jpg/b6e8c19c705589e6584b03be5a8cbd56/PAJC1513F_1_L.jpg", "product_url": "http://beautybay.com/accessories/pauljoe/pressedpowderpuff/"},
{"colour": "", "id": 98, "brand": "Unicorn Lashes ", "product_description": "If volume and length is the way to your heart, then look no further than these flawless falsies.\nDesigned to add the flutter to finish your look, the 3D Mink Lashes Starstruck boast undeniable volume and enviable length. Crafted from the finest mink hair in a unique criss-cross design attached to a durable black band, these false lashes offer both volume and length to any eye look.", "price": "HK $244.30", "product_name": "3D Mink Lashes Starstruck", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0008F_1_L.jpg/e4693dc8f199a225c5175af9073cae23/UNLA0008F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dminklashesstarstruck/"},
{"colour": "", "id": 99, "brand": "My Kit Co.", "product_description": "A synthetic pair of tapered false eyelashes.\nInspired by Tokyo beauty, My Shibuya X Lashes add both volume and definition. Tapering from a thick, dark root to a fine, wispy tip, create a delicately bold finish.", "price": "HK $191.30", "product_name": "My Shibuya X Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0072F_1_L.jpg/7308ad773e1d131348c1c347285aa98a/MYKI0072F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myshibuyaxlashes/"},
{"colour": "", "id": 100, "brand": "beautyblender", "product_description": "A powder pink addition to beautyblender's collection designed to commemorate the brand's fifteenth birthday.\nDesigned to mark the fifteenth anniversary of one of the beauty industry's most ground-breaking tools, the Bubble Sponge is a must-have for 2017. The innovative prosecco pink, suede-like sponge works tirelessly to seamlessly blend any number of your favourite complexion perfectors for a flawless skin mimicking finish.", "price": "HK $153.00", "product_name": "Bubble Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0042F_1_L.jpg/a520f12f779ef4ac74b9be3d0059093f/BEBL0042F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/bubblesponge/"},
{"colour": "", "id": 101, "brand": "Lilly Lashes", "product_description": "A pair of volumising false eyelashes.\nDesigned by celebrity makeup artist Samuel Rauda, MakeupbySamuel 3D Mink Lashes are suited to all eye shapes. Enhancing and defining, the reusable strip lash can be worn both day and night for seamless volume and feathered length.", "price": "HK $318.80", "product_name": "MakeupbySamuel 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0045F_1_L.jpg/e97c71acb1a3f811a0e24c807f8cc414/LILL0045F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/makeupbysamuel3dminklashes/"},
{"colour": "", "id": 102, "brand": "Morphe", "product_description": "Morphe Brushes ZMB5 Tidy Set Bag is a compact cosmetics case for easy makeup storage and transportation.\nThe perfect travel companion for your beauty necessities, ZMB5 Tidy Set Bag has one large zipped compartment to keep all your makeup and tools neat and tidy. With a transparent, wipe clean design with secure zip fastening, ZMB5 Tidy Set Bag is sure to become a makeup artist's best friend.\n", "price": "HK $103.10", "product_name": "ZMB5 Tidy Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0109F_1_L.jpg/3d3fc3e4dbb3ed5ffa2322a269b5556e/MOBR0109F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zmb5tidysetbag/"},
{"colour": "", "id": 103, "brand": "Alpha-H", "product_description": "Alpha-H Dual Purpose Facial Cleansing Cloth Trio is the perfect cleansing companion to ensure a deep cleanse.\n100% Lint free and super soft, Dual Purpose Facial Cleansing Cloth Trio features three machine washable face cloths which effortlessly remove all traces of makeup, dirt, oil and impurities. Featuring a smooth side for gentle makeup removal and a textured side for a deeper cleanse, Dual Purpose Facial Cleansing Cloth Trio is definitely a Beauty Bay facial staple.\nWhen used with your favourite Alpha-H Cleanser, Dual Purpose Facial Cleansing Cloth Trio kick starts your cleansing regime and helps to prevent clogged pores, leaving the skin feeling fresh and healthy.", "price": "HK $122.50", "product_name": "Dual Purpose Facial Cleansing Cloth Trio ", "image_url": "http://a0.bb-cdn.com/assets/productimages/large/alph0080f_1_l.jpg", "product_url": "http://beautybay.com/accessories/alphah/dualpurposefacialcleansingclothtrio/"},
{"colour": "", "id": 104, "brand": "Lilly Lashes", "product_description": "A sultry set of false lashes perfect for enhancing a smoky eye.\nDesigned with a subtly graduating length from the inner to outer corner, the Delara 3D Faux Mink Band-Less Lashes are perfect for adding an amped up finish to your eye look. Attached to an invisible band, the lightweight fibres create a subtly sultry finish.", "price": "HK $265.70", "product_name": "Delara 3D Faux Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0002F_1_L.jpg/c04fe4d32febf23960769b8f29a8465b/LILL0002F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/delara3dfauxminkbandlesslashes/"},
{"colour": "", "id": 105, "brand": "Ardell", "product_description": "Ardell Fashion Lashes 103 Demi are full lashes with a blunt cut for gorgeous volume and thickness.\nReusable and easy-to-apply, Fashion Lashes 103 Demi can be used for up to three weeks and will complement any eye makeup. Made from 100% sterilised human hair, Fashion Lashes 103 Demi are perfect for all occasions and are a Beauty Bay best-seller.", "price": "HK $44.70", "product_name": "Fashion Lashes 103 Demi", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE-ardellfashionlashes_1_gl.jpg/e565d3f8e5382fbd49db2728303334dc/ardellfashionlashes_1_gl.jpg", "product_url": "http://beautybay.com/accessories/ardell/fashionlashes103demi/103_demi"},
{"colour": "", "id": 106, "brand": "Ardell", "product_description": "Lashtite Clear is an incredibly strong invisible adhesive for use with individual lashes. Used once, the lashes can stay attached for a few weeks to allow you to wear lash enhancements without the worry of lifting or loosening.", "price": "HK $44.70", "product_name": "Lashtite", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE8037F_1_L.jpg/ccead89c3deee7688adc4412deb21c19/ARDE8037F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/lashtite/clear"},
{"colour": "Flamingo Pink – HK $131.30,\nGreen Tea – HK $131.30,\nLovely Lavender – HK $131.30,\nStainless Steel – HK $131.30", "id": 107, "brand": "Tweezerman", "product_description": "Tweezerman Mini Slant Tweezer is the perfect on-the-go pair of tweezers designed for expert brow shaping.\nRenowned for their precision and quality, Tweezerman's best-selling Mini Slant Tweezers are available in an array of colours. Perfect for transforming unruly brows into sleek, sexy and shapely arches, Mini Slant Tweezer is a super-cute smaller version of the award-winning, renowned Slant Tweezer.\nMini Slant Tweezer features slanted tips which are hand filed and perfectly aligned to grab the hair every time for ease of use and perfectly groomed brows. We've all been annoyed by using tweezers that don't properly grip; with superior calibrated tension and perfectly aligned, hand-filed precision tips, Tweezerman tweezers close evenly and firmly, creating the cleanest, most advanced pulling power. Perfect for makeup and travel bags, these Mini Slant Tweezer are the tweezers you'll own for a lifetime.", "price": "HK $131.30", "product_name": "Mini Slant Tweezer", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE-tweezermanminislanttweezer_1_GL.jpg/bb3cef7ea6e3952e90bf08bae2d4979c/tweezermanminislanttweezer_1_GL.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/minislanttweezer/"},
{"colour": "", "id": 108, "brand": "Anna Sui", "product_description": "Anna Sui Beauty Mirror is a gorgeous vanity mirror.\nDesigned for ultimate convenience, this foldable Beauty Mirror can be placed on any dressing table. Simply fold back and use to preen, groom and beautify yourself. Expertly crafted with a signature butterfly motif, Beauty Mirror is a stylish mirror which reflects Anna SuiÉs kitsch collections and is a nod towards the fantasy world.", "price": "HK $162.20", "product_name": "Beauty Mirror", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANSU0145F_1_L.jpg/191f71f2234b05bf2f4495b4d79eba65/ANSU0145F_1_L.jpg", "product_url": "http://beautybay.com/accessories/annasui/beautymirror/"},
{"colour": "", "id": 109, "brand": "Morphe", "product_description": "A practical and stylish storage solution for professional makeup application.\nKeep all your brushes exactly where you need them during your makeup artistry, with Morphe Brushes A3 Medium Hip Brush Belt. Ideal for makeup artists, this brush belt has space for 17 makeup brushes, with an adjustable strap of up to 54\" diameter. The ideal solution to keeping your makeup brushes at hand.\nPlease note no brushes are included with the A3 Medium Hip Brush Belt.", "price": "HK $103.10", "product_name": "A3 Medium Hip Brush Belt", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0501F_1_L.jpg/f2d67edb7e964a67b4617f0b5a609f0c/MOBR0501F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/a3mediumhipbrushbelt/"},
{"colour": "Peacock – HK $146.40,\nTucan – HK $146.40", "id": 110, "brand": "Tweezerman", "product_description": "Mini patterned tweezers.\nPart of Tweezerman's Birds of a Feather range, Limited Edition Mini Slant Tweezer combines style and functionality.  Made for travel, the small, summer print tweezers have a sharp, tapered point for ultimate precision and accuracy.", "price": "HK $146.40", "product_name": "Limited Edition Mini Slant Tweezer", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE-tweezermanlimitededitionminislanttweezer_1_GL.jpg/fdad0eacd55cb98fec0dcab37088313c/tweezermanlimitededitionminislanttweezer_1_GL.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/limitededitionminislanttweezer/"},
{"colour": "", "id": 111, "brand": "beautyblender", "product_description": "Beautyblender Sponge is an innovative makeup tool which allows you to blend your makeup to perfection to achieve the ultimate flawless finish.\nA flawless look starts with the perfect canvas Í clean, beautiful and even skin. Invented by top Hollywood makeup artists Rea Ann Silva and Veronica Lorenz, beautyblender Sponge has a patent-pending elliptical shape which makes application fool proof by allowing you to access hard-to-reach areas with stunning ease.\nThe unique suede texture is sensual to the touch whilst the curves fit the contours of your face, leaving your makeup dazzling and undetectable. Latex free, non-allergenic and odour free, beautyblender Sponge is suitable for all skin types and is a BeautyBay best-seller.\nForget your fingers or sharp-edged triangular sponges, these application methods waste makeup and can leave visible streaks; beautyblender Sponge lets you achieve the ultimate flawless finish for your makeup, allowing you to blend to perfection, which is not always easy to do.", "price": "HK $153.00", "product_name": "Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0001F_1_L.jpg/a5944f0207f4b2435de1396ad160392c/BEBL0001F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/sponge/"},
{"colour": "", "id": 112, "brand": "Unicorn Lashes ", "product_description": "Ultra-fluttery and incredibly voluminous, these false lashes have it all.\nCombining enviable length and intense volume, the 3D Mink Lashes Raven are the ideal set to get you party-ready. Lovingly crafted with mink hair and a durable black band, this falsie set is a must-have for any lash-lover.", "price": "HK $244.30", "product_name": "3D Mink Lashes Raven", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0004F_1_L.jpg/94bb6cad8aac15f4ea2bb1240119bb68/UNLA0004F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dminklashesraven/"},
{"colour": "", "id": 113, "brand": "Z Palette", "product_description": "Z Palette Double Sided Magnetic Palette Black is an innovative new palette designed to contain products on both sides.\nPerfect for organising your makeup collection, Double Sided Magnetic Palette Black allows for full creative control. Enabling you to customise your very own cosmetic palette, this innovative double-sided tray is crafted using hard-wearing magnetic bases, making it effortless to add the shades and hues you wish. Featuring two windows that have incredible durability, Double Sided Palette Black offers a sumptuous answer to your storage problems.\nWith the ability to contain both square and circle pans, this enchanting palette is a certified beauty necessity for any cosmetic junkie. Have fun, get creative and keep your makeup safe with the revolutionary Double Sided Magnetic Palette Black.", "price": "HK $403.40", "product_name": "Double Sided Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0031F_1_L.jpg/8513f471c5d482f847178643b81869df/ZPAL0031F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/doublesidedmagneticpalette/black"},
{"colour": "", "id": 114, "brand": "BH Cosmetics", "product_description": "A two compartment, quilted cosmetics bag.\nDesigned specifically to hold your favourite BH Cosmetics lines, the Cosmetics Bag Black is ideal for home storage and travel. With spaces developed to hold your favourite brushes and smaller beauty tools, the second compartment comfortably stores palettes. Complete with a sturdy handle and stylish design, this is a must-have storage solution.", "price": "HK $133.90", "product_name": "Cosmetic Bag Black", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BHCO0148F_1_L.jpg/e93699704f1df1edfd60590ee2cd1cac/BHCO0148F_1_L.jpg", "product_url": "http://beautybay.com/accessories/bhcosmetics/cosmeticbagblack/"},
{"colour": "", "id": 115, "brand": "Lilly Lashes", "product_description": "Amp up your finished eye look with these voluminous lashes.\nDesigned by fashion guru Arika Sato, the Arika 3D Band-Less Lashes deliver the perfect amount of definition needed to achieve a glamorous finish. The super-fine mink fibres are carefully attached to a lightweight invisible band for barely there results so you can rock lashes with added oomph.", "price": "HK $318.80", "product_name": "Arika 3D Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0015F_1_L.jpg/b6d210118deac6a483609b3ad6c3c775/LILL0015F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/arika3dminkbandlesslashes/"},
{"colour": "", "id": 116, "brand": "Morphe", "product_description": "A simple storage solution for your makeup favourites.\nStash your favourite makeup products in this zip-topped makeup case. Made from clear, wipe-clean plastic, it's easy to spot your products and simple to keep clean, too. One large compartment zipped around the top allows you to fill it with all your essentials. Equally great for toting round your collection and at-home storage.\nMeasurements: 10''L x 5.5''W x 5''H\n_Please note, bag is supplied empty - makeup products are for illustrative purposes only and are not included. _", "price": "HK $190.70", "product_name": "ZMB4 Loader Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0512F_1_L.jpg/f5e60009402032a65221aedffd4b403f/MOBR0512F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zmb4loadersetbag/"},
{"colour": "", "id": 117, "brand": "Lilly Lashes", "product_description": "If natural glam is your go to style these lashes are definitely for you.\nMimicking a natural lash formation, the Goddess Luxury Mink Lashes accentuate all eye shapes creating a whimsically wispie finish. The unique criss-cross pattern works to blend seamlessly with your natural hairs for an effortlessly flawless finish.", "price": "HK $212.60", "product_name": "Goddess Luxury Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0010F_1_L.jpg/6c630570669036ef8f777c5f59972c7c/LILL0010F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/goddessluxuryminklashes/"},
{"colour": "Black – HK $186.00,\nLeopard – HK $186.00,\nHot Pink – HK $186.00,\nZebra – HK $186.00", "id": 118, "brand": "Z Palette", "product_description": "Z Palette Large Magnetic Palette is a customisable palette created to store your makeup simply and easily.\nWe are all guilty of having our makeup stashes in different drawers and leaving our palettes on messy bathroom counter tops, Z Palette's Large Magnetic Palette is our makeup organising saviour!\nPerfect for makeup artists and especially our makeup drawers, Large Magnetic Palette allows you to put all your eye shadows, blushers and pressed powders in one compact space. Created to fit any size, shape or brand the metals pans stick to the magnetic base allowing you to fit up to 27 pans in the palette. Large Magnetic Palette has a clear window so you can see all your compacts at a glance and also features a lid that completely folds back giving you easy access to your make-up.\nMagnetic stickers come with Large Magnetic Palette just in case your pans don't stick to the magnet base and if you have trouble finding your favourite powder,you can write what brand and colour the powder is on the bottom of the pan or sticker so you can keep track of your go-to shade. With everything in one place, Large Palette also allows you to be more creative by using shades you may not have had the chance to use before.\nLightweight, durable and eco-friendly, Large Magnetic Palette's sleek slim designs are available in a range of styles allowing your Palette to be just as unique as your makeup!\n_Tip: We recommend using Z Palette's Spatula to help de-pot your pans from your branded Palettes to any Z Palette. _", "price": "HK $186.00", "product_name": "Large Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL-zpalettelargepalette_1_gl.jpg/2a51bf218f32137fda64eb4f9fd51584/zpalettelargepalette_1_gl.jpg", "product_url": "http://beautybay.com/accessories/zpalette/largemagneticpalette/"},
{"colour": "", "id": 119, "brand": "Unicorn Lashes ", "product_description": "False lashes for extreme volume and length.\nA Unicorn Lashes best seller, Mink Crystal Lashes Raven combine heavy, jet black lashes with a seamless clear band. With crossed, feathery edges, create dramatic definition with a soft and fluttery finish.", "price": "HK $249.80", "product_name": "Mink Crystal Lashes Raven", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0025F_1_L.jpg/68198a98601556cc67fed730aea8b6f3/UNLA0025F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minkcrystallashesraven/"},
{"colour": "", "id": 120, "brand": "Anna Sui", "product_description": "Anna Sui Oil Control Paper and Case is a luxurious blotting paper in an exclusive case.\nDesigned to keep shine at bay, these purple blotting papers allow you to discreetly dab away excess oil and shine for a truly flawless complexion. Packaged in a stylish plastic case with Anna Sui motif, Oil Control Paper and Case is a pretty and compact way to keep the complexion looking chic, matte and radiant.\nPerfect for use before or after makeup application, this must-have beauty tool lifts dirt, oil and impurities from the skin to keep your complexion looking marvellously matte in even the most humid weather and helps to beat the heat and maintain a smooth, shine-free complexion all day long.", "price": "HK $122.00", "product_name": "Oil Control Paper and Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANSU0130F_1_L.jpg/94e505b4c915aec846c0e722484446d8/ANSU0130F_1_L.jpg", "product_url": "http://beautybay.com/accessories/annasui/oilcontrolpaperandcase/"},
{"colour": "Clear 7g – HK $72.00,\nDark 7g – HK $72.00", "id": 121, "brand": "Ardell", "product_description": "Ardell Duo Lash Adhesive is the world's best-selling waterproof lash adhesive.\nBoasting a Latex formulation which is safe to use with Ardell Lashes and other body decoration/accessories, Duo Lash Adhesive is available in clear and dark tones and won’t irritate the skin. Ardell Duo Lash Adhesive offers enhanced staying power and can easily be removed without damaging the natural lashes.", "price": "HK $72.00", "product_name": "Duo Lash Adhesive", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE-ardellduolashadhesive_1_gl.jpg/c413bf8240512271f4062a6475e24dfc/ardellduolashadhesive_1_gl.jpg", "product_url": "http://beautybay.com/accessories/ardell/duolashadhesive/"},
{"colour": "", "id": 122, "brand": "Tweezerman", "product_description": "Light up, slanted tweezers.\nCreating a spotlight, Expertweeze Lighted Slant Tweezer illuminates the face for precision tweezing. With slanted, hand-filed tips and a bright LED light, tidy brows with ultimate accuracy and maximum convenience.", "price": "HK $302.90", "product_name": "Expertweeze Lighted Slant Tweezer", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0251U_1_L.jpg/db1be8fd45162663ee4f9c62208434f2/TWEE0251U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/expertweezelightedslanttweezer/"},
{"colour": "", "id": 123, "brand": "Morphe", "product_description": "A stylish and practical storage solution for your favourite makeup brushes.\nEnsure makeup brushes are safely and neatly stowed with the ZP1 13 Slot Leatherine Case from Morphe Brushes. Made from wipe clean leatherine, it features 13 slots carefully hold your favourite brushes, plus a protective flap to keep bristles safe in transit.", "price": "HK $64.50", "product_name": "ZP1 13 Slot Leatherine Zip Up Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0510F_1_L.jpg/c7f20ac265545615ae0744ea77ff8f08/MOBR0510F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zp113slotleatherinezipupcase/"},
{"colour": "", "id": 124, "brand": "Velour Lashes", "product_description": "A confidence boosting lash with a unique cluster design.\nCreated to deliver a volumised, long lash look, Flash It falsies boast an impressive full finish. Adhered to an invisible band, the lightweight 100% mink fibres achieve a fluttery and discreet, yet dramatic appearance you can't help but love.", "price": "HK $244.40", "product_name": "Flash It", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0044F_1_L.jpg/a11883dac44ba20a0071a456871d0354/VELA0044F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/flashit/"},
{"colour": "", "id": 125, "brand": "Unicorn Lashes ", "product_description": "Volumising false eyelashes.\nThick and jet black, Mink Crystal Lashes Bellatrix create a high impact look. Feathering and crossing, create natural looking volume with maximum definition and feathering length.", "price": "HK $249.80", "product_name": "Mink Crystal Lashes Bellatrix", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0027F_1_L.jpg/119c3c7cfc831c2b2df8a07889521513/UNLA0027F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minkcrystallashesbellatrix/"},
{"colour": "", "id": 126, "brand": "Violet Voss", "product_description": "Violet Voss Eye DGAF Premium 3D Faux Mink Lashes enchantingly frame the eyes, delivering drama and style to the lash line effortlessly.\nBeautifully handcrafted with Faux Mink, Eye DGAF Premium 3D Faux Mink Lashes are easy to apply and can be reused up to 10 times if cared for properly. Offering a lightweight, natural look, Eye DGAF Premium 3D Faux Mink Lashes, make your eyes the centre of attention.\nFlutter those lashes with Eye DGAF Premium 3D Faux Mink Lashes.", "price": "HK $100.40", "product_name": "Eye DGAF Premium 3D Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0040F_1_L.jpg/3e91e551508d146d9c3d6092ee05466f/VIVO0040F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/eyedgafpremium3dfauxminklashes/"},
{"colour": "", "id": 127, "brand": "Lilly Lashes", "product_description": "With a perfectly lifted curl these lashes are effortlessly flirtatious.\nUsing a variety of lengths, densities and cluster sizes, the Monaco 3D Mink Lashes are a versatile must-have for any lash-lover's collection. The unique formation of the silk-like mink hairs focusses its length and volume towards the centre of the eye in order to create a wide-eyed, flawless finish.", "price": "HK $318.80", "product_name": "Monaco 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0026F_1_L.jpg/8425774e8c71f2dd21d23ef7a8618152/LILL0026F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/monaco3dminklashes/"},
{"colour": "", "id": 128, "brand": "Tweezerman", "product_description": "A professionally designed tweezer created for precision brow grooming.\nCreated to shape and perfect your brows, Rose Gold Slant Tweezer are definitely an essential for your makeup bag. Adorned in an on-trend metallic rose gold finish the strong, the perfectly balanced tweezers harbour a unique slanted tip for efficient brow shaping, allowing you to keep your arches looking professionally cared for all year round.", "price": "HK $227.10", "product_name": "Rose Gold Slant Tweezer", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0233U_1_L.jpg/272da0b2a8ba66b15e98c2034fd9bc81/TWEE0233U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/rosegoldslanttweezer/"},
{"colour": "", "id": 129, "brand": "Z Palette", "product_description": "A medium sized customisable palette.\nExclusive to Beauty Bay, Exclusive Glitter Hi-Gloss Medium Magnetic Palette has an oil-and-water brushstroke print. Fusing white, pink, taupe and gold, the colourful magnetic palette holds individual pans of your favourite products. Use the magnetic stickers provided if your own pans don't stick for the ultimate customisation.", "price": "HK $167.40", "product_name": "Exclusive Glitter Hi-Gloss Medium Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0039F_1_L.jpg/ef6ffbc71ee3196d440ac129cc149d54/ZPAL0039F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/exclusiveglitterhiglossmediummagneticpalette/"},
{"colour": "", "id": 130, "brand": "Lilly Lashes", "product_description": "A false lash set that promises to deliver a fluttery finish.\nDesigned with an array of clusters varying in density and length, the Lyla 3D Mink Band-Less Lashes are sure to create a one off look. Each of the weightless mink fibres has been attached to an invisible band so you can create a bold finish without being over the top.", "price": "HK $318.80", "product_name": "Lyla 3D Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0018F_1_L.jpg/0cf28b85b0ba05dd6c36020b4afc35b5/LILL0018F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/lyla3dminkbandlesslashes/"},
{"colour": "", "id": 131, "brand": "Unicorn Lashes ", "product_description": "A set of lightweight falsies that aim to focus lengthened drama on the outer corner for a sultry finish.\nDesigned with high quality mink hair attached in clusters varying in both density and length, the Mink Lashes Rainbow Wings are perfect for beginners and lash-addicts alike. Predominantly focusing the length towards the outer corner of the durable band, these lashes offer a super-subtle yet incredibly beautiful finish to your favourite looks.", "price": "HK $201.80", "product_name": "Mink Lashes Rainbow Wings", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0014F_1_L.jpg/d1121a7eb6f7b96437da3bc88cd06c67/UNLA0014F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minklashesrainbowwings/"},
{"colour": "", "id": 132, "brand": "Bronzie", "product_description": "A revolutionary tanning mitt designed to tan your whole body, including your back, with ease.\nFinally, the solution to our tanning troubles has arrived. Bronzie's Got Your Back Tanning Mitt is a 3-in-1 self-tan applicator mitt, which features two tanning mitts attached to a middle section, all made with luxurious, thick velour. Use the two mitt ends simultaneously to halve your tanning time - lined with a protective film, they'll keep palms dry and tan free, whilst the plush fabric will buff tan into skin for a super natural finish. The middle section allows you to blend your fake tan all over your back area effortlessly - no more stretching, straining or twisting to achieve an all over glow!\nWith elasticated panels, the Got Your Back Tanning Mitt stretches to reach every part of your body. Washable and reusable, too, this is set to be your new must have tanning accessory.", "price": "HK $143.00", "product_name": "Got Your Back Tanning Mitt", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BRON0001U_1_L.jpg/bc1882aa7bc7ec8fe2a624a6e1c8f35b/BRON0001U_1_L.jpg", "product_url": "http://beautybay.com/accessories/bronzie/gotyourbacktanningmitt/"},
{"colour": "", "id": 133, "brand": "Z Palette", "product_description": "A large sized customisable palette.\nGlitter Hi-Gloss Large Magnetic Palette is an empty palette designed to organise and carry your favourite products. Inside the oil-and-water brushstroke casing, magnetically attach individual pans of eyeshadow, lipstick and powder and take it with you as you travel.", "price": "HK $190.80", "product_name": "Glitter Hi-Gloss Large Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0040F_1_L.jpg/19446a2a765e18ee4a40f9d422e6045c/ZPAL0040F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/glitterhiglosslargemagneticpalette/"},
{"colour": "", "id": 134, "brand": "Sigma Beauty", "product_description": "Drying eye shadow brushes and keeping their perfected shape used to be difficult until now.\nInnovatively designed to remove all moisture from your freshly washed brushes as well as keeping their desired shape, Sigma Dry'N Shape Tower Eyes hold up to forty eight shadow brushes at once.  Clipped upside down into the perfectly sized spaces and shape holding band, the tower is truly a utensil you'll never want to be without.", "price": "HK $398.60", "product_name": "Dry'N Shape Tower Eyes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0102F_1_L.jpg/d2ea70e55c95d28e6eaf8f341ea4ecf8/SIGM0102F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/drynshapetowereyes/"},
{"colour": "", "id": 135, "brand": "Unicorn Lashes ", "product_description": "A pair of flared eyelashes.\nWith a clear band, attach Mink Crystal Lashes Estrellita to the lash line for seamless volume. In small, compact sections, the thick base and feathered ends create subtle length and volume with maximum definition.", "price": "HK $249.80", "product_name": "Mink Crystal Lashes Estrellita", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0029F_1_L.jpg/684a47e5033126eb4531e09cd21b1297/UNLA0029F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minkcrystallashesestrellita/"},
{"colour": "", "id": 136, "brand": "Festival Face", "product_description": "A pack of four henna sheets.\nHand drawn, Sundara Metallic Tattoo Collection is an exclusive collaboration created by Darcy Vasudev of Henna Lounge. With a two-toned metallic finish, simply apply to the hands, feet and body for a beautifully delicate and sophisticated look.", "price": "HK $212.60", "product_name": "Sundara Metallic Tattoo Collection", "image_url": "http://images.contentful.com/eoaaqxyywn6o/FEFA0026F_2_L.jpg/98edeefede09d213c10921abb9a793a8/FEFA0026F_2_L.jpg", "product_url": "http://beautybay.com/accessories/festivalface/sundarametallictattoocollection/"},
{"colour": "", "id": 137, "brand": "Unicorn Lashes ", "product_description": "Add some drama to even the simplest of eye looks with these voluminously fluffy lashes.\nCarefully crafted with fine fibres of synthetic silk, the 3D Silk Lashes Dragoness offer comfortable, lightweight wear. The ultra-long, softly curled lashes are attached to a durable black band, so you can rock an eye-catching finish time and time again.", "price": "HK $212.50", "product_name": "3D Silk Lashes Dragoness", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0015F_1_L.jpg/d79d15531dc65d67c407e60e4c031141/UNLA0015F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dsilklashesdragoness/"},
{"colour": "", "id": 138, "brand": "Nanshy", "product_description": "A 4 in 1 blending sponge.\nConcealing and covering, Nanshy's Marvel Blender creates a buildable, airbrushed base. With a fine tip, flat sides and rounded bottom, use the ergonomic sponge for complete control in all the hard to reach areas of the face.", "price": "HK $62.00", "product_name": "Marvel Blender", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NANS0036F_1_L.jpg/e9ec9dd8138e5183f172bbd511644f19/NANS0036F_1_L.jpg", "product_url": "http://beautybay.com/accessories/nanshy/marvelblender/"},
{"colour": "", "id": 139, "brand": "Z Palette", "product_description": "What could be better than a customisable palette with a built-in mirror?\nHolding up to sixteen of your favourite hues for the face and eyes, the Mirror Magnetic Palette is perfect for those on the go travelling beauties. Boasting a secure magnetic base to keep hold of your pans along with a pull out mirror, this perfect, travel-friendly companion is an essential for beautifying on the move.", "price": "HK $107.60", "product_name": "Mirror Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0037F_1_L.jpg/37b26000874bc6eb0a4f392c4ee802ed/ZPAL0037F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/mirrormagneticpalette/"},
{"colour": "", "id": 140, "brand": "Violet Voss", "product_description": "Wispy 4 Day Premium Lashes adds definition to the lash line without weighing-down the eyelids. These synthetic lashes create a fuller finish that remains perfect for up to four wears.", "price": "HK $100.40", "product_name": "Wispy 4 Days Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0047F_1_L.jpg/faaf0dce96354bc664122d3a82bb137e/VIVO0047F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/wispy4dayspremiumlashes/"},
{"colour": "", "id": 141, "brand": "Morphe", "product_description": "Morphe Brushes ZMB6 Organizer Set Bag is a dual layered cosmetics case with a wipe clean design.\nSleek, stylish and entirely practical, ZMB6 Organizer Set Bag is a makeup artist's saviour for organised storage and effortless transportation of your makeup collection. With two exterior zipped pockets and an adjustable shoulder strap, ZMB6 Organizer Set Bag can also be used at home to keep your makeup neat and tidy.\n", "price": "HK $186.00", "product_name": "ZMB6 Organizer Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0110F_1_L.jpg/f3895ed07de5359ed4ec9fdb1006a132/MOBR0110F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zmb6organizersetbag/"},
{"colour": "", "id": 142, "brand": "Morphe", "product_description": "A sculpted beauty sponge crafted to seamlessly blend your favourite complexion perfecting mediums.\nThis innovative lightweight Flawless Beauty Sponge harbours a unique shape carefully cut to blend liquids and powders on all areas of the face including those hardest to reach. Used damp to ensure a skin-mimicking, airbrushed finish with little product absorption, this sponge will truly become the only tool you need to create a flawless base.", "price": "HK $77.30", "product_name": "Flawless Beauty Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0693F_1_L.jpg/2141ae1db10f021efee735f6d5d8803a/MOBR0693F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/flawlessbeautysponge/"},
{"colour": "", "id": 143, "brand": "Nanshy", "product_description": "A deep brush cleaner.\nCleaning and disinfecting, Brush & Sponge Cleaner removes dirt, bacteria, oils and product build up. Suitable for all brush and sponge types, use regularly to reduce breakouts and irritations whilst refreshing with a light, delicate scent.", "price": "HK $100.50", "product_name": "Brush & Sponge Cleaner", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NANS0037F_1_L.jpg/142cf99b168f75e7c59410cae88137a6/NANS0037F_1_L.jpg", "product_url": "http://beautybay.com/accessories/nanshy/brushspongecleaner/"},
{"colour": "", "id": 144, "brand": "My Kit Co.", "product_description": "A makeup blending sponge.\nWith a flat edge, My Flawless Blender Edge applies and blends makeup seamlessly. The super soft, latex free sponge blends cream and powder products perfectly in and around the contours of the face.", "price": "HK $59.50", "product_name": "My Flawless Blender Edge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0006F_1_L.jpg/215153abcd194bcb2f90de0420a42fe8/MYKI0006F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myflawlessblenderedge/"},
{"colour": "", "id": 145, "brand": "Natasha Denona", "product_description": "The Lash Guard works to protect your perfected eye look from mascara mishaps. Ergonomically designed the Lash Guard sits perfectly behind the lashes to allow for application of mascara without a worry.", "price": "HK $39.60", "product_name": "Lash Guard", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NADO0320F_1_L.jpg/da20a9b65ca88a0c6d9f30413fddc939/NADO0320F_1_L.jpg", "product_url": "http://beautybay.com/accessories/natashadenona/lashguard/"},
{"colour": "", "id": 146, "brand": "Anna Sui", "product_description": "Anna Sui Beauty Tray is a gorgeous storage box for your makeup essentials.\nBeautifully adorned with a butterfly motif and antique inspired detailing, Beauty Tray is the perfect way to organise your dressing table. Fill with makeup, accessories, brushes and beauty tools to keep your beauty area neat, tidy and organised.", "price": "HK $97.10", "product_name": "Beauty Tray", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANSU0144F_1_L.jpg/bf0791a816b50dc397b74a5e15560062/ANSU0144F_1_L.jpg", "product_url": "http://beautybay.com/accessories/annasui/beautytray/"},
{"colour": "", "id": 147, "brand": "Crimes Of Beauty", "product_description": "A large statement cosmetic bag.\nWith a detachable wrist strap, Slay The Night Large Wristlet Makeup Bag stores all your makeup essentials with ease. Designed with a faux leather finish, wipe clean and keep secure with a silver zip fastening.", "price": "HK $151.40", "product_name": "Slay The Night Large Wristlet Makeup Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/CROB0009F_1_L.jpg/f8ec6d78453591c51999d20f9ada035d/CROB0009F_1_L.jpg", "product_url": "http://beautybay.com/accessories/crimesofbeauty/slaythenightlargewristletmakeupbag/"},
{"colour": "", "id": 148, "brand": "Paul & Joe", "product_description": "Paul & Joe Cosmetic Pouch IV Horses is a fun and stylish storage solution for all your makeup essentials.\nCombining great looks and fantastic functionality, Cosmetic Pouch IV Horses is a soft vanity case which is your ideal makeup travel companion and has room for even more items and additional carrying convenience.\nThe top section has slim compartments for storing brushes and pencils, along with a hygienic storage flap. In the vanity section, there is a small pocket on the side where you can store your Paul & Joe cosmetics in an easy and practical way. The zip fastening ensures all your makeup is kept safe and secure during transit.\nThe frolicking horse print is selected from a Paul & Joe Fashion original print and allows you to indulge your sense of adventure and wonder. Just carrying this chic pouch is so exciting you'll instinctively want to show it off.", "price": "HK $207.80", "product_name": "Cosmetic Pouch IV Horses", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC1462F_1_L.jpg/893c7cfabc493d328ff739863ff20f6f/PAJC1462F_1_L.jpg", "product_url": "http://beautybay.com/accessories/pauljoe/cosmeticpouchivhorses/"},
{"colour": "", "id": 149, "brand": "Morphe", "product_description": "Large empty magnetic eyeshadow palette.\nKeep all of your colours at the tips of your fingers with Morphe's ACC4 Empty Magnetic Palette. Holding up to forty singular eyeshadows, it's the perfect mess free, accessible storage box.", "price": "HK $175.20", "product_name": "ACC4 Empty Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0098F_1_L.jpg/c04f24b72dbd85a6088f6737561170ec/MOBR0098F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/acc4emptymagneticpalette/"},
{"colour": "", "id": 150, "brand": "Violet Voss", "product_description": "Wispy false eyelashes.\nCut to different lengths, All The Wispy Ladies Premium 3D Faux Mink Lashes create a dramatic, intense effect. Lasting up to ten uses, the high quality synthetic fibres look full and thick for a classic, wispy finish.", "price": "HK $100.40", "product_name": "All The Wispy Ladies Premium 3D Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0083F_1_L.jpg/28966f2f4bf00f32b4aa2df433c54dbc/VIVO0083F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/allthewispyladiespremium3dfauxminklashes/"},
{"colour": "", "id": 151, "brand": "beautyblender", "product_description": "Beautyblender Blendercleanser Solid (28g) will keep your beautyblender sponges in perfect condition.\nHygiene is a must when it comes to keeping your skin fresh and healthy. Oil and dirt from your face will stay on your applicators if you donÉt take a moment to properly clean them.\nBlendercleanser Solid is the travel-friendly alternative to the best-selling liquid Blendercleanser; providing the same cleansing results and soothing Lavender fragrance for your beautyblender Sponge this solid cleanser is the perfect hygienic companion.\nBlendercleanser Solid is free of dyes and skin irritants and has a soothing soy-based formula which breaks down rapidly, making it earth-friendly and fun to use. Soy has the added benefit of being one of natureÉs finest moisturisers too, so by all means, clean up with class and do it often.\nBlendercleanser Solid leaves your makeup sponges hygienic and in perfect condition for long-wearing, continuous usage.", "price": "HK $133.90", "product_name": "Blendercleanser Solid 28g", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0008F_1_L.jpg/5eed64747e12ccc26ec0b59ed8408eff/BEBL0008F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/blendercleansersolid/"},
{"colour": "", "id": 152, "brand": "My Kit Co.", "product_description": "A makeup blending sponge.\nWith a pointed tip and rounded sides, My Flawless Blender Digit offers precise application and blending to all areas of the face. Designed to be worn on the finger, the sponge is easier to manoeuvre and more natural to use.", "price": "HK $59.50", "product_name": "My Flawless Blender Digit", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0007F_1_L.jpg/a8f5a005d04e842877a244eafe742ef0/MYKI0007F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myflawlessblenderdigit/"},
{"colour": "", "id": 153, "brand": "Paul & Joe", "product_description": "Paul & Joe Face Pressed Face Powder Case is a stylish storage case for the Pressed Face Powder Refill (sold separately).\nThe perfect addition for any elegant makeup bag, Pressed Face Powder Refill is the perfect storage solution for your Paul & Joe Pressed Face Powder. With a signature decadent champagne gold design with a delicate chrysanthemum motif, Pressed Face Powder Refill allows you to create your own unique compact and is a handbag essential.\n", "price": "HK $81.30", "product_name": "Pressed Face Powder Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC1512F_1_L.jpg/948f870fa0cbb826694b903a07bc9b54/PAJC1512F_1_L.jpg", "product_url": "http://beautybay.com/accessories/pauljoe/pressedfacepowdercase/"},
{"colour": "", "id": 154, "brand": "Unicorn Lashes ", "product_description": "A pair of feathered false lashes.\nCreating dramatic length and volume, Mink Crystal Lashes Nixie sit naturally and clearly on the lash line for a seamless appearance. With grouped separate sections, create extreme definition and long-lasting curl.", "price": "HK $249.80", "product_name": "Mink Crystal Lashes Nixie", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0024F_1_L.jpg/8d2f350688eee487cf7c62ab31f22545/UNLA0024F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minkcrystallashesnixie/"},
{"colour": "", "id": 155, "brand": "Morphe", "product_description": "A compact makeup bag for your smaller beauty essentials.\nKeep your makeup organised with this transparent cosmetics bag from Morphe Brushes. Conveniently designed so you can see all your products at a glance, and easy to wipe clean, the ZMB8 Taker Set Bag is loved by professionals and makeup lovers alike. Two side zipper pockets allow for easy storage of smaller items.\nMeasurements: 11''L x 3''W x 6''H\n_Please note, bag is supplied empty - makeup products are for illustrative purposes only and are not included. _", "price": "HK $118.50", "product_name": "ZMB8 Taker Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0514F_1_L.jpg/95fdd071c2c8c1f1c73675f89c96f1a8/MOBR0514F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zmb8takersetbag/"},
{"colour": "", "id": 156, "brand": "Crimes Of Beauty", "product_description": "A statement cosmetic bag.\nBlack and white, I Like My Rose Chilled Small Canvas Makeup Bag keeps all your makeup essentials safe and secure. Fitting perfectly into your handbag, the lightweight material and zip fastening makes it easy to carry.", "price": "HK $101.00", "product_name": "I Like My Rose Chilled Small Canvas Makeup Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/CROB0005F_1_L.jpg/2e9f4fd92214b8b9b629e3a787d9827d/CROB0005F_1_L.jpg", "product_url": "http://beautybay.com/accessories/crimesofbeauty/ilikemyrosechilledsmallcanvasmakeupbag/"},
{"colour": "", "id": 157, "brand": "beautyblender", "product_description": "An innovative tool crafted to make the challenge of producing even wings so much simpler.\nWarmed in the palm of your hand, Liner.Designer Pro Eye Liner Application Tool adheres to the skin for a secure, hands-free template for the perfect winged liner. Housed in a mirrored compact with an additional sucker pad, the kit is the ideal companion for eye liner application no matter where you are. Simply pressed onto the skin, the edge of the tool can be traced to ensure a flawless wing every time.", "price": "HK $133.90", "product_name": "Liner.Designer Pro Eye Liner Application Tool", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0041F_1_L.jpg/e3c72af9a25e5c91711eee364ad36498/BEBL0041F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/linerdesignerproeyelinerapplicationtool/"},
{"colour": "", "id": 158, "brand": "My Kit Co.", "product_description": "A synthetic pair of intense false eyelashes.\nDesigned for small eyes, My Mannequin Lashes add intense volume and definition. On a clear, flexible band, seamlessly apply to the lash line to complete a dramatic smoky eye look.", "price": "HK $157.30", "product_name": "My Mannequin Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0069F_1_L.jpg/3e187d8260e493c0009d16c1be2cc1b8/MYKI0069F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mymannequinlashes/"},
{"colour": "", "id": 159, "brand": "Violet Voss", "product_description": "Violet Voss Eye Do Premium 3D Faux Mink Lashes provide a full, luscious effect for the lashes sumptuously.\nComplete your glamorous lash look with these sensational crisscross lashes. Beautifully hand crafted using Faux Mink, Eye Do Premium 3D Faux Mink Lashes are easy to use. Sure to be a Beauty Bay best-seller, Eye Do Premium 3D Faux Mink Lashes are the perfect finishing touch to your eye makeup and are ideal for making a beauty statement.\nGet the lashes you have always dreamt of with Eye Do Premium 3D Faux Mink Lashes.", "price": "HK $100.40", "product_name": "Eye Do Premium 3D Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0039F_1_L.jpg/ddaf98106d79bce4e229bd82d67d6b5c/VIVO0039F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/eyedopremium3dfauxminklashes/"},
{"colour": "Clear 7g – HK $35.70,\nDark 7g – HK $35.70", "id": 160, "brand": "Ardell", "product_description": "Ardell Lashgrip is a lash adhesive which has been specially formulated for use with Ardell Lashes.\nBoasting an advanced formula which dries quickly and is virtually invisible, Lashgrip is also waterproof and holds strip lashes securely in place. Lashgrip is available in clear or dark to suit all lash styles and has a Latex based formula which offers temporary hold and is easy to remove without damaging the natural lashes.", "price": "HK $35.70", "product_name": "Lashgrip", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE0019F_2_L.jpg/0d06054609254f235f52430ba483195f/ARDE0019F_2_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/lashgrip/"},
{"colour": "", "id": 161, "brand": "Anastasia Beverly Hills", "product_description": "Anastasia Beverly Hills Brow Scissors are an essential beauty tool for trimming unwanted facial hair.\nCrafted exclusively in Italy, Brow Scissors are manufactured with the highest quality Stainless Steel blades for grooming perfection and precision. Beautifully designed for optimal control, Brow Scissors are the perfect size and shape for trimming brows.\n", "price": "HK $187.10", "product_name": "Brow Scissors", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANAS0029F_1_L.jpg/b39b1f36adc3e3fa8346bc4e138989e9/ANAS0029F_1_L.jpg", "product_url": "http://beautybay.com/accessories/anastasiabeverlyhills/browscissors/"},
{"colour": "", "id": 162, "brand": "beautyblender", "product_description": "Beautyblender Beauty.Blusher is a high-definition sponge applicator for the seamless distribution of blusher.\nIdeal for blusher application, Beauty.Blusher's edgeless shape delivers fast, fool proof results and effectively eliminates visible lines and streaks. The non-Latex sponge has an open cell structure which when wet with water fills the air opening to prevent the sponge from absorbing the products you're wearing meaning after each use you won't need to use as much makeup.\nInspired by the best-selling Original beautyblender, Beauty.Blusher has been exclusively designed to caress the apples of the cheeks and offers exceptional precision and performance.\nIdeal for cream and powder-based blusher, Beauty.Blusher ensures a streak-free finish with minimal makeup waste, meaning everybody will want to know the secret to your flawless airbrushed look.", "price": "HK $133.90", "product_name": "Beauty.Blusher", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0033F_1_L.jpg/ef6cff6a4773d45fc5526c0d6e20a07e/BEBL0033F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/beautyblusher/"},
{"colour": "", "id": 163, "brand": "Morphe", "product_description": "Morphe Brushes HH Square Snakeskin Case is a magnetic storage solution for your makeup tools and beauty essentials.\nBoasting a stylish faux snakeskin design, HH Square Snakeskin Case has a box like design which will look gorgeous on any dressing table and delivers spacious storage for your makeup brushes and favourite cosmetics.", "price": "HK $201.00", "product_name": "HH Square Snakeskin Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0106F_1_L.jpg/826bae2a6ed2161a31e581d2ac556940/MOBR0106F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/hhsquaresnakeskincase/"},
{"colour": "", "id": 164, "brand": "Anna Sui", "product_description": "Anna Sui Hand Mirror is an antique inspired beauty mirror.\nA must have for any dresser or vanity table, Anna Sui Hand Mirror is a small hand mirror which imitates a full-length antique mirror. Beautifully stylish and expertly designed with Anna SuiÉs signature detailing, Anna Sui Hand Mirror is the perfect way to add a touch of elegance to your beauty regime.", "price": "HK $122.00", "product_name": "Hand Mirror", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANSU0149F_1_L.jpg/0f718eebcb932c4b69b6949cb0a90429/ANSU0149F_1_L.jpg", "product_url": "http://beautybay.com/accessories/annasui/handmirror/"},
{"colour": "", "id": 165, "brand": "Velour Lashes", "product_description": "Velour Lashes Velour Lash Stick is a high performance lash glue in an easy to use pen applicator.\nThis patent pending lash glue has a twist pen dispenser which reduces wastage whilst the pointed tip offers precise application with less mess. Velour Lash Stick has an innovative formula which can be applied to the lashes straight away, no need to wait for the glue to go tacky like traditional lash glue, just apply and go!\nSpecially formulated for use with Mink lashes, Velour Lash Stick is available in various shades to match any makeup look and is easy to remove without damaging your Velour Lashes or natural lashes.", "price": "HK $85.00", "product_name": "Velour Lash Stick", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0020F_1_L.jpg/eee321002ab3c5d757deeaa7954ecc55/VELA0020F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/velourlashstick/white"},
{"colour": "", "id": 166, "brand": "Z Palette", "product_description": "A super sleek magnetic mini palette that stores three of your favourite shades.\nDeveloped to offer a compact storage solution to a few of your best-loved hues, the Mini Magnetic Palette is an ideal handbag must-have. Complete with a sturdy magnetic base the durable compact is sure to keep your shadows safe from harm.", "price": "HK $58.50", "product_name": "Mini Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0038F_1_L.jpg/8391ebddddb8ecc2e5d08f61b8d3a1f3/ZPAL0038F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/minimagneticpalette/"},
{"colour": "", "id": 167, "brand": "Mr. Blanc", "product_description": "A whitening tooth polish.\nFor additional oral care, Bamboo Charcoal Tooth Whitening Polish removes surface stains. Recommended for regular daily use, the low abrasion toothpaste neutralises discolouration without damaging enamel for strong, healthy and clean teeth.", "price": "HK $124.40", "product_name": "Bamboo Charcoal Tooth Whitening Polish 100ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MRBL0003U_1_L.jpg/cec71fadc80607423e1ebc45dedb01fd/MRBL0003U_1_L.jpg", "product_url": "http://beautybay.com/accessories/mrblanc/bamboocharcoaltoothwhiteningpolish/"},
{"colour": "", "id": 168, "brand": "Violet Voss", "product_description": "Violet Voss Striptease Premium 3D Faux Mink Lashes accentuate the eyes flawlessly, creating fuller, fluffier lashes effortlessly.\nExquisitely handcrafted with Faux Mink, Striptease Premium 3D Faux Mink Lashes has a semi dramatic design with a pattern that gradually gets longer towards the centre giving you the glamorous movie star effect.\nSuitable for all occasions from rock concerts and cocktails to a casual day look, Striptease Premium 3D Faux Mink Lashes will suit all eye shapes and are adored by beauty professionals and amateurs alike. Offering a lightweight, natural look, Violet Voss lashes can be reused up to 10 times and are sure to be a Beauty Bay best-seller.\nLet your eyes do the talking with Striptease Premium 3D Faux Mink Lashes.", "price": "HK $100.40", "product_name": "Striptease Premium 3D Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0041F_1_L.jpg/a395ca0350e633a4385d230fe44a9bb4/VIVO0041F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/stripteasepremium3dfauxminklashes/"},
{"colour": "", "id": 169, "brand": "Z Palette", "product_description": "Z Palette Square Metal Stickers are custom-made square metal stickers - because not all makeup comes in round pans!\nZ Palette thought about everything in the Z Palette creation process; these innovative stickers stick to the bottom of pans from original packaging, just peel the paper from the back and the sticker instantly creates a strong magnetic bond so your pan is ready to be put it its space saving place.\nThe flat surface is ideal for the writing the name of your shades so you always know where to find your favourite shade and are ideal for de-potted make-up.", "price": "HK $69.10", "product_name": "Square Metal Stickers", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0029F_1_L.jpg/da9799b0ec3db718e11f3e362a0f3672/ZPAL0029F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/squaremetalstickers/"},
{"colour": "", "id": 170, "brand": "Molly Cosmetics", "product_description": "A circular makeup applicator.\nWith non-absorbent properties, Stardust SiliSponge applies and blends liquid and cream products without any waste. Round and compact, reach in and around the corners of the face with this hygienic, easy-clean and glittered sponge.", "price": "HK $85.80", "product_name": "Stardust SiliSponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOCO0002F_1_L.jpg/421046ef903b84b154dbed5d76072b73/MOCO0002F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mollycosmetics/stardustsilisponge/"},
{"colour": "", "id": 171, "brand": "Z Palette", "product_description": "A fun and glamourous palette ideal for holding up to nine standard pans.\nA flirtatious patterned palette like the character herself, Betty Boop Bubbles Small Magnetic Palette is the perfect way to customise a travel sized collection. Complete with a magnetised base, the sturdy casing is the best way to protect your favourite hues.", "price": "HK $127.00", "product_name": "Betty Boop Bubbles Small Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0034F_1_L.jpg/dae6e190f6d3c35590113d3a489c0f04/ZPAL0034F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/bettyboopbubblessmallmagneticpalette/"},
{"colour": "", "id": 172, "brand": "Violet Voss", "product_description": "A set of cruelty-free, vegan-friendly false lashes that add doll-like definition to the eyes. Sexy And Eye Know It Premium Lashes are made of synthetic bristles that remain durable for the duration of wear.", "price": "HK $100.40", "product_name": "Sexy And Eye Know It Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0048F_1_L.jpg/bd1f4a67a2060bbacfd866787622dee7/VIVO0048F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/sexyandeyeknowitpremiumlashes/"},
{"colour": "", "id": 173, "brand": "Como Shambhala", "product_description": "Como Shambhala Invigorate Blended Essential Oil is a powerful blend of uplifting scents to enhance your mood and uplift the emotions.\nAn elevating blend of Eucalyptus and Peppermint is complemented by the softness of Lavender and Geranium to rediscover mental clarity and physical energy. Como Shambhala’s signature blend, Invigorate Blended Essential Oil can be used for vaporisation or as a room fragrance to uplift the mood and create an elevating ambience.\nFree from Parabens, Sulphates and Silicones, Invigorate Blended Essential Oil has a 100% natural formulation and leaves you feeling uplifted and energised.", "price": "HK $148.80", "product_name": "Invigorate Blended Essential Oil 10ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0017F_1_L.jpg/51954e0f815b4e75b218992ce27092e5/COSH0017F_1_L.jpg", "product_url": "http://beautybay.com/accessories/comoshambhala/invigorateblendedessentialoil/"},
{"colour": "", "id": 174, "brand": "Practk", "product_description": "A palm-sized, brush cleansing companion ideal for on-the-go cleaning.\nEspecially created to give an effortless cleansing solution for your much-loved makeup brushes, the Practk Palmat is an essential tool for any beauty lover. The unique silicone pad is designed with four raised textures that work together to remove dirt and oils from the bristles without altering their plush texture. The innovative pad is also fitted with a strap for hand-held cleaning, as well as suction cups to secure it firmly in the basin allowing you full cleansing control without any hindrance.", "price": "HK $95.10", "product_name": "Palmat", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PRAC0001U_1_L.jpg/e0c01dc5d107246293b10f5a23a333c2/PRAC0001U_1_L.jpg", "product_url": "http://beautybay.com/accessories/practk/palmat/"},
{"colour": "", "id": 175, "brand": "BH Cosmetics", "product_description": "An all in one brush belt with adjustable strap.\nWith eighteen various sized compartments the Studio Pro Beauty Belt is ideal for transporting your favourite beauty tools. The easy clean brush belt is complete with an adjustable waist strap making it easy to use for any beauty lover.", "price": "HK $153.00", "product_name": "Studio Pro Beauty Belt", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BHCO0142F_1_L.jpg/76d7959ef33aa00212854a00bae7d95e/BHCO0142F_1_L.jpg", "product_url": "http://beautybay.com/accessories/bhcosmetics/studioprobeautybelt/"},
{"colour": "", "id": 176, "brand": "Morphe", "product_description": "Morphe Brushes ZMB1 Lugger Set Bag is a professional storage and transportation solution for your makeup collection.\nDesigned for convenience and portability without compromising on storage space, ZMB1 Lugger Set Bag features a variety of internal and external pockets and is a Beauty Bay must have for professional makeup artists or for those beauty junkies who like to take their makeup everywhere.\n", "price": "HK $376.30", "product_name": "ZMB1 Lugger Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0107F_1_L.jpg/15321fbcb380bcc47b9e38bbc50718a7/MOBR0107F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zmb1luggersetbag/"},
{"colour": "", "id": 177, "brand": "Spectrum", "product_description": "A marble printed makeup bag.\nConvenient and compact, You Look Marbleous Cosmetics Bag is available in two colours to store and carry your must have makeup items. With a rose gold zip fastening, securely keep brushes, makeup and skincare in this stylish faux leather case.", "price": "HK $162.70", "product_name": "You Look Marbleous Cosmetics Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SPEC0051F_1_L.jpg/9cedb6433ce8f816ace28acdabc5ec27/SPEC0051F_1_L.jpg", "product_url": "http://beautybay.com/accessories/spectrum/youlookmarbleouscosmeticsbag/white"},
{"colour": "", "id": 178, "brand": "Unicorn Lashes ", "product_description": "The longest length lash Unicorn Lashes have created to date!\nDesigned to give you an effortlessly whimsical, yet dramatic feel no matter what eye look you're rocking, the 3D Silk Lashes Everlong are not for the faint hearted. The ultra-long, synthetic silk fibres sit seamlessly along the lash line for a unique, eye-catching finish.", "price": "HK $212.50", "product_name": "3D Silk Lashes Everlong", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0022F_1_L.jpg/e2fb9222bc7833e3b3c1f8e1c736c643/UNLA0022F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dsilklasheseverlong/"},
{"colour": "", "id": 179, "brand": "Morphe", "product_description": "Morphe Brushes A1 Jumbo Professional Apron is a must have beauty tool for makeup artists.\nMake sure your beauty essentials are always to hand with this stylish black apron. Designed with makeup artists in mind, A1 Jumbo Professional Apron includes pockets for all your makeup brushes, tools and cosmetics and has an adjustable strap which fits around most waists; the long apron deign also helps to keep your clothing clean.", "price": "HK $201.00", "product_name": "A1 Jumbo Professional Apron", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0099F_1_L.jpg/4f436561007b020f002741e7b8c94b83/MOBR0099F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/a1jumboprofessionalapron/"},
{"colour": "", "id": 181, "brand": "Ardell", "product_description": "Ardell Fashion Lashes 117 are natural full looking curved false lashes which add enviable volume to your natural lashes.\nReusable and easy-to-apply, Fashion Lashes 117 can be used for up to three weeks and are the perfect style for enhancing your natural lash flutter. Fashion Lashes 117 are made from 100% sterilised human hair and are ideal for any occasion.", "price": "HK $44.70", "product_name": "Fashion Lashes 117", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE0006F_1_L.jpg/8ec2fb3d96dba1e0e4629105ee6554e1/ARDE0006F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/fashionlashes117/117"},
{"colour": "", "id": 182, "brand": "Velour Lashes", "product_description": "Velour Lashes Lash In The City are the perfect false lashes for a dark smoky eye.\nBeautifully handcrafted with 100% authentic Mink Hair, Lash In The City are easy to apply and can be reused up to 25 times. Offering a lightweight, natural look, Velour Lashes are cruelty free with Mink Hair ethically sourced from free range zoos, the luxurious Mink Hair is recycled during the shedding seasons and then sterilised to ensure it is completely safe for use.\nLash In The City are suitable for all eye shapes and are the perfect choice for girls who just wanna have fun! Designed with extra fur on the cotton band to provide a dramatic and full look, this best-selling lash style also adds a winked look to the corner of the eyes.", "price": "HK $244.40", "product_name": "Lash In The City", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0001F_1_L.jpg/cb0f75ed260bc4e1fd73b32d150636bd/VELA0001F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/lashinthecity/"},
{"colour": "", "id": 183, "brand": "iWhite", "product_description": "Whitening and strengthening, a toothpaste that will deliver a Hollywood smile in an instant.\nFormulated to not only whiten the surface of the tooth but to restore the natural strength and enamel, Instant Whitening Toothpaste keeps teeth looking and feeling at the top their game. Both safe and effective, the clinically proven paste whitens teeth up to eight shades lighter for a healthy, eye catching smile you can achieve from home.", "price": "HK $95.10", "product_name": "Instant Whitening Toothpaste 2 75ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/IWHT0006U_1_L.jpg/12a7bf03d662e0f5eac92b234a1c35d8/IWHT0006U_1_L.jpg", "product_url": "http://beautybay.com/accessories/iwhite/instantwhiteningtoothpaste2/"},
{"colour": "", "id": 184, "brand": "Violet Voss", "product_description": "Violet Voss Wisp It Real Good Premium Lashes is a Natural lash enhancer that guarantees to beautifully frame the eyes.\nDesigned to create a subtle yet effective look, Wisp It Real Good Premium Lashes are exquisitely hand crafted using Human Hair and are perfect for accentuating your lashes with a touch of glamour and exquisite style. Easy to use, these magical lash enhancers deliver effortless application and are the perfect lash style for the party season.\nGet ready to flutter those lashes with Wisp It Real Good Premium Lashes.", "price": "HK $100.40", "product_name": "Wisp It Real Good Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0043F_1_L.jpg/9e95e372ea03aa591fabba332a71d5e4/VIVO0043F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/wispitrealgoodpremiumlashes/"},
{"colour": "", "id": 185, "brand": "Sigma Beauty", "product_description": "The answer to all your brush cleaning needs, literally in your hands.\nDeveloped for the ultimate comfort and upmost convenience, the Sigma Spa 2x Brush Cleaning Glove is home to eight raised textures for the intense deep cleansing of all your favourite eye and face tools. The unique design allows for an easy transition between the two sides and varying textures for a very simple hand held, stress free cleaning experience.", "price": "HK $403.90", "product_name": "Spa 2X Brush Cleaning Glove", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0099F_1_L.jpg/666be949276c9e3e42025e150fa772c9/SIGM0099F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/spa2xbrushcleaningglove/"},
{"colour": "", "id": 186, "brand": "Oh K!", "product_description": "The perfect makeup bag for any cat lover.\nCreated to carry all of your favourite beauty must-haves, the Oh K! Kitty Bag features a spacious inner pocket and sturdy wrist strap for safe, yet incredibly adorable travel solution. Complete with sticking up ears and a super-cute cat face design, this black cosmetic bag works just as well as a clutch or cosmetics carry case.", "price": "HK $95.70", "product_name": "Oh K! Kitty Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/OHKB0012F_1_L.jpg/dd4b78823ff27c590ac30abab4bfc642/OHKB0012F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ohk/ohkkittybag/"},
{"colour": "", "id": 187, "brand": "Nails Inc", "product_description": "Nails Inc Professional Nail File is perfect for keeping your nails in beautiful shape.", "price": "HK $63.40", "product_name": "Professional Nail File", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NAIN0121F_2_L.jpg/9411a816d862c427911e43b7002080d1/NAIN0121F_2_L.jpg", "product_url": "http://beautybay.com/nailcare/nailsinc/professionalnailfile/"},
{"colour": "", "id": 188, "brand": "My Kit Co.", "product_description": "A set of printed face charts.\nPrinted on high quality, textured paper, MY FACE by My Kit Co. Face Charts x 15 allows for makeup practicing and planning. Designed to hold product where you want it, create looks for both your personal and professional needs.", "price": "HK $76.50", "product_name": "MY FACE by My Kit Co. Face Charts x 15", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0024F_1_L.jpg/7d3238bd1c04455c6314ecf753aa953f/MYKI0024F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myfacebymykitcofacechartsx15/"},
{"colour": "", "id": 189, "brand": "Cover FX", "product_description": "Cover FX Click Stick Baton is the perfect storage solution for your makeup must-haves.\nDesigned to contain two of the Correct Click, Cover Click or Enhance Click, Click Stick Baton is a dual-ended vessel that protects the chosen products from damage whilst allowing you to look fabulously flawless on-the-go, thanks to its travel-friendly size.\nThis portable tool ensures that you have full creative control, making it a certified must-have for any cosmetic junkie's collection.\nTake perfection anywhere you go with Click Stick Baton, just Pick, Click and Go!\n", "price": "HK $28.70", "product_name": "Click Stick Baton", "image_url": "http://images.contentful.com/eoaaqxyywn6o/COFX0273F_1_L.jpg/2e3159d2800653fa7df7579f295aee22/COFX0273F_1_L.jpg", "product_url": "http://beautybay.com/accessories/coverfx/clickstickbaton/"},
{"colour": "", "id": 190, "brand": "Molly Cosmetics", "product_description": "A precision makeup applicator.\nFor detailed application, Midnight Point SiliSponge perfectly applies cream and liquid products under the eyes and around the nose. Made with non-absorbent materials, apply 100% of product with no wastage and an easy clean surface.", "price": "HK $85.80", "product_name": "Midnight Point SiliSponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOCO0003F_1_L.jpg/3da66d16cbce7b4cfad95e533192ce87/MOCO0003F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mollycosmetics/midnightpointsilisponge/"},
{"colour": "", "id": 191, "brand": "Ofra", "product_description": "An empty, magnetic palette.\nDesigned to store Ofra's individual godets, Pop Up Palette stores up to 48 grams of product. With individual pans available in 2,4 and 10 grams, customise your palette for the ultimate collection of eyeshadows, blushers and bronzers. Perfect for use on the go, prop up the base of the palette for a compact and convenient product stand.", "price": "HK $287.00", "product_name": "Pop Up Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/OFRA0266F_1_L.jpg/8893393fc9b0a5d872119154be3528de/OFRA0266F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ofra/popuppalette/"},
{"colour": "", "id": 192, "brand": "Velour Lashes", "product_description": "Whispie lashes created to achieve a naturally lengthened and fuller finish.\nCreated with mink hair, the Bare Naked false lashes offer a lightweight, volumised finish with style. The individual fibres are attached to an invisible band for a completely natural look, whilst the spaced out, cluster design of the hairs mimic the layout of natural lashes for a perfected wide eyed look.", "price": "HK $244.40", "product_name": "Bare Naked", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0041F_1_L.jpg/2b4ce48e00b2b58de6f88674ad0e2056/VELA0041F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/barenaked/"},
{"colour": "", "id": 193, "brand": "Unicorn Lashes ", "product_description": "Unleash the drama queen in you with this pair of ultra-black, voluminous false lashes.\nSometimes all you need is add a little drama to your look for it to truly pop: 3D Mink Lashes Cosmic Pegasus do exactly that! Crafted with high quality mink hair and a durable black band, these falsies can be relied upon time and time again for an amped up finish.", "price": "HK $244.30", "product_name": "3D Mink Lashes Cosmic Pegasus", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0003F_1_L.jpg/da072dbd80c9a626dc7500f56e43e383/UNLA0003F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dminklashescosmicpegasus/"},
{"colour": "", "id": 194, "brand": "Velour Lashes", "product_description": "Velour Lashes Strike A Pose is an indulgent pair of natural false lashes with glamorous length and thickness.\nAre you ready for the spotlight? Strike A Pose are one of Velour Lashes most dramatic styles and are the perfect false lashes for making bold beauty statements. With a Cotton band and a beautifully handcrafted design, Strike A Pose are made with 100% authentic Mink Hair which has been ethically sourced from free range zoos and recycled during the shedding seasons, then sterilised to ensure it is completely safe for use.\nEasy to apply, Strike A Pose can be reused up to 25 times and are suitable for all eye shapes. Designed with an abundance of Mink Fur with extra length and thickness, Strike A Pose guarantees you will be the centre of attention for all the right reasons.", "price": "HK $244.40", "product_name": "Strike A Pose", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0002F_1_L.jpg/3a1ae12ceed104aa039960c1631ee2e1/VELA0002F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/strikeapose/"},
{"colour": "", "id": 195, "brand": "Lilly Lashes", "product_description": "The perfect lashes for adding an intensely fluttery finish to your look.\nWith a gradually elongated length from the inner to outer corners, the Sydney 3D Mink Lashes create a mesmerising feminine finish. The silk-like mink fibres boast a true black hue along with a flawless fullness giving you the ideal lashes for daytime glam with added drama.", "price": "HK $318.80", "product_name": "Sydney 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0028F_1_L.jpg/14004ddb69ee21f8945bee47c4b76578/LILL0028F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/sydney3dminklashes/"},
{"colour": "", "id": 196, "brand": "Zeroskin", "product_description": "An exfoliating body sponge.\nFor daily use, Charcoal Body Exfoliating Sponge naturally smooths and firms skin. Gentle enough for all ages and skin types, scrub the body to improve texture and reveal a radiant, luminous complexion.", "price": "HK $114.80", "product_name": "Charcoal Body Exfoliating Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZESK0006F_1_L.jpg/5c5b5431b008d08767c6f915f5289d73/ZESK0006F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zeroskin/charcoalbodyexfoliatingsponge/"},
{"colour": "", "id": 197, "brand": "Pai Skincare", "product_description": "Created with 100% organic unbleached muslin cotton, Pai's 5 Organic Muslin Cloths are the ideal way to achieve a deeply cleansed complexion. Super soft and non-abrasive, the cloths offer a gentle exfoliating action that leaves the skin feeling clean and refreshed.", "price": "HK $161.90", "product_name": "5 Organic Muslin Cloths", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAIS0042F_1_L.jpg/7c6287970325b4e68aa7b1dccfcefc17/PAIS0042F_1_L.jpg", "product_url": "http://beautybay.com/skincare/paiskincare/5organicmuslincloths/"},
{"colour": "", "id": 198, "brand": "beautyblender", "product_description": "Created to commemorate the fifteenth anniversary of the iconic beautyblender sponge, a duo of powder pink minis.\nDeveloped to make contouring and highlighting with both powders and creams easier than ever, the Bubble Micro.Mini Duo is a must-have for creating a flawless base. Hand cut to a unique teardrop shape to ensure precision colour application, the miniature suede-like sponges are perfect for sculpting out even the smallest of areas for a seamless finish.", "price": "HK $138.70", "product_name": "Bubble Micro.Mini Duo", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0043F_1_L.jpg/5626b2bf9b12110c1aed43f5d67ac46f/BEBL0043F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/bubblemicrominiduo/"},
{"colour": "", "id": 199, "brand": "Morphe", "product_description": "A makeup brush holder.\nPerfect for travelling, RC2 Brush Tubby Case is a black, faux leather cylinder. With two press stud fastenings, use the other half as a protective lid or to separate dirty and clean brushes at home.", "price": "HK $149.50", "product_name": "RC2 Brush Tubby Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0656F_1_L.jpg/6939136914dc34286310949821d73721/MOBR0656F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/rc2brushtubbycase/"},
{"colour": "", "id": 200, "brand": "Paul & Joe", "product_description": "Paul & Joe Vintage Beauty Mirror is an elegant compact mirror which is perfect for touch ups on the go.\nLarge enough to allow you to see your whole face, Vintage Beauty Mirror has a slim line design which fits perfectly in any handbag. The innovative fold back lid allows you to stand the mirror upright for effortless makeup application.\nThe sophisticated design has pleat detailing and a chrysanthemum motif which makes this gorgeous mirror a collectable, standout makeup essential.", "price": "HK $180.70", "product_name": "Vintage Beauty Mirror", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC0434F_1_L.jpg/308bb8bfe7cfcce99b3e426287d66dbe/PAJC0434F_1_L.jpg", "product_url": "http://beautybay.com/accessories/pauljoe/vintagebeautymirror/"},
{"colour": "", "id": 201, "brand": "Unicorn Lashes ", "product_description": "Full, fluffy and voluminous false lashes that give the perfect finishing touch to any sultry smoky eye.\nCrafted to add intense drama and depth, the 3D Silk Lashes Rebel Smoke are ideal for any party-ready eye look. Crafted with the finest wisps of synthetic silk in a gradient of length from the inner to outer corner each attached along a durable black band, these lashes just scream undeniable glamour.", "price": "HK $106.20", "product_name": "3D Silk Lashes Rebel Smoke", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0016F_1_L.jpg/1fd3da33b68e7bcca36d5c8b54c865f7/UNLA0016F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dsilklashesrebelsmoke/"},
{"colour": "", "id": 202, "brand": "Morphe", "product_description": "Thick, jet black lashes.\nMade for a night out, ML112 Premium Lashes create dramatic volume. Transforming any look, the synthetic lashes are cruelty free and high quality for long, uninterrupted wear that's lightweight and comfortable.", "price": "HK $24.70", "product_name": "ML112 Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0773F_1_L.jpg/8c44f7f824023a7b34d2314d91569d43/MOBR0773F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/ml112premiumlashes/"},
{"colour": "", "id": 203, "brand": "Spectrum", "product_description": "A latex-free makeup sponge for the seamless application of cream, powder or liquid-based products. Easy to clean and effortless to control, Wonder Sponge glides smoothly across the skin, imparting the desired amount of product without creating streaks, patches or unevenness.", "price": "HK $47.80", "product_name": "Pink Unicorn Tears Wonder Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SPEC0037F_1_L.jpg/f3ac21369d8a6f451ccd33aa341be5af/SPEC0037F_1_L.jpg", "product_url": "http://beautybay.com/accessories/spectrum/pinkunicorntearswondersponge/pink"},
{"colour": "", "id": 204, "brand": "Tweezerman", "product_description": "Tweezerman Pushy & Nail Cleaner is an innovative 2 in 1 manicure tool which neatens cuticles and cleans nails.\nExpertly crafted using the finest Stainless Steel, Pushy & Nail Cleaner combines Tweezerman's famous Pushy® cuticle pusher with a convenient nail cleaner. Super-thin edges are buffed smooth to prevent scratching while the textured body provides a perfectly secure grip.\nA must-have classic for professional quality manicures and pedicures, Pushy & Nail Cleaner can also be used on acrylic nails. Nails are left superbly clean whilst cuticles appear healthy and perfectly groomed.\n", "price": "HK $136.30", "product_name": "Pushy & Nail Cleaner", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0124U_1_L.jpg/a0eee9a20546df14f52506b6f745d03d/TWEE0124U_1_L.jpg", "product_url": "http://beautybay.com/nailcare/tweezerman/pushynailcleaner/"},
{"colour": "", "id": 205, "brand": "Sigma Beauty", "product_description": "The ultimate brush cleaning system.\nEnhancing the cleaning and drying process, Sigma Brush Care System Complete is a fast and hygienic alternative. With textured sides, swirl shampooed brushes over the pads for a deeper clean that removes oil and bacteria before drying and reshaping up to 18 brushes.", "price": "HK $329.50", "product_name": "Sigma Brush Care System Complete", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0195F_1_L.jpg/9c93e9720b90874b7321a33760e6a3ac/SIGM0195F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/sigmabrushcaresystemcomplete/"},
{"colour": "", "id": 206, "brand": "Glamher Booth", "product_description": "A faux leather brush holder.\nWith individual brush pockets, Glamher Booth Brush Roll holds up to 18 brushes. A pale pink colour, the case is soft to touch and easy to clean with a magnetic snap fastening for maximum convenience.", "price": "HK $90.40", "product_name": "Glamher Booth Brush Roll", "image_url": "http://images.contentful.com/eoaaqxyywn6o/GLBO0028F_1_L.jpg/70c2b129115ce2680632d438141c846d/GLBO0028F_1_L.jpg", "product_url": "http://beautybay.com/accessories/glamherbooth/glamherboothbrushroll/"},
{"colour": "", "id": 207, "brand": "Lilly Lashes", "product_description": "A multi-length set of faux mink lashes to add a sultry finish to the lash-line.\nDesigned by reality star Kim Zolciak Biermann, the Believe by Kim Zolciak Biermann 3D Mink Band-Less Lashes are perfect for delivering an effortlessly glamourous look. The unique lashes boast a comfortable, lightweight and clear band along with ultra-black fibres varying in length to create a multi-dimensional, voluptuous finish.", "price": "HK $318.80", "product_name": "Believe by Kim Zolciak Biermann 3D Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0042F_1_L.jpg/841cf69b3006663aef251505d5836122/LILL0042F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/believebykimzolciakbiermann3dminkbandlesslashes/"},
{"colour": "", "id": 208, "brand": "My Kit Co.", "product_description": "Individual, disposable mascara wands.\nAn essential for every professional makeup kit, Myscara Wands x 20, offers hygienic application for each client. In a pack of twenty, each wand can be used once to apply mascara or comb brows.", "price": "HK $34.00", "product_name": "Myscara Wands x 20", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0003F_1_L.jpg/35615c6865ef4771ea066e89b9907fe9/MYKI0003F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myscarawandsx20/"},
{"colour": "", "id": 209, "brand": "Ardell", "product_description": "Lashtite Black works to provide a strong grip on individual lashes for weeks' worth of adhesion in one application. The black tone of the glue creates depth to the lash-line which is easy to blend with your favourite eye liner for a dramatic finish.", "price": "HK $44.70", "product_name": "Lashtite Dark", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE8038F_1_L.jpg/b6a8b117b7a3d30a88dda317ca6e9b86/ARDE8038F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/lashtitedark/black"},
{"colour": "", "id": 210, "brand": "My Kit Co.", "product_description": "The ultimate, professional makeup carrier.\nWith separate pockets, My Backstage Buddy has compartments for palettes, makeup and even tissues. With a handy strap and clear sides, carry them all comfortably whilst seeing what's inside. Perfect for on set, stylishly and conveniently take everything you need.", "price": "HK $361.30", "product_name": "My Backstage Buddy", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0064F_1_L.jpg/7ebc25ebe192a7d1354c3c940b6e0099/MYKI0064F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mybackstagebuddy/"},
{"colour": "", "id": 211, "brand": "Lilly Lashes", "product_description": "A set of false lashes that add volume and depth.\nDesigned to impart enviable volume, the Mykonos 3D Mink Lashes are ideal for those whose want to take their eye look to the next level. The unique design of interlacing 'V' shaped clusters creates seamlessly blended results with a flirty, full finish.", "price": "HK $318.80", "product_name": "Mykonos 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0021F_1_L.jpg/65f92b31a1952e6366aea3a9878298b1/LILL0021F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/mykonos3dminklashes/"},
{"colour": "", "id": 212, "brand": "Tweezerman", "product_description": "A classic eyelash curler.\nIn stylish rose gold, Rose Gold Classic Eyelash Curler volumises and curls lashes. With a rounded, silicone pad, each lash is captured and curled for intense, long-lasting definition.", "price": "HK $171.70", "product_name": "Rose Gold Classic Eyelash Curler", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0245U_1_L.jpg/32472359228063a88c4954010f8bfb80/TWEE0245U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/rosegoldclassiceyelashcurler/"},
{"colour": "", "id": 213, "brand": "Lilly Lashes", "product_description": "A multi-layered set of real mink lashes to add noticeable dimension to the lash-line.\nDeveloped to impart wispie length that gradually builds towards the outer corner, the Doha 3D Mink Lashes are ideal for creating a wide-eye finish. With a layer clustered mink hairs for length over top of hair in criss-cross formation for volume these lashes truly deliver an undeniably versatile look.", "price": "HK $318.80", "product_name": "Doha 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0022F_1_L.jpg/e4665411b7650885174255c06a99ed05/LILL0022F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/doha3dminklashes/"},
{"colour": "", "id": 214, "brand": "Morphe", "product_description": "Morphe Brushes Morphe Sharpener ensures that your eye and lip lining will always be precise and flawless due to the pin-point tip it provides.\nFeaturing two barrels for small and thick pencil barrels, Morphe Sharpener has a patented two-blade design which ensures the pencil tip is never over or under sharpened. Perfect for sharpening and reshaping lip and eye pencils, Morphe Sharpener can be used with a multitude of cosmetic pencils, making it a certified must-have for any makeup fanatic.\nGet to the point with Morphe Sharpener.", "price": "HK $36.00", "product_name": "Morphe Sharpener", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0380F_1_L.jpg/5c5c83c2424a400681572a986d509bfd/MOBR0380F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/morphesharpener/"},
{"colour": "", "id": 215, "brand": "Kevyn Aucoin", "product_description": "Kevyn Aucoin Face Forward Book is a stunning picture book packed with amazing celebrity transformations which show how makeup can give anyone a variety of different 'faces'.\nA national best-seller, Face Forward Book is a comprehensive selection of images, illustrations and step-by-step guides and features celebrities such as Gwyneth Paltrow, Susan Sarandon, Martha Stewart and Madonna transformed into other iconic celebrities and historic figures such as James Dean, Twiggy, Cher and Sophia Loren using just a combination of makeup and Kevyn's pure talent.\nProving beauty is not just for Hollywood, Face Forward Book also shows everyday men and women such as sales associates and mothers transformed through the art of makeup. For every look step by step instructions are provided so you can recreate the looks at home.\nThe perfect gift for anyone who loves to dress up and experiment with their makeup, Face Forward Book is the perfect coffee table display book and is sure to be loved by any makeup addict.", "price": "HK $167.40", "product_name": "Face Forward Book", "image_url": "http://images.contentful.com/eoaaqxyywn6o/KEAU0223F_1_L.jpg/b8ecb71d2369604b9a513b94ab97f006/KEAU0223F_1_L.jpg", "product_url": "http://beautybay.com/accessories/kevynaucoin/faceforwardbook/"},
{"colour": "Hot Pink – HK $186.50,\nBlack – HK $186.50", "id": 216, "brand": "Blank Canvas Cosmetics", "product_description": "A travel friendly makeup pouch.\nAvailable in two colours, BC Standee Compact Upright Standing Pouch carries and displays a selection of makeup products. Made from faux leather with a suede centre, stylishly hold up to 20 brushes and wipe clean for maximum convenience.", "price": "HK $186.50", "product_name": "BC Standee Compact Upright Standing Pouch", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BLCC-blankcanvascosmeticsbcstandeepouch_1_GL.jpg/a610ac9d19c7a27838fc5b4aa4f42bc0/blankcanvascosmeticsbcstandeepouch_1_GL.jpg", "product_url": "http://beautybay.com/accessories/blankcanvascosmetics/bcstandeecompactuprightstandingpouch/"},
{"colour": "", "id": 217, "brand": "Morphe", "product_description": "A practical makeup bag for carrying all your essentials.\nFeaturing two exterior zip pockets and a larger main compartment, the ZMB9 Stowy Set Bag is a great all round bag for carrying make up with you, and for at-home storage, too. The transparent design ensures you can see the contents at a glance and are easy to wipe clean too, whilst the attached carry handles and adjustable shoulder strap ensure it's easy to tote around, even when full.\nMeasurements: 14''L x 6.5''W x 8.25''H\n_Please note, bag is supplied empty - makeup products are for illustrative purposes only and are not included. _", "price": "HK $149.50", "product_name": "ZMB9 Stowy Set Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0515F_1_L.jpg/3f829bd482fed62276842ae0a1f09479/MOBR0515F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/zmb9stowysetbag/"},
{"colour": "", "id": 218, "brand": "Velour Lashes", "product_description": "Velour Lashes I Got It From My Momma! are luxurious natural looking Mink false lashes.\nExquisitely handcrafted with ethically sourced and sterilised Mink Hair from free range zoos, I Got It From My Momma! Are Velour Lashes most natural looking design and have a short, consistent design which adds length, volume and definition to the lashes without looking too overpowering.\nReusable for up to 25 times, I Got It From My Momma! are suitable for all eye shapes and are easy to apply. Although less dramatic than other Velour Lashes styles, I Got It From My Momma! are sure to become a makeup bag staple for accentuating your natural lash look.", "price": "HK $244.40", "product_name": "I Got It From My Momma!", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0008F_1_L.jpg/f9279711097e213fd1defbcb284918e9/VELA0008F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/igotitfrommymomma/"},
{"colour": "", "id": 219, "brand": "Como Shambhala", "product_description": "Como Shambhala Invigorate Travel Candle emits a refreshingly pure scent that fills any room beautifully when lit.\nA Beauty Bay exclusive, Invigorate Travel Candle utilises its renowned blend of Eucalyptus, Peppermint, Lavender and Geranium in the form of a decadent wax candle, which when used, intoxicates the surrounding area with enchantment and rejuvenation effortlessly.\nSpecially formulated to add a sense of calm to the mind, Invigorate Travel Candle is suitably perfect for all of those with a busy, stressful life, where time to unwind and relax can be extremely rare. With the ability to lift your mood and renew all physical energy thanks to the inclusion of the Essential Oils blend, this elegant candle certifies itself as an absolute essential for all!\nFind mental clarity with Invigorate Travel Candle.", "price": "HK $138.20", "product_name": "Invigorate Travel Candle 105g", "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0049F_1_L.jpg/e9fdafa56f71901c5ddc3e0e49e19a3b/COSH0049F_1_L.jpg", "product_url": "http://beautybay.com/accessories/comoshambhala/invigoratetravelcandle/"},
{"colour": "", "id": 220, "brand": "Lilly Lashes", "product_description": "A lightweight set of false lashes designed to provide an elegant curl.\nCreated to add a feminine finish to even the simplest of eye looks, the Ela 3D Mink Band-Less Lashes are perfect for day to day wear. The weightless lashes have a defined curl and varying lengths, sitting along an invisible band to deliver a barely there finish.", "price": "HK $318.80", "product_name": "Ela 3D Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0016F_1_L.jpg/1cc014540f8ff9bf3b4502d694a85369/LILL0016F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/ela3dminkbandlesslashes/"},
{"colour": "", "id": 221, "brand": "beautyblender", "product_description": "Beautyblender Red Carpet Sponge is a bright red high-definition cosmetic sponge applicator.\nSporting an iconic red colour, Red Carpet Sponge's edgeless shape delivers fast, fool proof results and effectively eliminates visible lines and streaks.  The non-Latex sponge has an open cell structure which when wet with water fills the air opening to prevent the sponge from absorbing the products you're wearing meaning after each use you wonÉt need to use as much make-up. Perfect for blending foundation and concealers, Red Carpet Sponge is soft to touch with a unique suede texture and delivers full coverage to the face.\nFrom creams and liquids to powders, Red Carpet Sponge works to cover blemishes and blends makeup without creating changes in the texture or tone of your skin leaving a perfect finish. Expertly crafted, the pointed tip of Red Carpet Sponge is designed for the hard-to-reach areas of the face such as under the eyes and the nose and mouth whilst the rounded base is perfect for larger areas such as the cheeks, forehead and chin.\nEnsuring a streak-free application with minimal makeup waste everybody will want to know the secret to your flawless airbrushed look.", "price": "HK $153.00", "product_name": "Red Carpet Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0020F_1_L.jpg/2d88c6baff0fefd2bb97d3cdec7043af/BEBL0020F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/redcarpetsponge/"},
{"colour": "", "id": 222, "brand": "Tweezerman", "product_description": "A deep cleaning cleansing brush.\nSmall and compact, Complexion Cleansing Brush is ergonomically designed for maximum results and comfort. With fine, soft bristles, gently and effectively clean deep within the pores before leaving to dry quickly and hygienically with its tilted brush head and ventilated cap.", "price": "HK $181.80", "product_name": "Complexion Cleansing Brush", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0253U_1_L.jpg/d291dc22f70e2cfdd862384316dd7fc8/TWEE0253U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/complexioncleansingbrush/"},
{"colour": "", "id": 223, "brand": "Z Palette", "product_description": "Z Palette De-Potting Spatula is a handy tool for taking your pans out of palettes or containers to transfer to your Z Palette.\nBut first of all what is de-potting?\nWhether you're popping eye shadows out of their useless plastic pots or scooping the last bits of your favourite lipstick out of the tube and into empty metal pans, de-potting is the answer to every beauty lover's make up woes.\nHelp the planet by ditching the excess plastic packaging and make de-potting a breeze with this double ended spatula. With a designer multi-colour metallic finish, De Potting Spatula gently eases pans out of their packaging using a lifting motion but it also helps to take out lipsticks and concealers from tubes thanks to its non-slip grip so you can make the most of your favourite products.\nCompletely de-cluttering your makeup bag and drawers, De Potting Spatula also doubles as a mixing tool for creating custom shades!", "price": "HK $104.80", "product_name": "De Potting Spatula", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0022F_1_L.jpg/adc6bae9bfc5afba7fd4200178c8355d/ZPAL0022F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/depottingspatula/"},
{"colour": "", "id": 224, "brand": "Morphe", "product_description": "Morphe Brushes Straight Scissors can be used to groom the brows, remove unwanted facial hair and general daily grooming.\nCrafted with convenience and on-the-go beauty in mind, Straight Scissors are manufactured with the highest quality Stainless Steel blades for grooming perfection and precision. Beautifully designed for optimal control, Straight Scissors are a certifiable necessity for any beauty junkie's cosmetic tool collection.\nCut any unwanted hairs out of your life with Straight Scissors from the beauty experts at Morphe Brushes.", "price": "HK $61.80", "product_name": "Straight Scissors", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0381F_1_L.JPG/426d82457f121de10eef4f8c3c04b337/MOBR0381F_1_L.JPG", "product_url": "http://beautybay.com/accessories/morphe/straightscissors/"},
{"colour": "", "id": 225, "brand": "Festival Face", "product_description": "A clear, glitter adhesive.\nWith a sheer finish and gel texture, Glitter Fix Gel is safe and effective on all skin. With a quick drying and clear formula, apply discretely before covering with your chosen glitters and removing easily with soap and water.", "price": "HK $29.30", "product_name": "Glitter Fix Gel", "image_url": "http://images.contentful.com/eoaaqxyywn6o/FEFA0019F_1_L.jpg/8874910de62ebf75b56baf5805291ac0/FEFA0019F_1_L.jpg", "product_url": "http://beautybay.com/accessories/festivalface/glitterfixgel/"},
{"colour": "", "id": 226, "brand": "Morphe", "product_description": "Morphe's ML747XS Premium Lashes are thick, small black lashes for transforming any eye look.\nLuxuriously lightweight without compromising on dramatic effect, ML747XS  Premium Lashes are crafted from high quality Synthetic fibres. Extremely versatile and Cruelty-free, ML747XS Premium Lashes can be incorporated into any daily makeup routine and are the ideal beauty accessory for creating any look from naturally chic to daring night time glamour.", "price": "HK $41.20", "product_name": "ML747XS Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0461F_1_L.jpg/3bd8c580a6f10f2db0164b08c0871fce/MOBR0461F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/ml747xspremiumlashes/"},
{"colour": "", "id": 227, "brand": "Velour Lashes", "product_description": "Sparse inner corner lashes fan out to become thicker and fuller for a natural glammed up finish.\nThe Perfect Fan delivers exactly that. Gradually longer and thicker lashes towards the outer corner of the band create a fan-like effect widening the eyes. 100% Silk hairs bonded to a completely hand- made durable cotton threaded band last for up to 20 light weight and comfortable uses.", "price": "HK $196.70", "product_name": "Silk The Perfect Fan", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0037F_1_L.jpg/d1ac62efc5a4d1b635e959d51db8ea51/VELA0037F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/silktheperfectfan/"},
{"colour": "", "id": 228, "brand": "Lilly Lashes", "product_description": "If you're looking for eye accentuating lashes with a natural finish, look no further.\nCreated to add subtle length and curl to accentuate the eyes, the Diamonds Luxury Mink Lashes are a must-have essential for any lash-lover. The lightweight falsies boast the finest mink fibres for comfortable all-day wear and effortless day time glam.", "price": "HK $212.60", "product_name": "Diamonds Luxury Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0008F_1_L.jpg/4e142681eaf74e644502bc40b8997e3b/LILL0008F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/diamondsluxuryminklashes/"},
{"colour": "", "id": 229, "brand": "beautyblender", "product_description": "An innovative sponge created to offer an airbrushed finish when used with both powder and cream based products.\nDesigned with a unique elliptical shape, the Royal Sponge allows for the seamless application of products to all areas of the face with complete ease. The suede-like texture of the patented sponge can be used both wet and dry for the creation of a number of flawless finishes. Created in a bright purple hue, this version of the best-selling tool is a limited edition design that's a must have for any beauty lover.", "price": "HK $153.00", "product_name": "Royal Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0037F_1_L.jpg/f132cc83e8b6b55e89b10c5c306a3c4a/BEBL0037F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/royalsponge/"},
{"colour": "", "id": 230, "brand": "My Kit Co.", "product_description": "Colourful makeup sponges.\nA collection of eight latex free sponges, My Petals buff and blend cream and powder products on to the face. A pretty addition to any kit, apply product wet or dry for a smooth and even coverage.", "price": "HK $46.80", "product_name": "My Petals", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0014F_1_L.jpg/523027a0b163936a5c4da902fc583ed0/MYKI0014F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mypetals/"},
{"colour": "", "id": 231, "brand": "Velour Lashes", "product_description": "Velour Lashes Whispie Sweet Nothing are Mink false lashes which allow you to achieve volume without extreme thickness.\nInspired by the highly demanded Ardell Whispie lashes but exquisitely hand crafted with the most luxurious Mink Hair, Whispie Sweet Nothing have a clustered design which adds length and natural looking volume to the lashes.\nIdeal for creating glamorous daytime looks, Whispie Sweet Nothing are easy to apply and can be reused up to 25 times. Offering a lightweight, natural look, Velour Lashes are cruelty free with Mink Hair ethically sourced from free range zoos, the luxurious Mink Hair is recycled during the shedding seasons and then sterilised to ensure it is completely safe for use.", "price": "HK $244.40", "product_name": "Whispie Sweet Nothing", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0012F_1_L.jpg/ed4e5712fdfef1e62281a0c7c837dd15/VELA0012F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/whispiesweetnothing/"},
{"colour": "", "id": 232, "brand": "My Kit Co.", "product_description": "A makeup bag for smaller items.\nPerfect for storing blushers and powders, My PVC Rectangle has a zipped top and convenient handle, making an ideal travel companion. With a clear top and sides, see exactly what's inside for easy accessibility.", "price": "HK $76.50", "product_name": "My PVC Rectangle", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0023F_1_L.jpg/cb6d3bc3b7392c643757ce680f1531e0/MYKI0023F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mypvcrectangle/"},
{"colour": "", "id": 233, "brand": "Violet Voss", "product_description": "A silicone-based makeup applicator.\nCrafted from a super-smooth silicone, the Perfect Weapon Applicator Glitter guarantees a flawless, full coverage finish with zero product wastage. Specifically designed to apply and blend makeup just like your favourite sponges and brushes, but without absorbing any of your makeup, this innovative applicator is a real game changer.  With no need to dampen, this silicone sponge can be used instantly with powder, cream and liquid makeup, for a seamless finish with minimal effort.", "price": "HK $47.90", "product_name": "Perfect Weapon Applicator Glitter", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0088F_1_L.jpg/144db2e62ab9934f74887b566e09bfa0/VIVO0088F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/perfectweaponapplicatorglitter/"},
{"colour": "", "id": 234, "brand": "My Kit Co.", "product_description": "A customisable palette.\nWith 12 magnetic discs, My Magnetic Palette can hold your favourite de-potted products. Store small amounts of blusher and powder, or attach your own individual pans with the 12 magnetic stickers also provided.", "price": "HK $102.00", "product_name": "My Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0029F_1_L.jpg/2ae287e1a471085ee218f6e6350190c1/MYKI0029F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mymagneticpalette/"},
{"colour": "", "id": 236, "brand": "Lilly Lashes", "product_description": "The perfect false lashes to get you red carpet ready.\nDesigned to add both length and volume to your favourite glam eye looks, the Hollywood 3D Mink Lashes are the ideal final step in getting party-ready. The super-fine mink hair focuses its length on the centre of the band to deliver a wide eyed feminine finish.", "price": "HK $318.80", "product_name": "Hollywood 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0031F_1_L.jpg/c7885fe00076c6223fb85a83eb992f88/LILL0031F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/hollywood3dminklashes/"},
{"colour": "", "id": 237, "brand": "Violet Voss", "product_description": "A limited edition eyelash trio.\nDisplayed in a unicorn printed box, Eye Believe In Unicorn Trio Faux Mink Lashes, contains three pairs of triple stacked eyelashes. Offering extreme volume and 3D definition, create high intensity looks with up to ten wears per pair.", "price": "HK $267.80", "product_name": "Eye Believe In Unicorn Trio Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0086F_1_L.jpg/11f22e33e34b973d2ab0c780e26ac2f0/VIVO0086F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/eyebelieveinunicorntriofauxminklashes/"},
{"colour": "", "id": 238, "brand": "Unicorn Lashes ", "product_description": "A subtle, limited edition set of false lashes that focus on adding sultry volume.\nCrafted for those of you who already have the lash length but are needing a little extra help in the volume department, the Mink Lashes Serene Dream are a super-simple yet beautiful addition to your collection. Designed with high quality mink hair in a gradient of lengths from the inner to outer corner, all attached along a durable black band, these lashes add a sultry finish to a classic style.", "price": "HK $191.20", "product_name": "Mink Lashes Serene Dream", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0010F_1_L.jpg/2d0d37edcfe56420585dba9dc2bf159f/UNLA0010F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minklashesserenedream/"},
{"colour": "", "id": 239, "brand": "Z Palette", "product_description": "Z Palette Round Metal Stickers are custom-made round metal stickers.\nZ Palette thought about everything in the Z Palette creation process; these innovative stickers stick to the bottom of pans from original packaging, just peel the paper from the back and the sticker instantly creates a strong magnetic bond so your pan is ready to be put it its space saving place.\nThe flat surface is ideal for the writing the name of your shades so you always know where to find your favourite shade and are ideal for de-potted make-up.", "price": "HK $52.60", "product_name": "Round Metal Stickers", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0030F_2_L.jpg/feec2c31dafdb434b1b312f04da2ece3/ZPAL0030F_2_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/roundmetalstickers/"},
{"colour": "", "id": 240, "brand": "beautyblender", "product_description": "Beautyblender Body Blender is a high performance sponge for flawless application of self tan and body bronzers.\nBeautyblender has gone XXL with the highly anticipated Body Blender! Contoured enough to sit perfectly in your hand but large enough to effortlessly bounce over the curves of your body, Body Blender is sure to be a Beauty Bay best-seller.\nExpertly crafted from the same luxurious suede material as the original sponge everybody knows and loves, Body Blender is Latex free, non-allergenic and odour free and lets you achieve the ultimate flawless finish for your body makeup, allowing you to blend to perfection, which is not always easy to do.\nEnsuring controlled and even coverage and super-soft, streak-free blending, this revolutionary beauty tool delivers impeccable application with minimum waste and is the answer to stopping your sun kissed glow from looking faux.\nKeeping the hands clean, Body Blender is just as easy to use as its smaller predecessor and comes in the coveted pro black shade to prevent staining from tanning products.", "price": "HK $210.40", "product_name": "Body Blender", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0023F_1_L.jpg/ece5b6c5792aa1a88f01332866fc268c/BEBL0023F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/bodyblender/"},
{"colour": "", "id": 241, "brand": "Lilly Lashes", "product_description": "A must-have tool for any false lash lover.\nCreated to ensure that you achieve the perfect application every time, the Perfect Lash Applicator is a beauty tool essential. As simple to use as tweezers but without the chance of injury, this tool is truly a lash applying hero.", "price": "HK $106.30", "product_name": "Perfect Lash Applicator", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0035F_1_L.jpg/c645e961bae817acb0fa767d91f0c729/LILL0035F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/perfectlashapplicator/"},
{"colour": "", "id": 242, "brand": "Morphe", "product_description": "Disposable makeup sponges.\nLatex free, Disposable Wedges 8 Pieces are convenient makeup essentials. Ensuring precise and hygienic makeup application, the short, wide triangular sponges apply base products to the face and make the perfect addition to both home and professional kits.", "price": "HK $41.20", "product_name": "Disposable Wedges 8 Pieces", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0700F_1_L.jpg/4833a1688514d8b0e55ad659634e55dc/MOBR0700F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/disposablewedges8pieces/"},
{"colour": "", "id": 243, "brand": "Z Palette", "product_description": "Z Palette Dome Magnetic Palette Black is a patented dome palette with an extra deep base.\nWe are all guilty of having our make-up stashes in different drawers and leaving our palettes on messy bathroom counter tops, Z Palette's Dome Magnetic Palette Black is our make-up organising saviour!\nIdeal for storing your baked, mineralised, dome-shaped products and even brushes, Dome Magnetic Palette Black features an extra deep base with enough surface area to store up to 33 standard sized, round or square pans.\nDome Magnetic Palette Black features a clear window so you can see all your compacts at a glance and also has a lid that completely folds back giving you easy access to your makeup. With everything in one place, Dome Magnetic Palette Black also allows you to be more creative by using shades you may not have had the chance to use as much.\nLightweight, durable and eco-friendly, Dome Magnetic Palette Black's sleek slim design makes it ideal for makeup artists, travel and saving space in your drawers - making bulky makeup bags and cluttered drawers a thing of the past!", "price": "HK $217.90", "product_name": "Dome Magnetic Palette Black", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0002F_2_L.jpg/95fd620da79f723812f2370bf053bed0/ZPAL0002F_2_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/domemagneticpaletteblack/"},
{"colour": "", "id": 244, "brand": "Morphe", "product_description": "Morphe Brushes Straight Tweezers offers straight-forward precision when removing unwanted facial hairs and undergoing general daily grooming.\nSpecially designed with a strong, straight tip, Straight Tweezers can grip even the shortest of hairs, meaning you will never have to experience that frustration felt when you just can't get to that pesky strand. Loved by professional brow technicians and makeup artists the world over, Straight Tweezers are sure to be a Beauty Bay best-seller and are a makeup bag essential for any cosmetic obsessive.\nTweeze with ease!", "price": "HK $51.50", "product_name": "Straight Tweezers", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0384F_1_L.jpg/98802ae4cb76d59a6f70286536a4d012/MOBR0384F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/straighttweezers/"},
{"colour": "", "id": 245, "brand": "OPV Beauty", "product_description": "A large empty palette.\nAllowing maximum creative freedom, X-Large Empty Magnetic Palette creates the ultimate customised palette. Holding up to 18 individual pans, magnetically attach separate and de-potted products to store and carry your favourite shadows, highlighters and blushers.", "price": "HK $191.30", "product_name": "X-Large Empty Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/OPVB0068F_1_L.jpg/6191c47a65e79a4d92127733a936a57d/OPVB0068F_1_L.jpg", "product_url": "http://beautybay.com/accessories/opvbeauty/xlargeemptymagneticpalette/"},
{"colour": "", "id": 246, "brand": "beautyblender", "product_description": "Beautyblender Pro Sponge has been specially designed with professional makeup artists in mind. Celebrity makeup artist Rea Ann Silva, creator of the original beautyblender© has taken her expertise in creating a flawless face one step further with the introduction of beautyblender© Pro.\nThe Pro Sponge delivers the same outstanding results as the original beautyblender Sponge yet allows you to achieve a higher pigmented coverage. The unique suede texture is soft to the touch and the curves are designed to fit the contours of your face, leaving your make up simply flawless.\nBeautyblender© Pro Sponge has a patent-pending elliptical shape making for fool proof makeup application. Forget your fingers or sharp-edged triangular sponges, these application methods waste make up and can leave visible streaks; beautyblender© Pro Sponge lets you achieve the ultimate flawless finish for your make up, allowing you to blend to perfection, which is not always easy to do.", "price": "HK $153.00", "product_name": "Pro Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0017F_1_L.jpg/4ace1a99cc32d9eacc708b1d7cfd4665/BEBL0017F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/prosponge/"},
{"colour": "", "id": 247, "brand": "Ardell", "product_description": "Ardell Natural Lashes Demi Pixies are elegant false lashes with a spiky design.\nComplete with an invisible band that connects the hair strands to form a strip, Natural Lashes Demi Pixies are knotted and feathered by hand for perfect uniformity and a natural look.\nNatural Lashes Demi Pixies are made of premium quality 100% human hair providing just the right length and offer easy application for a glamorous look in a matter of minutes.", "price": "HK $44.70", "product_name": "Natural Lashes Demi Pixies", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE0010F_1_L.jpg/bdcea5cf35e5443d6486790d2b22cd7f/ARDE0010F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/naturallashesdemipixies/black"},
{"colour": "", "id": 248, "brand": "Morphe", "product_description": "Morphe Brushes A4 Zip Up Brush Belt delivers convenient storage for your makeup brushes and tools.\nDoubling as a travel bag and belt for your makeup essentials, A4 Zip Up Brush Belt features an adjustable clasp fastening to fit around most waists. Offering various sized pockets, A4 Zip Up Brush Belt is ideal for storing all your makeup brushes from small eye brushes to oversized powder brushes and also includes a large pocket to store some of your favourite cosmetics.\nWhen not used as a belt, A4 Zip Up Brush Belt can be zipped up to create a stylish makeup bag for easy transportation so you are never without your favourite beauty necessities.", "price": "HK $149.50", "product_name": "A4 Zip Up Brush Belt", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0103F_1_L.jpg/018112226f1404ea5074242bacd38f64/MOBR0103F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/a4zipupbrushbelt/"},
{"colour": "", "id": 249, "brand": "Paul & Joe", "product_description": "An empty foundation case.\nFitting one Gel Foundation Refill, Paul & Joe's Limited Edition Gel Foundation Case conveniently stores your chosen shade. In an opal pink pearl, the rounded compact has a delicate floral print on its durable plastic casing for easy, travel-friendly use.", "price": "HK $108.40", "product_name": "Limited Edition Gel Foundation Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC1625F_2_L.jpg/896d8a44e83d94453150045d2775fed9/PAJC1625F_2_L.jpg", "product_url": "http://beautybay.com/accessories/pauljoe/limitededitiongelfoundationcase/"},
{"colour": "", "id": 250, "brand": "beautyblender", "product_description": "A large beautyblender cleanser.\nCharcoal infused, Blendercleanser Solid Pro gently removes dried and used product from brushes and sponges. In two parts, use the textured silicone pad to deep clean and the lavender scented cleanser to lather and clean.", "price": "HK $382.60", "product_name": "Blendercleanser Solid Pro 150g", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0046F_1_L.jpg/f87943f25c0fa1927edf180541f327ea/BEBL0046F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/blendercleansersolidpro/"},
{"colour": "", "id": 251, "brand": "Morphe", "product_description": "Morphe Brushes RC1 Mega Brush Tubby Case stylishly and efficiently contains all of your favourite brushes in one place.\nFeaturing a stunning leather effect, RC1 Mega Brush Tubby Case utilises a cylindrical design to hold all of the necessary makeup tools safely, without the risk of damage. Compact and easy to slip into any suitcase or handbag, this enchanting container is completely travel-friendly, making it an absolute must-have for any cosmetic obsessive who is consistently on-the-go.\nTake care of your brushes and they will take care of you!", "price": "HK $206.20", "product_name": "RC1 Mega Brush Tubby Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0447F_1_L.jpg/8814eeffb0e6fc7a661b70af2b229d03/MOBR0447F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/rc1megabrushtubbycase/"},
{"colour": "", "id": 252, "brand": "Tweezerman", "product_description": "Professional eyelash curlers.\nRose gold in colour, Pro Curl Eyelash Curler stylishly curls and defines lashes. Designed specifically for round eye shapes, the reworked angles offer maximum comfort and results with minimum effort. With a larger opening and narrowed bar, access each individual lash to create an intense, crease-free curl.", "price": "HK $176.70", "product_name": "Pro Curl Eyelash Curler", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0243U_1_L.jpg/f4d04fb624da4a2ecce7c3ac8c034371/TWEE0243U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/procurleyelashcurler/"},
{"colour": "", "id": 253, "brand": "beautyblender", "product_description": "Beautyblender Two.BB.Clean contains two of the innovative original beautyblender Sponges and a specially developed cleanser to keep them clean and hygienic.\nThe renowned beautyblender Sponge has a patent-pending elliptical shape which makes application fool proof by allowing you to access hard-to-reach areas with stunning ease. Featuring a suede texture, beautyblender Sponge is sensual to the touch whilst the unique curves fit the contours of your face, leaving your makeup dazzling and undetectable. beautyblender Sponge is Latex-free, non-allergenic and odour free.\nTwo.BB.Clean also includes a full sized Blender Cleanser which will keep your beautyblender Sponge in tip top condition. Lightly Lavender-scented, Blender Cleanser is free of Dyes and skin irritants. The soothing Soy-based, low suds formula breaks down rapidly, making it eco-friendly and fun to use.\nThe perfect introduction to beautyblender, this luxurious gift set is sure to be a Beauty Bay best-seller and is packaged in a reusable storage case which is the perfect storage solution for your beautyblender Sponges whilst they dry out.\nGet the makeup you have always dreamt of with the help of Two.BB.Clean.", "price": "HK $363.50", "product_name": "Two.BB.Clean", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0034F_1_L.jpg/1f50e139a949e0b147ac4552ee3b4bd1/BEBL0034F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/twobbclean/"},
{"colour": "", "id": 254, "brand": "Vita Liberata", "product_description": "Completely re-usable, the flocked Tanning Mitt works to deliver a streak-free flawless tan with ease whilst preventing stained palms.", "price": "HK $31.90", "product_name": "Tanning Mitt", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI0021F_1_L.jpg/f0348b77026d3b31efb99cff8994dca6/VILI0021F_1_L.jpg", "product_url": "http://beautybay.com/accessories/vitaliberata/tanningmitt/"},
{"colour": "", "id": 255, "brand": "Tweezerman", "product_description": "Tweezerman LED Light 10x & 1x Compact Mirror is a deluxe compact mirror perfect for aiding the application of makeup and shaping the brows.\nWith two quality-perfect mirrors, Led Light 10x & 1x Compact Mirror offers two convenient perspectives to ensure accurate pruning and application. Featuring an illuminating LED light, this efficient compact offers crystal clear clarity, to ensure perfection can be achieved effortessly. With the ability to be transformed into a stand-up mirror or conveniently thrown into any handbag for touch ups on the go, LED Light 10x & 1x Campact Mirror would make the perfect gift for any beauty junkie.\nSee things clearly forevermore with LED Light 10x & 1x Compact Mirror.", "price": "HK $227.10", "product_name": "LED Light 10x & 1x Compact Mirror", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0214U_1_L.jpg/7af17e0c150bbe0794c9c874d3c1f634/TWEE0214U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/ledlight10x1xcompactmirror/"},
{"colour": "", "id": 256, "brand": "Oh K!", "product_description": "A kitten themed compact mirror.\nPerfectly sized for even the smallest of handbags the Oh K! Pocket Mirror is perfect for beauty touch ups on the go. The cute cat themed casing features a sturdy clasp fastening and opens up to reveal two mirrors ensuring you remain perfectly polished at all times.", "price": "HK $63.80", "product_name": "Oh K! Pocket Mirror", "image_url": "http://images.contentful.com/eoaaqxyywn6o/OHKB0010F_1_L.jpg/449b35569c18a8916e94622c9501fb06/OHKB0010F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ohk/ohkpocketmirror/"},
{"colour": "", "id": 257, "brand": "beautyblender", "product_description": "A collection of three beautyblenders.\nInspired by summer sunsets, summer.fling Trio contains three colourful beautyblenders. Creating seamless makeup application, blend powders and liquids with the angled sponge for a long-lasting and flawless base.", "price": "HK $382.60", "product_name": "summer.fling Trio", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0045F_1_L.jpg/491382cc905dcc53c351c0a1d1f309b0/BEBL0045F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/summerflingtrio/"},
{"colour": "", "id": 258, "brand": "Unicorn Lashes ", "product_description": "Super wispie lashes for a natural looking enhanced finish.\nDesigned to add an effortlessly enchanted finish to all your daytime looks, the 3D Mink Lashes in Pixie Wisp will soon become your go-to. Carefully crafted with a durable black band and lightweight mink hairs, these falsies will give enviable lash length you can rely on.", "price": "HK $244.30", "product_name": "3D Mink Lashes Pixie Wisp", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0005F_1_L.jpg/c6191ef88cd0a2bee0c33f6d5dade939/UNLA0005F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dminklashespixiewisp/"},
{"colour": "", "id": 259, "brand": "Lilly Lashes", "product_description": "The perfect false lash set for creating a flirty definition.\nCreated to add a lightweight, fluttery finish to your eye look, the NYC 3D Mink Lashes are the embodiment of feminine glamour. With enviable length and an evenly distributed volume, the silk-like mink hairs achieve the illusion of naturally fuller results that will leave your friends in awe.", "price": "HK $318.80", "product_name": "NYC 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0024F_1_L.jpg/ec4148e3ca14c644149feac43dc35fa0/LILL0024F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/nyc3dminklashes/"},
{"colour": "", "id": 260, "brand": "Lilly Lashes", "product_description": "A staple eyelash perfecting tool.\nDefinitely a makeup bag essential, the Eyelash Curler is a fool-proof device to achieving enviable natural lashes. Complete with pink silicone pads, this must-have tool deliver the perfect curl without painful pinching or unsightly kinks.", "price": "HK $132.90", "product_name": "Eyelash Curler", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0034F_1_L.jpg/05f38953b86df8f4a1e5e6bfcbf866c1/LILL0034F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/eyelashcurler/"},
{"colour": "", "id": 261, "brand": "This Works", "product_description": "This Works Sleep Plus+ Pillow Spray is a natural sleep remedy which helps to restore healthy sleep patterns to restless sleepers.\nBoasting a wondrous 100% of restless sleepers stating that Sleep Plus+ Pillow Spray actually works, this natural blend of Vetivert, Lavender and Patchouli is naturally encapsulated to gradually release aromatherapeutic benefits as you sleep.\nUnlike other sleep remedies, Sleep Plus+ Pillow Spray offers immediate relief for temporary sleeplessness and continuously works for 8 hours to ensure you get a good night's sleep and wake up looking and feeling alert and refreshed.\nClinically proven to provide a better night's sleep, Sleep Plus+ Pillow Spray is free from Parabens, Sulphates and harsh chemicals and is Beauty Bay's beauty secret for a restful slumber.", "price": "HK $307.40", "product_name": "Sleep Plus+ Pillow Spray 75ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0196U_4_L.jpg/43639d3bb2050ef1da42b7cc7c984f75/THWO0196U_4_L.jpg", "product_url": "http://beautybay.com/accessories/thisworks/sleeppluspillowspray/"},
{"colour": "", "id": 262, "brand": "iWhite", "product_description": "iWhite Instant Professional Teeth Whitening Kit 2 is a high performance at home teeth whitening kit which whitens the teeth by up to 8 shades, strengthens the teeth structure and restores enamel.\nPowered by the new and unique Triple Teeth Whitening Technology, Instant Professional Teeth Whitening Kit 2 is a one-step system which is easy to use and will actively remove stains from the teeth with immediate effect after the first application.\nClinically proven safe and instantly effective, Instant Professional Teeth Whitening Kit 2 features 10 thin and flexible trays to ensure comfortable fit and maximum performance without having to clean or boil messy mouth pieces or mess with fussy syringes or brushes. This one size fits all teeth whitening kit only takes 20 minutes a day and can be used for 5 consecutive days for astonishing results or once in a while for whitening maintenance.\nThe whitening gel of InstantProfessional Teeth Whitening Kit 2 combines the knowledge and technology of iWhite Instant -Film-Crystallized Calcium technology - with additional benefits due to the innovative Triple Teeth Whitening Technology. Patented Phthalimido Peroxy Caproic Acid (PAP) targets the unnatural double bounds which cause dental discolorations and dissolves the stains present on the enamel in a gentle and effective way; by doing this, the tooth surface is whitened and stains are removed.\nThe second functional aspect of the technology is the Calciofluorocomplex. Fluoride particles will be adsorbed onto the surface of a tooth and speed up the growth of new surface. The complex will also release additional Calcium Ions, this will increase the Calcium levels in the saliva and inhibit the loss of apatite in the enamel. The Calciofluorocomplex will hereby remineralise damaged enamel and strengthen the teeth structure. This will lead to a natural whitening effect.\nFinally the innovative MOHA Complex is composed of small, snow white Hydroxyapatite Microcrystals which are released on the enamel and is the key natural building block of teeth. By releasing these hydroxyl-apatite crystals this ingredient will restore and rebuild the enamel and enable the teeth the regain their natural white colour.", "price": "HK $360.80", "product_name": "Instant Professional Teeth Whitening Kit 2", "image_url": "http://images.contentful.com/eoaaqxyywn6o/IWHT0004U_1_L.jpg/cb4cf3e16f24353d8aeeb3fef4a3123b/IWHT0004U_1_L.jpg", "product_url": "http://beautybay.com/accessories/iwhite/instantprofessionalteethwhiteningkit2/"},
{"colour": "", "id": 263, "brand": "Sigma Beauty", "product_description": "A textured cleaning mitt.\nWith 8 advanced cleaning textures, 2x Sigma Spa Brush Cleaning Glove & Deluxe Spa Glove Duo comfortably and conveniently deep cleans brushes. With two thumb holes for easy transitioning, wear as desired to remove product build up and excess oils from all shapes and sizes of brushes.", "price": "HK $366.70", "product_name": "2x Sigma Spa Brush Cleaning Glove & Deluxe Spa Glove Duo", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0196F_1_L.jpg/aac2951796fb96f5f0a237097050e7bb/SIGM0196F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/2xsigmaspabrushcleaningglovedeluxespagloveduo/"},
{"colour": "", "id": 264, "brand": "Morphe", "product_description": "Empty magnetic eyeshadow palette.\nWith Morphe's ACC11 Empty Magnetic Palette add up to 28 individual shadows of your choice. As a compact, neat storage solution or a handy travel palette it perfectly houses one of all your favourite colours and plenty of your favourite finishes.", "price": "HK $103.10", "product_name": "ACC11 Empty Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0697F_1_L.jpg/cce0facbae5efc15e97b99e464b9771d/MOBR0697F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/acc11emptymagneticpalette/"},
{"colour": "", "id": 265, "brand": "Ardell", "product_description": "Ardell Natural Lashes Babies are premium false lashes which lengthen and thicken the eyelashes giving just the right amount of volume for a natural look.\nComplete with an invisible band that connects the hair strands to form a strip, Natural Lashes Babies are knotted and feathered by hand for perfect uniformity and a natural look. Natural Lashes Babies are made of high quality 100% human hair and are styled to just the right length for a natural look.", "price": "HK $44.70", "product_name": "Natural Lashes Babies", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE0008F_1_L.jpg/c2a34f894adc730fbd20eaedf0959563/ARDE0008F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/naturallashesbabies/babies"},
{"colour": "", "id": 266, "brand": "Anastasia Beverly Hills", "product_description": "Anastasia Beverly Hills Precision Tweezers is a professional beauty tool for effortless brow grooming.\nMade in Italy and custom designed to meet precise specifications, Precision Tweezers are expertly crafted with the highest quality Stainless Steel and feature calibrated tension and a slanted tip to tweeze even the finest hairs without breaking the hair or skin.\nDesigned for long lasting performance, Precision Tweezers are loved by many professional brow artists and are definitely a Beauty Bay essential for flawless brow grooming.", "price": "HK $233.80", "product_name": "Precision Tweezers", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANAS0027F_1_L.jpg/09a7c88130984d34f5de37947b4e9643/ANAS0027F_1_L.jpg", "product_url": "http://beautybay.com/accessories/anastasiabeverlyhills/precisiontweezers/"},
{"colour": "", "id": 267, "brand": "My Kit Co.", "product_description": "A pack of two face puffs.\nPerfect for applying powders, My Deluxe Puffs are super soft velour. With a ribbon attached to the back, hold and pat over the face for ultimate control or to protect existing makeup when applying more.", "price": "HK $46.80", "product_name": "My Deluxe Puffs", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0012F_1_L.jpg/57356cf2263833339e24e7090aae56c8/MYKI0012F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mydeluxepuffs/"},
{"colour": "", "id": 268, "brand": "Ardell", "product_description": "Ardell Accents 318 Black are a set of glamorous half sized lashes designed to enhance your natural lash flutter.\nThe perfect way to accentuate your natural lashes, Accents 318 Black are expertly crafted with 100% sterilised Human Hair and are half the size of traditional false lashes to enhance the density along the outer edge of your lash line. Easy to use and reusable, Accents 318 Black suit all eye shapes and are perfect for any occasion.", "price": "HK $44.70", "product_name": "Accents 318 Black", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE0027F_1_L.jpg/28742bffa659d5c5901948e3ff75b70a/ARDE0027F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/accents318black/"},
{"colour": "", "id": 269, "brand": "Morphe", "product_description": "Compact magnetic eyeshadow palette.\nCustomise your ACC9 Empty Magnetic Palette by adding any six shadows of your choice. Easily interchangeable, mix and match colours and finishes to put together the perfect travel-sized palette for all occasions.", "price": "HK $61.80", "product_name": "ACC9 Empty Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0695F_1_L.jpg/a3e384de68cbd1ebe0e031afd4909d0d/MOBR0695F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/acc9emptymagneticpalette/"},
{"colour": "", "id": 270, "brand": "Morphe", "product_description": "Bold, choppy lashes.\nAdding intensity, ML40 Premium Lashes feature clusters of dense lashes. Transforming any look, the synthetic lashes are cruelty free and high quality for long, uninterrupted wear that's lightweight and comfortable.", "price": "HK $20.60", "product_name": "ML40 Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0780F_1_L.jpg/bdba4adb11ae4a63bcb762f47d27bf9c/MOBR0780F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/ml40premiumlashes/"},
{"colour": "", "id": 271, "brand": "Tweezerman", "product_description": "Tweezerman Safety Slide Callus Shaver & Rasp is the perfect combination tool for removing calluses and smoothing the skin.\nReduce stubborn calluses with the shaver then softly and evenly smooth the skin with this pedicure duo's finely textured rasp. Safety Slide Callus Shaver & Rasp has an ergonomic handle which makes for easy and sure grip and features a replaceable blade.\nWith an innovative design, this two in one tool employs a unique “slide and lock” mechanism that allows you to safely conceal the shaver portion of the tool when not in use.\nDry skin and calluses are effortlessly removed for gorgeously smooth feet.", "price": "HK $121.20", "product_name": "Safety Slide Callus Shaver & Rasp", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0034U_1_L.jpg/b06c2169e4ec3ae359e40753c6983fdf/TWEE0034U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/safetyslidecallusshaverrasp/"},
{"colour": "", "id": 272, "brand": "Tweezerman", "product_description": "Tweezerman Facial Magnifying Mirror With Light is a powerful, compact mirror that is perfect for tweezing, make-up application and contact lens insertion.\nThis optically correct, 10x magnifying mirror lets you isolate even the finest hair for precise, easy tweezing every time. Suction caps on the back of the mirror attach to any smooth, flat surface making this mirror portable, practical and ideal for the home or whilst travelling.\nThe battery operated light ensures ultimate precision and easy vision even in poorly lit bathrooms whilst the clear edge-to-edge mirror has no distortion so you won’t miss a single hair.", "price": "HK $156.50", "product_name": "Facial Magnifying Mirror With Light", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0011U_1_L.jpg/512827569db29ca62e9b5dc4e74af296/TWEE0011U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/facialmagnifyingmirrorwithlight/"},
{"colour": "", "id": 273, "brand": "Lilly Lashes", "product_description": "The embodiment of Vegas in a flawless false lash set.\nIf you're thinking voluminous, bold and fabulously long then the Vegas 3D Mink Lashes definitely won't disappoint. The super black, wipsie mink hairs work together to blend into the natural lashes for a seamlessly blended finish.", "price": "HK $318.80", "product_name": "Vegas 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0019F_1_L.jpg/58437ffce23832e5a2af80b29cfcddcc/LILL0019F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/vegas3dminklashes/"},
{"colour": "", "id": 274, "brand": "Lilly Lashes", "product_description": "Gain dramatic length and enviable volume with these glamourous false lashes.\nCreated with an invisible band, the Dalia 3D Faux Mink Band-Less Lashes are perfect for achieving a subtly enhanced finish. The smooth, silk-like fibres blend seamlessly with your natural lashes for an effortlessly accentuated finish.", "price": "HK $265.70", "product_name": "Dalia 3D Faux Mink Band-Less Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0001F_1_L.jpg/4c4277e54fd5475d01bdc7f58d0a2313/LILL0001F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/dalia3dfauxminkbandlesslashes/"},
{"colour": "", "id": 275, "brand": "Crimes Of Beauty", "product_description": "A small statement cosmetic bag.\nWith a detachable wrist strap, Glam AF Small Wristlet Makeup Bag stores all your makeup essentials with ease. Designed with a faux leather finish, wipe clean and keep secure with a silver zip fastening.", "price": "HK $126.20", "product_name": "Glam AF Small Wristlet Makeup Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/CROB0008F_1_L.jpg/e7cb14e5cf9b05248d68227c751109ac/CROB0008F_1_L.jpg", "product_url": "http://beautybay.com/accessories/crimesofbeauty/glamafsmallwristletmakeupbag/"},
{"colour": "", "id": 276, "brand": "Oh K!", "product_description": "A baby pink cosmetic sponge created to effortlessly blend makeup.\nWith a semi-firm texture and almost hourglass shape, the Oh K! Cosmetic Sponge is designed to be used damp, seamlessly blending foundation, blush, highlight and bronze products to a flawless finish. Shaped with a pointed end, curves and a flattened base, it reaches larger and smaller contours of the face perfectly for an airbrushed complexion every time.", "price": "HK $53.10", "product_name": "Oh K! Cosmetic Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/OHKB0004F_1_L.jpg/f7b8118df99d12900f406dc3203fc5d3/OHKB0004F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ohk/ohkcosmeticsponge/"},
{"colour": "", "id": 277, "brand": "Violet Voss", "product_description": "For fuller, fluffy eyelashes.\nWith layered, fluttery fibres, Eye Want It That Way Premium 3D Faux Mink Lashes add 3D definition. The straight, pointed lashes showcase extraordinary length whilst the thicker band adds intense volume. Made with high quality synthetic materials, the durable lashes last up to ten uses.", "price": "HK $100.40", "product_name": "Eye Want It That Way Premium 3D Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0084F_1_L.jpg/97754a9cbe1af4cd8be58e417728d254/VIVO0084F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/eyewantitthatwaypremium3dfauxminklashes/"},
{"colour": "", "id": 278, "brand": "Tweezerman", "product_description": "A volumising lash curler.\nDesigned for almond-shaped and deep set eyes, Pro Master Lash Curler reaches all the individual, hard to reach hairs. With an extra wide opening and cushioned bar, curl and define in gentle comfort.", "price": "HK $186.70", "product_name": "Pro Master Lash Curler", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0244U_1_L.jpg/923284c8e253282d89c29c664c660f66/TWEE0244U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/promasterlashcurler/"},
{"colour": "", "id": 279, "brand": "My Kit Co.", "product_description": "A synthetic pair of natural looking false eyelashes.\nOn a flexible clear band, My 925 Lashes add both comfortable and subtle volume. Creating an air of elegance, the fan of fine, lightweight lashes are gently curved for a wide, doe-eyed effect.", "price": "HK $157.30", "product_name": "My 925 Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0068F_1_L.jpg/1101d2ec88bba6c3b40777355609d1aa/MYKI0068F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/my925lashes/"},
{"colour": "", "id": 280, "brand": "beautyblender", "product_description": "Beautyblender Blotterazzi is a revolutionary blotting sponge for keeping shine at bay.\nOil blotting papers are set to become a thing of the past now the new Blotterazzi has arrived. Expertly crafted from the same luxe material as the original beautyblender Sponge, these innovative blotting sponges gently lift oil from the surface of the skin without disturbing makeup.\nPackaged in a sleek teardrop compact, Blotterazzi includes 2 washable and reusable blotting sponges to ensure your complexion is always flawless even out and about. The innovative compact helps to keep your Blotterazzi clean and away from makeup and also features vents for continued freshness.\nA must have beauty accessory and definitely a better option for blotting than messy and embarrassing blotting papers, each Blotterazzi lasts for up to 60 days when cleansed regularly and is sure to become a handbag essential.", "price": "HK $153.00", "product_name": "Blotterazzi", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BEBL0024F_1_L.jpg/8b37120b1c5740de66335dd17ab1b95c/BEBL0024F_1_L.jpg", "product_url": "http://beautybay.com/accessories/beautyblender/blotterazzi/"},
{"colour": "", "id": 281, "brand": "Anastasia Beverly Hills", "product_description": "Anastasia Beverly Hills 3 in 1 Sharpener is an exclusive beauty tool which sharpens and refreshes all cosmetic pencils.\nDesigned to fit all sizes of Anastasia’s brow maintenance pencils, 3 in 1 Sharpener features small and large holes and an innovative insert for medium sized pencils. The professional design helps to maintain the optimal performance and precision of your cosmetic pencils whilst the super sharp blades deliver professional results.", "price": "HK $50.70", "product_name": "3 in 1 Sharpener", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANAS0030F_1_L.jpg/53536d57e98b63e9e088ce86e8e7e8ed/ANAS0030F_1_L.jpg", "product_url": "http://beautybay.com/accessories/anastasiabeverlyhills/3in1sharpener/"},
{"colour": "", "id": 282, "brand": "My Kit Co.", "product_description": "A portable makeup bag.\nWith canvas sides and a clear front, My Canvas Pouch stores and organises makeup. With a zip fastening and convenient handle, fill, stack and carry for stylish storage.", "price": "HK $72.30", "product_name": "My Canvas Pouch", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0021F_1_L.jpg/eaec0a7647c08695115e59cd976fb383/MYKI0021F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mycanvaspouch/"},
{"colour": "", "id": 283, "brand": "Tweezerman", "product_description": "Tweezerman File Buff Shine Pad shapes and shines nails to a perfectly manicured finish without the need for nail polish.\nThis gorgeous combination set combines an essential nail file with a multi-purpose buffing block to shape, smooth and buff nails to an amazing natural shine finish. Achieve a beautiful manicure in minutes, File Buff Shine Pad decreases any ridges and removes any oils on top of the nail as well as helping nail polish stick to your nails by roughing up the surface.\nThe professional nail file is packaged in a colourful FileMate™ carry case for safe and clean storage whilst the high-quality buffing pad features multi-surfaces for a variety of finishes. File Buff Shine Pad leaves nails looking healthy, shiny and perfectly manicured.", "price": "HK $90.90", "product_name": "File Buff Shine Pad", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0032U_1_L.jpg/91a48012341dac731e8afdff0b790cb1/TWEE0032U_1_L.jpg", "product_url": "http://beautybay.com/nailcare/tweezerman/filebuffshinepad/"},
{"colour": "", "id": 284, "brand": "Morphe", "product_description": "Morphe Brushes BCS30 30 Slot Pro Leatherine Case is a deluxe storage solution for your makeup brushes and tools.\nLoved by professional makeup artists, BCS30 30 Slot Pro Leatherine Case features 30 individual pockets to store your full makeup brush collection and is ideal for makeup pros and beauty novices alike. Folding in place with press stud fastenings to keep your brushes safe when not in use, BCS30 30 Slot Pro Leatherine Case is sure to be a Beauty Bay favourite.", "price": "HK $103.10", "product_name": "BCS30 30 Slot Pro Leatherine Case", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0105F_1_L.jpg/a7410ec468a0af07f86158443872bac9/MOBR0105F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/bcs3030slotproleatherinecase/"},
{"colour": "", "id": 285, "brand": "Violet Voss", "product_description": "Violet Voss Vamptress Premium 3D Faux Mink Lashes make a dramatic lash effect for the eyes, resulting in a sumptuously stylish finish.\nVamptress Premium 3D Faux Mink Lashes are knotted and feathered by hand for a perfectly natural yet striking look. Vamptress Premium 3D Faux Mink Lashes Pixies are made of premium quality Faux Mink providing just the right length and offer easy application for a glamorous look in a matter of minutes.\nFinish off any look with Vamptress Premium 3D Faux Mink Lashes from the beauty experts at Violet Voss.", "price": "HK $100.40", "product_name": "Vamptress Premium 3D Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0042F_1_L.jpg/ce8074c5813d1221f243a93c30730485/VIVO0042F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/vamptresspremium3dfauxminklashes/"},
{"colour": "", "id": 286, "brand": "Lilly Lashes", "product_description": "If you're looking for rock star lashes look no further.\nDesigned to pack an added punch to your party-ready eye look, the Caviar Luxury Mink Lashes are must-have for any lash-lover. The ultra-black falsies use wispie fibres which blend with natural hairs for a defined effect.", "price": "HK $212.60", "product_name": "Caviar Luxury Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0007F_1_L.jpg/b73a2c79b37b00707a862eb9f183cc77/LILL0007F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/caviarluxuryminklashes/"},
{"colour": "", "id": 287, "brand": "Tweezerman", "product_description": "A magnifying, light-up mirror.\nDesigned for detailed, precision tasks, LED 15x Mini Mirror offers edge to edge clarity. With no distortion, the magnified, light up mirror comes with suction cups for easy attachment and hands free use.", "price": "HK $242.30", "product_name": "LED 15x Mini Mirror", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0250U_1_L.jpg/ad12ef333b64518a2b46d3b385ff4623/TWEE0250U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/led15xminimirror/"},
{"colour": "", "id": 288, "brand": "Morphe", "product_description": "Morphe Brushes ACC3 28 Color Magnetic Palette features 28 empty slots for your chosen pressed powder cosmetics.\nThe ideal storage solution for your eye shadows, cheek colours and other powder based cosmetics, ACC3 28 Color Magnetic Palette has a lightweight and durable design which is perfect for travel. Great for storing and displaying your favourite shades to create your own unique palette, ACC3 28 Color Magnetic Palette is loved by professional makeup artists and allows you to save space in your beauty drawers without compromising on your colour options.", "price": "HK $103.10", "product_name": "ACC3 28 Color Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0097F_1_L.jpg/9542cf3a11ab94224eb7bc67425423cc/MOBR0097F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/acc328colormagneticpalette/"},
{"colour": "", "id": 289, "brand": "Tweezerman", "product_description": "Tweezerman Easy Finish Facial Hair Remover is a truly innovative hair removal tool that will revolutionise your beauty regime.\nAesthetically pleasing and completely travel-friendly, Easy Finish Facial Hair Remover features two easy-grip handles and an adjustable coil spring that gently, painlessly and effectively removes any unwanted strands from the complexion, resulting in a smooth, supple effect.\nPromising to eradicate all traces of unwelcome facial hair, Easy Finish Facial Hair Remover certifies itself as a true cosmetic necessity and is suitable for all hair and skin types, even the most sensitive.\nSuitable for use on the cheeks, jaw line and upper lip, Easy Finish Facial Hair Remover causes no irritation to the skin whist remaining efficient, making it a must-have for any beauty junkie.\nSay goodbye to facial hair with Easy Finish Facial Hair Remover from the experts at Tweezerman.", "price": "HK $126.20", "product_name": "Easy Finish Facial Hair Remover", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0225U_1_L.jpg/64bf1d19898a02fdc9a2f1c4837913ce/TWEE0225U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/easyfinishfacialhairremover/"},
{"colour": "", "id": 290, "brand": "Morphe", "product_description": "Disposable makeup sponges.\nLatex free, Disposable Wedges 36 Pieces are convenient makeup essentials. Ensuring precise and hygienic makeup application, the long, thin triangular sponges fit perfectly in and around the face making the perfect addition for both home and professional kits.", "price": "HK $108.20", "product_name": "Disposable Wedges 36 Pieces", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0699F_1_L.jpg/880ba92af4c840e98ca4b1fbd6c7e30a/MOBR0699F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/disposablewedges36pieces/"},
{"colour": "", "id": 291, "brand": "BH Cosmetics", "product_description": "A latex-free beauty sponge.\nCreated to seamlessly blend liquids, creams and powders, the Studio Pro Beauty Sponge is the ultimate multi-tasking makeup tool. The innovative tear drop shape has been created to specifically fit and evenly cover all areas of the complexion for a flawless finish.", "price": "HK $76.50", "product_name": "Studio Pro Beauty Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BHCO0146F_1_L.jpg/f5f99d3be46e105c16501f09dd78e746/BHCO0146F_1_L.jpg", "product_url": "http://beautybay.com/accessories/bhcosmetics/studioprobeautysponge/"},
{"colour": "Black – HK $104.80,\nTurquoise – HK $104.80", "id": 292, "brand": "NuMe", "product_description": "A caring hair towel created to reduce the damage caused when drying.\nUsing a conventional towel to dry your hair can cause breakages and frizz without you being aware, that's why NuMe have created the Microfiber Hair Wrap. Produced with a 100% microfiber material in a hooded design, the wrap helps to absorb excess moisture whilst preventing frizz leaving hair looking and feeling healthier.", "price": "HK $104.80", "product_name": "Microfiber Hair Wrap", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME-numemicrofiberhairwrap_1_GL.jpg/c5d02aa9f325a1c34f0974412b6dcdee/numemicrofiberhairwrap_1_GL.jpg", "product_url": "http://beautybay.com/haircare/nume/microfiberhairwrap/"},
{"colour": "", "id": 293, "brand": "Unicorn Lashes ", "product_description": "Add a natural curl and soft volume to some of your favourite makeup looks with these super subtle false lashes.\nCrafted with only the finest mink hair and a super-durable band, the 3D Mink Lashes Vespertine can be used to complete even the most glamourous of looks. Shorter than most but still full of sultry volume, these super wispie lashes are a must-have for any lash-lover.", "price": "HK $244.30", "product_name": "3D Mink Lashes Vespertine", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0006F_1_L.jpg/cdd80f8e9af51444555735924bad5182/UNLA0006F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dminklashesvespertine/"},
{"colour": "", "id": 294, "brand": "Z Palette", "product_description": "An extra-large, bright and bold customisable palette.\nPout Neon Pop Collection Extra Large Magnetic Palette has a vibrant lip print pattern. Designed to store individual make up pans, the palette can be customised daily depending on where you choose to take it. Fill with all your favourite eyeshadows and de-pot your powders and lip colours for optimal organisation.", "price": "HK $234.30", "product_name": "Pout Neon Pop Collection Extra Large Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0043F_1_L.jpg/b1398def97c6840c3ce3795abb080784/ZPAL0043F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/poutneonpopcollectionextralargemagneticpalette/"},
{"colour": "", "id": 295, "brand": "Ardell", "product_description": "Designed with a convenient self-adhesive band Press On Lashes Wispies Black achieve fluttery, whimsical lashes which are applied with ease. Attached to a disposable tool for precise application, the lightweight falsies give lasting and comfortable wear, soon becoming a lash lover's best friend.", "price": "HK $58.80", "product_name": "Press On Lashes Wispies", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE8024F_1_L.jpg/df552195af879fab9816c191799b2982/ARDE8024F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/pressonlasheswispies/black"},
{"colour": "", "id": 296, "brand": "BH Cosmetics", "product_description": "An adjustable makeup belt.\nWith a variety of pouches and pockets to fit all your tools and brushes, the Pro Artist Brush Belt is ideal for working makeup artists. The wipeable apron design allows for convenient access to tools when on the job whilst the adjustable waist allows for easy and comfortable wear.", "price": "HK $114.80", "product_name": "Pro Artist Brush Belt", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BHCO0149F_1_L.JPG/6bddcec5ce1c077eb38d0b2e815c9066/BHCO0149F_1_L.JPG", "product_url": "http://beautybay.com/accessories/bhcosmetics/proartistbrushbelt/"},
{"colour": "", "id": 297, "brand": "Lilly Lashes", "product_description": "Be the envy of everyone at the party with these flirty falsies.\nDesigned with super wispie mink hairs, the Lush Luxury Mink Lashes are ideal for adding a volumised touch of glamour to your look. The super lightweight lashes sit seamlessly along the lash-line for stay all day comfortable wear.", "price": "HK $212.60", "product_name": "Lush Luxury Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0011F_1_L.jpg/15197e7b1c21bbb5bb4ff35037f99127/LILL0011F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/lushluxuryminklashes/"},
{"colour": "", "id": 298, "brand": "Ardell", "product_description": "Ideal for the individual lash wearer, Lashfree Remover works to gently dissolve the adhesive attaching the fibres to the lash-line for safe and easy removal.", "price": "HK $35.70", "product_name": "Lashfree Remover", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE8036F_1_L.jpg/7179db141250da11a7cefa85204fcc7b/ARDE8036F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/lashfreeremover/black"},
{"colour": "", "id": 299, "brand": "Nails Inc", "product_description": "Music and makeup: what could be better? Designed with a unique spin on MC Hammer's famous 'Stop Hammer Time' lyric, Stop! Glamour Time Slogan Cosmetic Bag is the perfect mix between the two worlds. Created using premium quality canvas and stylish gold embellishments you can be safe in the knowledge that your nail polishes are travelling in style.", "price": "HK $113.10", "product_name": "Stop! Glamour Time Slogan Cosmetic Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NAIN0672F_1_L.jpg/df78fade0186483e5e25dea6f650c2a3/NAIN0672F_1_L.jpg", "product_url": "http://beautybay.com/accessories/nailsinc/stopglamourtimeslogancosmeticbag/"},
{"colour": "", "id": 300, "brand": "Ardell", "product_description": "Ardell Natural Lashes Beauties are natural looking false lashes which add gorgeous length and definition.\nComplete with an invisible band that connects the hair strands to form a strip, Natural Lashes Beauties are knotted and feathered by hand for perfect uniformity and a natural look. Natural Lashes Beauties are made of premium quality 100% human hair which provides just the right length and volume and are perfect for accentuating your natural lash flutter.", "price": "HK $44.70", "product_name": "Natural Lashes Beauties", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE0009F_1_L.jpg/87b6cd7893e89a94721958d932c2018f/ARDE0009F_1_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/naturallashesbeauties/black"},
{"colour": "", "id": 301, "brand": "My Kit Co.", "product_description": "A magnetic palette for cream products.\nWith 16 compartments, My Magnetic Cream Palette stores a selection of your favourite products. Save space in your kit and travel bag by de-potting small amounts of products in to the plastic tray provided and magnetically popping it in to the palette.", "price": "HK $89.30", "product_name": "My Magnetic Cream Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0025F_1_L.jpg/f1e1d713eceec7936ecb933a4849ef27/MYKI0025F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mymagneticcreampalette/"},
{"colour": "", "id": 302, "brand": "Anna Sui", "product_description": "A super-soft powder puff.\nCreated to apply face powder evenly to the complexion, the Anna Sui Puff is the perfect partner for your pressed and loose finishing powders. Complete with a fabric band for complete control, this classic powder applicator sets foundation on the go for a fresh, matte finish.", "price": "HK $63.30", "product_name": "Puff", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANSU0353F_1_L.jpg/f1d0fdf64711826c3286993ff4339b88/ANSU0353F_1_L.jpg", "product_url": "http://beautybay.com/accessories/annasui/puff/"},
{"colour": "", "id": 303, "brand": "Violet Voss", "product_description": "A silicone-based makeup applicator.\nCrafted from a super-smooth silicone, the Perfect Weapon Applicator guarantees a flawless, full coverage finish with zero product wastage. Specifically designed to apply and blend makeup just like your favourite sponges and brushes, but without absorbing any of your makeup, this innovative applicator is a real game changer.  With no need to dampen, this silicone sponge can be used instantly with powder, cream and liquid makeup, for a seamless finish with minimal effort.", "price": "HK $47.90", "product_name": "Perfect Weapon Applicator", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0081F_1_L.jpg/2a3f830c1c7aaa652677d2e84ca858b2/VIVO0081F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/perfectweaponapplicator/"},
{"colour": "", "id": 304, "brand": "Velour Lashes", "product_description": "Velour Lashes #WINGing are beautifully flared Mink false lashes.\nLooking for a doll like flutter but with a little bit extra flare? #WINGing are the falsies for you! With a doll like effect, #WINGing will give you length and dramatic impact with a long short graduated pattern and more Mink Fur concentrated at the longer sections and towards the outer corner of the eyes.\nReusable for up to 25 times, #WINGing are suitable for all eye shapes, are easy to apply and have been beautifully handcrafted from 100% genuine Mink Hair ethically sourced from free range zoos.", "price": "HK $244.40", "product_name": "WINGing", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0017F_1_L.jpg/d882394c8b1b7d8e1378ce16082037ff/VELA0017F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/winging/"},
{"colour": "", "id": 305, "brand": "Ardell", "product_description": "Ardell Natural Lashes Demi Whispies are premium false lashes which create an elegant and voluminous lash look.\nComplete with an invisible band that connects the hair strands to form a strip, Natural Lashes Demi Whispies are knotted and feathered by hand for perfect uniformity and a natural look. Natural Lashes Demi Whispies Lashes are made of superior quality 100% human hair and provide just the right length for a glamorous flutter.", "price": "HK $44.70", "product_name": "Natural Lashes Demi Wispies Black", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARDE0011F_2_L.jpg/411c04a099522f9c4d13344a45af6a8c/ARDE0011F_2_L.jpg", "product_url": "http://beautybay.com/accessories/ardell/naturallashesdemiwispiesblack/"},
{"colour": "", "id": 306, "brand": "Unicorn Lashes ", "product_description": "Add voluminous definition and enviable depth to any look with these lightweight lashes.\nCrafted with fibres of super fine synthetic silk, the 3D Silk Lashes Unicorn Flutter are a must-have addition to any lash-lover's collection. The unique clustered, 'v' shaped design allows you to add just the right amount of depth and volume along the lash-line for a mysterious finish to your eye looks.", "price": "HK $106.20", "product_name": "3D Silk Lashes Unicorn Flutter", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0017F_1_L.jpg/003e166f676eb390a2d5b26cda374f29/UNLA0017F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dsilklashesunicornflutter/"},
{"colour": "", "id": 307, "brand": "St.Tropez", "product_description": "St.Tropez Applicator Mitt is a dual sided mitt perfect for applying St.Tropez Self Tan Mousses and Lotions.\nFeaturing a water resistant barrier to ensure your fingers remain unstained this high-performance Applicator Mitt gives even and smooth results.\nSelf-tan is applied flawlessly without streaks or patchiness.", "price": "HK $25.50", "product_name": "Applicator Mitt", "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0046F_1_L.jpg/77353c20c318a1f99726221adb4914a7/STTR0046F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sttropez/applicatormitt/"},
{"colour": "", "id": 308, "brand": "Unicorn Lashes ", "product_description": "Delicate and elegant, this set of falsies are perfect for day to day wear\nUltra-feminine and fluttery, the Mink Lashes Luna Fleur are staple additions to any collection. Produced with a lightweight durable band and a criss-cross arrangement of mink hair, these lashes feel and look effortlessly glamourous.", "price": "HK $212.50", "product_name": "Mink Lashes Luna Fleur", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0009F_1_L.jpg/70d40498ebf4cf19724287b608080a57/UNLA0009F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minklasheslunafleur/"},
{"colour": "", "id": 309, "brand": "Sigma Beauty", "product_description": "A convenient hand held brush mat for hands on deep cleaning of your favourite tools.\nCreated with seven uniquely developed textures, the Sigma Spa Express Brush Cleaning Glove allows you to achieve varying levels of cleanliness depending on the combination used for both face and eye brushes. Complete with a convenient universally fitting thumb and wrist strap, the cleaning matt is going to become your much loved cleaning companion for a vigorous cleanse.", "price": "HK $217.90", "product_name": "Spa Express Brush Cleaning Glove", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0098F_1_L.jpg/7a56028f5bfcc41183fba3615c7dac73/SIGM0098F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/spaexpressbrushcleaningglove/"},
{"colour": "", "id": 310, "brand": "My Kit Co.", "product_description": "A synthetic pair of dramatic false eyelashes.\nDelicately fanned, My Downtown Disco Lashes add dimension and volume. Building towards the outer corners, the flicked lashes create enviable curl that can be worn alone or to accessorise bold makeup looks.", "price": "HK $170.00", "product_name": "My Downtown Disco Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0070F_1_L.jpg/56284522044aa47fa9aadea07d56f802/MYKI0070F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/mydowntowndiscolashes/"},
{"colour": "", "id": 311, "brand": "Z Palette", "product_description": "A medium, bright and bold customisable palette.\nWith sharp geometric patterns, Geo Neon Pop Collection Medium Magnetic Palette stylishly stores individual makeup pans. Compact and travel sized, de-pot and carry powders, highlighters and lipsticks to match your mood.", "price": "HK $167.40", "product_name": "Geo Neon Pop Collection Medium Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0044F_1_L.jpg/c07ccf4f91a28166ae21f9eb80f3c193/ZPAL0044F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/geoneonpopcollectionmediummagneticpalette/"},
{"colour": "", "id": 312, "brand": "This Works", "product_description": "This Works Deep Sleep Pillow Spray is a calming room spray designed to help induce a deep, restful sleep.\nInfused with Essential Oils of Lavender, Vetivert and Wild Chamomile, Deep Sleep Pillow Spray helps you to wind down after a hectic day by soothing the body and mind. This best-selling, natural sleep aid fragrances the room whilst calming your nerves and will become your must-have sleep solution.\nThe best beauty secret there is, Deep Sleep Pillow Spray has a highly effective formula which encourages a natural deep sleep so that you wake looking and feeling fantastic.", "price": "HK $214.20", "product_name": "Deep Sleep Pillow Spray 75ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0072F_1_L.jpg/8194622e1c11f3d809de37739828ae96/THWO0072F_1_L.jpg", "product_url": "http://beautybay.com/accessories/thisworks/deepsleeppillowspray/"},
{"colour": "", "id": 313, "brand": "Tweezerman", "product_description": "Tweezerman No Slip Skincare Tool masterfully removes unwanted blackheads and whiteheads from the complexion, leaving the skin fresh and clear.\nFeaturing an anti-slip grip on the handle, No Slip Skincare Tool efficiently yet gently removes unsightly and non-desirable blemishes and imperfections from the skin, resulting in a clearer, healthier finish that will leave everybody in awe, especially yourself!\nCombining a thin, angular end to eradicate matured breakouts and a flat side to press out annoying blackheads, this beauty necessity works tirelessly to cleanse the skin of its flaws without damaging the surrounding skin.\nRemain impeccable with No Slip Skincare Tool.", "price": "HK $126.20", "product_name": "No Slip Skincare Tool", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0223U_1_L.jpg/e3a0d41a38b76a6b6197674d4580a2f7/TWEE0223U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/noslipskincaretool/"},
{"colour": "", "id": 314, "brand": "Sigma Beauty", "product_description": "The chore of brush cleaning has finally been given a long awaited make over.\nSigma Spa Express Brush Cleaning Mat sits snugly into most sinks boasting 32x smaller size than the original Sigma Brush Cleaning Mat for an ultra-convenient cleaning experience. Designed with seven different textured surfaces in order to deep clean varying types of brushes, the mat is sure to become the only brush cleaning companion you rely on.", "price": "HK $217.90", "product_name": "Spa Express Brush Cleaning Mat", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0096F_1_L.jpg/cd4f4aad02fd1ded1be8da76f7e69a37/SIGM0096F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/spaexpressbrushcleaningmat/"},
{"colour": "", "id": 315, "brand": "OPV Beauty", "product_description": "A large empty palette.\nAllowing maximum creative freedom, Large Empty Magnetic Palette creates the ultimate customised palette. Holding up to 15 individual pans, magnetically attach separate and de-potted products to store and carry your favourite shadows, highlighters and blushers.", "price": "HK $180.70", "product_name": "Large Empty Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/OPVB0067F_1_L.jpg/a38370f4aab86537e1ef2ccbf8740c68/OPVB0067F_1_L.jpg", "product_url": "http://beautybay.com/accessories/opvbeauty/largeemptymagneticpalette/"},
{"colour": "", "id": 316, "brand": "Lilly Lashes", "product_description": "A bold set of lashes created to add depth and dimension to your eye looks.\nDesigned by Britanny Bear to complement her super-sultry eye looks, the Brittany Bear 3D Mink Lashes are an eye-catching essential. The uber glamourous lashes boast a number of 'v' shaped clusters along a true black band allowing you to achieve voluminous depth and enviable length.", "price": "HK $223.20", "product_name": "Brittany Bear 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0030F_1_L.jpg/fb33ac9ed55ff687baaab6f6958fdaca/LILL0030F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/brittanybear3dminklashes/"},
{"colour": "", "id": 317, "brand": "Violet Voss", "product_description": "A set of false lashes that accentuate the eyes and provide a natural flutter with ease. Simple and mess-free to apply, Eye Donut Care Limited Edition Lashes are lightweight and gentle to the skin. This pair is perfect for adding subtle volume with a natural finish.", "price": "HK $100.40", "product_name": "Eye Donut Care Limited Edition Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0049F_1_L.jpg/80ab94d61ba22bb083fd3e039c3b50ab/VIVO0049F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/eyedonutcarelimitededitionlashes/"},
{"colour": "", "id": 318, "brand": "Violet Voss", "product_description": "A pair of volumising false lashes that accentuate the natural strands whilst adding definition. Combining the texture of real mink fur with synthetic technology, Unicorn Flare Premium Lashes remains lightweight and durable for the duration of wear.", "price": "HK $100.40", "product_name": "Unicorn Flare Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0046F_1_L.jpg/4a05f86a57ebd5e51c5f0a0196f5671e/VIVO0046F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/unicornflarepremiumlashes/"},
{"colour": "", "id": 319, "brand": "My Kit Co.", "product_description": "A pack of five blending puffs.\nWith an innovative finger-sock design, My Velour Puffs offer even easier base make-up application. For smooth, even coverage use your finger to apply and blend around the larger and smaller areas of the face.", "price": "HK $46.80", "product_name": "My Velour Puffs", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0013F_1_L.jpg/b5f517d9206ec77474a09dedf80c2215/MYKI0013F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myvelourpuffs/"},
{"colour": "", "id": 320, "brand": "BH Cosmetics", "product_description": "A deep cleansing brush cleaner.\nWith both disinfecting and conditioning actions, the Studio Pro Makeup Brush Cleaner is ideal for use with all your favourite tools. The lightweight formula works quickly to remove makeup residue deep within the bristles for a new brush feel with every use.", "price": "HK $114.80", "product_name": "Studio Pro Makeup Brush Cleaner 100ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/BHCO0143F_1_L.jpg/9f09a3cb3ad595032806b3ba0f7f7228/BHCO0143F_1_L.jpg", "product_url": "http://beautybay.com/accessories/bhcosmetics/studiopromakeupbrushcleaner/"},
{"colour": "", "id": 321, "brand": "Lilly Lashes", "product_description": "Definitely the lash of choice for those who want to take your eye look to the next level.\nOne of the fullest lashes Lilly Lashes has created, the Carmel 3D Mink Lashes are a party look must-have. Designed with length that gradually increases from the inner to outer corner, the ultra-black lashes are perfect for adding a sultry flourish to any look.", "price": "HK $318.80", "product_name": "Carmel 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0027F_1_L.jpg/e01ac1efe229e2c3270e5f420526d73a/LILL0027F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/carmel3dminklashes/"},
{"colour": "", "id": 322, "brand": "Violet Voss", "product_description": "Violet Voss Wispy My Name Premium Faux Mink Lashes naturally enhance the existing lashes for a dramatic statement whilst maintaining a subtle finish.\nWispy My Name Premium Faux Mink Lashes are the perfect beauty accessory for adding a touch of after dark drama or daytime chicness to your makeup look. Featuring a fine crisscross effect, Wispy My Name Premium Faux Mink Lashes are the ideal choice for adding a touch of natural looking volume and length to your lashes and are easy to apply.\nFlutter those bad boys with Wispy My Name Premium Faux Mink Lashes from the beauty experts at Violet Voss.", "price": "HK $100.40", "product_name": "Wispy My Name Premium Faux Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VIVO0044F_1_L.jpg/433de8672fc5708c1104fe2184814230/VIVO0044F_1_L.jpg", "product_url": "http://beautybay.com/accessories/violetvoss/wispymynamepremiumfauxminklashes/"},
{"colour": "", "id": 323, "brand": "iWhite", "product_description": "iWhite Instant Whitening Mouthwash is a daily use mouthwash which actively helps to whiten the teeth.\nBoasting a triple action formula enriched with Blue Covarine, Instant Whitening Mouthwash immediately gives the appearance of whiter teeth with just one use. Designed to remove and prevent plaque formation, Instant Whitening Mouthwash promotes a brighter, whiter smile.\nClinically proven, safe and effective, Instant Whitening Mouthwash dissolves tooth discolouration without damaging the teeth or gums whilst the Fluoride infused formula helps to strengthen the teeth.\nSuitable for twice daily use, Instant Whitening Mouthwash offers active stain removal and whitening benefits and leaves the teeth up to 8 shades whiter.", "price": "HK $84.50", "product_name": "Instant Whitening Mouthwash 500ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/IWHT0003U_1_L.jpg/487268d35165a283950fba9b67bf7c01/IWHT0003U_1_L.jpg", "product_url": "http://beautybay.com/accessories/iwhite/instantwhiteningmouthwash/"},
{"colour": "", "id": 324, "brand": "Sigma Beauty", "product_description": "A deep cleansing brush cleaner.\nFormulated to keep your best-loved tools in optimum condition, the SigMagic Brushampoo is a brush maintenance must-have. This innovative formula utilises three natural ingredients which work in synergy to remove dirt and grime allowing your brushes to work to their maximum potential.", "price": "HK $154.20", "product_name": "SigMagic Brushampoo 150ml", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0179F_1_L.jpg/1898a056b6a834377d24a40be1dbc15d/SIGM0179F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/sigmagicbrushampoo/"},
{"colour": "", "id": 325, "brand": "Anna Sui", "product_description": "Anna Sui Oil Control Paper Refill is a set of purple blotting papers to keep shine and oil at bay.\nEffectively absorbing excess oil and dirt to reveal fresh and flawless skin, Oil Control Paper Refill is a refill for the Anna Sui Oil Control Paper and Case (sold separately) and is a discreet way to keep the complexion looking matte and chic.\nPerfect for use before or after makeup application, this must-have beauty tool lifts dirt, oil and impurities from the skin to keep your complexion looking marvellously matte in even the most humid weather and helps to beat the heat and maintain a smooth, shine-free complexion all day long.", "price": "HK $31.60", "product_name": "Oil Control Paper Refill", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANSU0131F_2_L.jpg/6ad4bb6148fe5eabe12da6a688ed33b3/ANSU0131F_2_L.jpg", "product_url": "http://beautybay.com/accessories/annasui/oilcontrolpaperrefill/"},
{"colour": "", "id": 326, "brand": "Tweezerman", "product_description": "A large eyelash curler.\nWith protective silicone pads, Super Curl Eyelash Curler safely and gently curls the eyelashes. Providing instant and long-lasting results, the extra-large surface curls every inch and can be warmed for bigger, better results.", "price": "HK $126.20", "product_name": "Super Curl Eyelash Curler", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0242U_1_L.jpg/f18b0482aaf6f60e249d3ec896c1115e/TWEE0242U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/supercurleyelashcurler/"},
{"colour": "", "id": 327, "brand": "Morphe", "product_description": "A selection of short individual lash clusters.\nDesigned to be the must-have for all your lash needs no matter what the occasion calls for, ML Flare Short Premium Lashes are sure to be your go to. The cleverly compiled short fibred clusters add small bursts of volume and definition, offering you the opportunity to use as many or as few as you need in order to achieve your lash goals.", "price": "HK $41.20", "product_name": "ML Flare Short Premium Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOBR0612F_1_L.jpg/db5276a1056bff94e78795a05f6269ba/MOBR0612F_1_L.jpg", "product_url": "http://beautybay.com/accessories/morphe/mlflareshortpremiumlashes/"},
{"colour": "", "id": 328, "brand": "Unicorn Lashes ", "product_description": "The perfect false lashes to add enviable length to your lashes whilst keeping it looking au naturel.\nAdding eye opening lash length with a soft and wispie design, the Mink Lashes Aurora Queen will definitely become your go-to falsies for daily wear. Created with whimsically long mink hairs and a durable black band, these lashes can be relied upon for your daily dose of eye-catching drama.", "price": "HK $191.20", "product_name": "Mink Lashes Aurora Queen", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0012F_1_L.jpg/def21063f96fdca9544098bf3b2649f8/UNLA0012F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minklashesauroraqueen/"},
{"colour": "", "id": 329, "brand": "Paul & Joe", "product_description": "Paul & Joe Cat Cosmetic Pouch is a cute and fashionable storage solution for all your makeup essentials.\nCombining great looks and fantastic functionality, Cat Cosmetic Pouch s a vanity model of the ever popular Paul & Joe cosmetic pouch and has room for even more items and additional carrying convenience.\nThe top section has slim compartments for storing brushes and pencils, along with transparent pockets. In the vanity section, there is a small pocket on the side where you can store your Paul & Joe cosmetics in an easy and practical way. The zip fastening ensures all your makeup is kept safe and secure during transit.\nThe playful cat motif is selected from a Paul & Joe Fashion original print and is a favourite of designer Sophie Albou. Just carrying this chic pouch is so exciting you’ll instinctively want to show it off.", "price": "HK $185.20", "product_name": "Cat Cosmetic Pouch", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC0657F_1_L.jpg/5698a441cbb8b81cc9528abbc046cdc9/PAJC0657F_1_L.jpg", "product_url": "http://beautybay.com/accessories/pauljoe/catcosmeticpouch/"},
{"colour": "", "id": 330, "brand": "Paul & Joe", "product_description": "Paul & Joe Brush Holder is the ideal storage solution for all your makeup brushes and tools.\nStore your makeup brushes and accessories with style and sophistication with this delightful Brush Holder. Expertly designed with Paul & Joe’s signature chrysanthemum motif, Brush Holder has a retro modern look that will add a touch of joy and happiness to your dressing table.", "price": "HK $131.00", "product_name": "Brush Holder", "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC0436F_1_L.jpg/3c3e2f614a9427db9b87dd0aab132b54/PAJC0436F_1_L.jpg", "product_url": "http://beautybay.com/accessories/pauljoe/brushholder/"},
{"colour": "", "id": 331, "brand": "Unicorn Lashes ", "product_description": "A criss-cross style set of falsies harbouring volume and length in all the right places.\nCreated for those of you who struggle with hooded eyes, the 3D Silk Lashes Buttercup are the perfect falsies for created a wide-eyed finish. The super-fine, synthetic silk fibres have been expertly placed in a unique criss-cross pattern that varies in length to provide the perfect amount of stylish volume and enviable length.", "price": "HK $212.50", "product_name": "3D Silk Lashes Buttercup", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0021F_1_L.jpg/3955be501bc6af8b38c3e229e6611e2c/UNLA0021F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/3dsilklashesbuttercup/"},
{"colour": "", "id": 332, "brand": "Sigma Beauty", "product_description": "Flat, funnily shaped brushes be gone with tower that ensures dry, perfectly shaped brushes every time.\nSigma Dry'N Shape Tower Face And Eyes makes the step after cleaning your brushes that much more enjoyable. By simply clipping your wet brushes into the specially created compartments with the bristles placed in the shaping bands, the drying apparatus keeps your tools looking the same as the day you're brought them.", "price": "HK $494.20", "product_name": "Dry'N Shape Tower Face And Eyes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SIGM0100F_1_L.jpg/23ddfc2465c337312fac59d86f808b22/SIGM0100F_1_L.jpg", "product_url": "http://beautybay.com/accessories/sigmabeauty/drynshapetowerfaceandeyes/"},
{"colour": "", "id": 333, "brand": "Spectrum", "product_description": "A latex-free makeup sponge for the seamless application of cream, powder or liquid-based products. Easy to clean and effortless to control, Wonder Sponge glides smoothly across the skin, imparting the desired amount of product without creating streaks, patches or unevenness.", "price": "HK $47.80", "product_name": "Lilac Unicorn Tears Wonder Sponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/SPEC0038F_1_L.jpg/2b8b69a6cc63d1448f05256285ac31fb/SPEC0038F_1_L.jpg", "product_url": "http://beautybay.com/accessories/spectrum/lilacunicorntearswondersponge/lilac"},
{"colour": "", "id": 334, "brand": "Z Palette", "product_description": "A large, bright and bold customisable palette.\nDecorated in a rainbow of colours, Rose Neon Pop Collection Large Magnetic Palette is covered with seasonal roses. Fill the large, magnetic palette with singular eyeshadows, blushers and lip colours for a travel friendly palette that's completely unique.", "price": "HK $190.80", "product_name": "Rose Neon Pop Collection Large Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0042F_1_L.jpg/fdf2d9aecd603e21c249de50c06844b4/ZPAL0042F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/roseneonpopcollectionlargemagneticpalette/"},
{"colour": "", "id": 335, "brand": "Eyeko", "product_description": "Eyeko Black Magic Lash Curler is a black velvet eyelash curler to ensure the lashes are always beautifully curled.\nThe ergonomic handles on this expertly crafted tool are finished with soft-to-touch velvet which provides the perfect amount of pressure, control and precision to lift your lashes ready for mascara application. The enhanced design features silicone based grips to ensure a comfortable experience with the optimum curl each and every time.\nSet to be a Beauty Bay best-seller, Black Magic Lash Curler lifts the lashes for a wide open eye look.", "price": "HK $99.50", "product_name": "Black Magic Lash Curler", "image_url": "http://images.contentful.com/eoaaqxyywn6o/EYEK0044F_1_L.jpg/d631bb4c8ea31a1193c4af8a4f418d9c/EYEK0044F_1_L.jpg", "product_url": "http://beautybay.com/accessories/eyeko/blackmagiclashcurler/"},
{"colour": "", "id": 336, "brand": "Unicorn Lashes ", "product_description": "Offering length and curl, these falsies leave any eye look with a statement finish.\nDeveloped to offer that added oomph to your favourite looks, the Mink Lashes Aquarelle are ideal for both day and night wear. Lovingly crafted with ultra-long, softly curled mink hairs and a thin, durable black band these lashes are effortlessly eye-catching.", "price": "HK $191.20", "product_name": "Mink Lashes Aquarelle", "image_url": "http://images.contentful.com/eoaaqxyywn6o/UNLA0013F_1_L.jpg/ead4b52d04f12c6a517e8afbffa86ce1/UNLA0013F_1_L.jpg", "product_url": "http://beautybay.com/accessories/unicornlashes/minklashesaquarelle/"},
{"colour": "", "id": 337, "brand": "Tweezerman", "product_description": "A pair of thin, pointed tweezers.\nOffering near surgical precision, Classic Stainless Steel Ingrown Hair Splintertweeze removes objects embedded under the skin. Perfect for ingrown hairs, the hand-filed, tapered points reach deep within the skin to capture and remove with incredible accuracy.", "price": "HK $171.70", "product_name": "Classic Stainless Steel Ingrown Hair Splintertweeze", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0240U_1_L.jpg/92fce1ecd232ba6709157d5d8d109eb7/TWEE0240U_1_L.jpg", "product_url": "http://beautybay.com/accessories/tweezerman/classicstainlesssteelingrownhairsplintertweeze/"},
{"colour": "", "id": 338, "brand": "My Kit Co.", "product_description": "A pack of 50 mini cotton buds.\nThe ultimate corrector tool, My Mini 'On Point' Buds remove all traces of smudged makeup. With a micro-fine tip, neatly wipe away stray flicks and smudged lipstick to create a neat and tidy edge with ultimate precision.", "price": "HK $29.80", "product_name": "My Mini 'On Point' Buds", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0001F_1_L.jpg/58eb2cb09a9698ea4fad947f7d578d62/MYKI0001F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myminionpointbuds/"},
{"colour": "", "id": 339, "brand": "Lilly Lashes", "product_description": "Volumising false lashes.\nFor deep set eyes, So Extra Mykonos 3D Mink Lashes add extreme length, volume and definition. With unique 'V' shaped clusters, they thicken the lash line whilst creating soft, subtle and wispy ends.", "price": "HK $318.80", "product_name": "So Extra Mykonos 3D Mink Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LILL0044F_1_L.jpg/993a1546ee0aa67d2dcb4fe0bf01d245/LILL0044F_1_L.jpg", "product_url": "http://beautybay.com/accessories/lillylashes/soextramykonos3dminklashes/"},
{"colour": "", "id": 340, "brand": "Mr. Bright", "product_description": "A convenient teeth whitening pen.\nFast and effective, Mr Bright's Teeth Whitening Pen takes only 30 seconds. Lasting for up to 4-6 weeks with daily application, the pen is travel friendly and great for hard to reach areas. Made with all natural ingredients, lighten teeth by up to seven shades quickly and safely.", "price": "HK $131.70", "product_name": "Teeth Whitening Pen", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MRBR0003U_1_L.jpg/5f1eeeb029407f34d88a4a0aa480b547/MRBR0003U_1_L.jpg", "product_url": "http://beautybay.com/accessories/mrbright/teethwhiteningpen/"},
{"colour": "", "id": 341, "brand": "Molly Cosmetics", "product_description": "An effective makeup applicator.\nBlending cream and liquid products over larger areas of the face, Midnight Chic SiliSponge creates an even and seamless base. Made with non-absorbent materials, apply 100% of product with no wastage and an easy clean surface.", "price": "HK $85.80", "product_name": "Midnight Chic SiliSponge", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MOCO0004F_1_L.jpg/c5b53308ecdf2ca4de1c6b690693adc0/MOCO0004F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mollycosmetics/midnightchicsilisponge/"},
{"colour": "", "id": 342, "brand": "My Kit Co.", "product_description": "A synthetic pair of feathered eyelashes.\nMulti-dimensional, My Featherette Lashes combine fibres of different lengths for a choppy, full flutter. Winged towards the outer corner, the layered lashes sit on a clear, flexible band for a comfortable, seamless and feminine finish.", "price": "HK $170.00", "product_name": "My Featherette Lashes", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MYKI0071F_1_L.jpg/0256969a887dfe3a6d68ced7754561f2/MYKI0071F_1_L.jpg", "product_url": "http://beautybay.com/accessories/mykitco/myfeatherettelashes/"},
{"colour": "", "id": 343, "brand": "Crimes Of Beauty", "product_description": "A statement cosmetic bag.\nBlack and white, Flawless AF Small Canvas Makeup Bag keeps all your makeup essentials safe and secure. Fitting perfectly into your handbag, the lightweight material and zip fastening makes it easy to carry.", "price": "HK $101.00", "product_name": "Flawless AF Small Canvas Makeup Bag", "image_url": "http://images.contentful.com/eoaaqxyywn6o/CROB0001F_1_L.jpg/95668ffc763eabd57647a5789af38bc6/CROB0001F_1_L.jpg", "product_url": "http://beautybay.com/accessories/crimesofbeauty/flawlessafsmallcanvasmakeupbag/"},
{"colour": "", "id": 344, "brand": "Velour Lashes", "product_description": "Velour Lashes Velour Lash Stick is a high performance lash glue in an easy to use pen applicator.\nThis patent pending lash glue has a twist pen dispenser which reduces wastage whilst the pointed tip offers precise application with less mess. Velour Lash Stick has an innovative formula which can be applied to the lashes straight away, no need to wait for the glue to go tacky like traditional lash glue, just apply and go!\nSpecially formulated for use with Mink lashes, Velour Lash Stick is available in various shades to match any makeup look and is easy to remove without damaging your Velour Lashes or natural lashes.", "price": "HK $85.00", "product_name": "Velour Lash Stick Black", "image_url": "http://images.contentful.com/eoaaqxyywn6o/VELA0019F_1_L.jpg/26d7697ca9ef0e247f5133ec22c643dc/VELA0019F_1_L.jpg", "product_url": "http://beautybay.com/accessories/velourlashes/velourlashstickblack/black"},
{"colour": "", "id": 345, "brand": "Z Palette", "product_description": "An extra-large customisable palette.\nWith a textured, woodgrain detail, Golden Grain Extra Large Magnetic Palette holds and displays your choice of makeup. With a golden, glittered foil, stylishly keep and carry individual pans of eyeshadow, blusher and highlighter.", "price": "HK $234.30", "product_name": "Golden Grain Extra Large Magnetic Palette", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZPAL0041F_1_L.jpg/373b861da0fa4c2da5c484901dff45c0/ZPAL0041F_1_L.jpg", "product_url": "http://beautybay.com/accessories/zpalette/goldengrainextralargemagneticpalette/"}
]