[
{"price": "HK $141.00", "id": 1, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0198U_1_L.jpg/216f43f1d3475c46e000b6c418c5f68d/THWO0198U_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/babysleepalloverwash/", "product_description": "This Works Baby Sleep All Over Wash is a Sulphate free body cleanser specially formulated for babies and children.\nCreate a peaceful bedtime ritual for your little ones with this gentle hair and body wash which has been specially formulated to relax and soothe babies and children. Blended with This Works' signature blend of Lavender, Vetivert and Chamomile, Baby Sleep All Over Wash helps to bring peace and calmness for you and your baby.\nFree from Parabens, Sulphates and Phthalates, Baby Sleep All Over Wash hydrates delicate baby skin and hair and prevents dryness and irritation whilst cleansing and rebalancing and helping your baby to sleep peacefully.", "product_name": "Baby Sleep All Over Wash 110ml", "brand": "This Works"},
{"price": "HK $52.90", "id": 2, "image_url": "http://images.contentful.com/eoaaqxyywn6o/KOCO0004F_1_L.jpg/de1b85a1f85161e0cdf7c986de7f4ff4/KOCO0004F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/kocostar/footmoisturepack/", "product_description": "A moisture replenishing foot mask for soft feet.\nSimple, yet effective, the Foot Moisture Pack is an innovative mask treatment for dry, over-worked feet. Two foot shaped pockets are loaded with an ultra-hydrating serum, which deeply penetrates the skin over the course of the treatment. Smoothing away dry, rough patches it leaves heels, feet and toes perfectly smooth and glowing with health.", "product_name": "Foot Moisture Pack", "brand": "Kocostar"},
{"price": "HK $401.50", "id": 3, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0187F_1_L.jpg/2fc0d18b8293f39e2f2aab2d38d3558d/JURL0187F_1_L.jpg", "colour": "Calendula Redness Rescue Soothing Moisturising Cream 100ml – HK $401.50", "product_url": "http://beautybay.com/bathandbody/jurlique/calendularednessrescuesoothingmoisturisingcream/", "product_description": "Jurlique Calendula Redness Rescue Soothing Moisturising Cream is a high performance moisturiser which soothes, comforts and hydrates delicate skin types.\nEnriched with an Organic Comfort Complex which harmonises sensitive skin with a fusion of Calendula, Chamomile, Echinacea, Spilanthes and Marshmallow Extracts, Calendula Redness Rescue Soothing Moisturising Cream provides an effective defence system against environmental aggressors.\nEvening Primrose, Macadamia, Rose Hip and Avocado Oils nurture the skin with high levels of Essential Fatty Acids and provide optimal hydration to protect against moisture loss. Designed to help comfort sensitivity, Calendula Redness Rescue Soothing Moisturising Cream deeply hydrates the skin whilst preventing and soothing irritation, leaving the complexion looking balanced, restored and radiant.", "product_name": "Calendula Redness Rescue Soothing Moisturising Cream", "brand": "Jurlique"},
{"price": "HK $127.00", "id": 4, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0011F_1_L.jpg/ebf89d45671c7e940f85add007c54af1/COSH0011F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/invigoratemassageoil/", "product_description": "Como Shambhala Invigorate Massage Oil clarifies and energises the mind and body.\nEnriched with a cooling and stimulating blend of Eucalyptus and Geranium, Invigorate Massage Oil allows you to rediscover mental clarity and physical energy. A fusion of Lavender and Peppermint Essential Oils relax the senses and soothe the skin.\nA worldwide favourite in Como Shambhala Spas, Invigorate Massage Oil recreates a spa like experience at home and has an uplifting and mood enhancing effect that will clear your head and make you ready for anything.", "product_name": "Invigorate Massage Oil 50ml", "brand": "Como Shambhala"},
{"price": "HK $257.80", "id": 5, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0073F_1_L.jpg/c6cc6cd9d6ed11678b3a69104d69e7de/THWO0073F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/deepsleepbathsoak/", "product_description": "This Works Deep Sleep Bath Soak is a luxuriously relaxing bath soak.\nPerfect for pampering at the end of a long or stressful day, it harmonises the body and mind helping to promote a good night’s sleep. You are left completely relaxed and stress free, whilst skin is soft and gently fragranced.", "product_name": "Deep Sleep Bath Soak 200g", "brand": "This Works"},
{"price": "HK $116.70", "id": 6, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0111F_1_L.jpg/9fed1872b0b112158244395fd8365d35/MABA0111F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/papayabodylotion/", "product_description": "Mario Badescu Papaya Body Lotion (177ml) is a nourishing body moisturiser, suitable for all skin types.\nEnriched with alpha hydroxy acids, this lotion works to gently exfoliate skin, improving a dull and dry texture, whilst nourishing and hydrating with ingredients such a rice bran oil and shea butter. Dry flaky areas are eliminated and skin is left luminous, soft and hydrated with a fresh and fruity, light scent.", "product_name": "Papaya Body Lotion", "brand": "Mario Badescu"},
{"price": "HK $526.10", "id": 7, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0183F_2_L.jpg/70bfe2c1e56661ae2ab25236577f4e0e/THWO0183F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/skindeepgoldenelixir/", "product_description": "This Works Skin Deep Golden Elixir is a luxurious body serum which transforms and nourishes all skin types.\nFocusing on purity and quality, Skin Deep Golden Elixir is blended with the finest natural ingredients including essential Vitamins and Antioxidants. This indulgent moisturising serum is infused with tiny flakes of 99.9% pure 24 carat Gold which adhere to the upper layer of the epidermis to create a visual effect of radiance whilst improving elasticity and firmness and reducing micro-wrinkles.\nSkin Deep Golden Elixir has a lightweight, golden serum consistency which delivers potent therapeutic benefits and high performance anti-ageing properties whilst intensely moisturising all skin types.\nPerfect for even the driest of skin types, Skin Deep Golden Elixir is ideal for use after skin exposure and offers deep hydration for overly dry areas such as the knees and elbows. Vitamin A stimulates collagen and cell regeneration and firms the skin whilst Aloe Vera works harmoniously with Clary Sage to soothe and hydrate the skin.\nAntioxidant Rose and moisturising Patchouli are blended with collagen stimulating Bergamot while everything is locked into the skin by the sealant properties of Jojoba Oil. Skin Deep Golden Elixir helps the skin to regain its youthfulness and moisturises from the inside out, leaving the skin instantly beautified and restored with a visible shimmer of golden radiance.\n", "product_name": "Skin Deep Golden Elixir 120ml", "brand": "This Works"},
{"price": "HK $103.70", "id": 8, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0029F_1_L.jpg/992cd0419c3168f4517f3e3d24402ae8/MDTA0029F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/milliondollartan/mermaidmousseextremetravelset/", "product_description": "A trio of tanning essentials to achieve an exotically bronzed finish for the face and body.\nCreated to provide you with the ultimate tanning experience, the Mermaid Mousse Extreme Travel Set is a must-have collection of self-tanners and accessories for a deep, bronze glow. Featuring two tanning mousses to enhance skin colour on the face and body, alongside a facial tanning mitt, this collection works seamlessly to produce an intensely tanned finish.", "product_name": "Mermaid Mousse Extreme Travel Set 2x28ml", "brand": "Million Dollar Tan"},
{"price": "HK $137.00", "id": 9, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SCLO0006F_1_L.jpg/9fe434310a45f4953a567794e266ab62/SCLO0006F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/scrublove/coconutbodyscrubcoconutcrushoriginal/", "product_description": "A body scrub for all skin types.\nPolishing to perfection, Coconut Body Scrub Coconut Crush Original uses 100% natural ingredients to revitalise skin. With a delicate coconut scent, gently exfoliate to remove dead skin, moisturise and lightly fragrance.", "product_name": "Coconut Body Scrub Coconut Crush Original 200g", "brand": "Scrub Love"},
{"price": "HK $112.50", "id": 10, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANSU0136F_1_L.jpg/3b2a5c2c7bd6e931af698add83aa7121/ANSU0136F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/annasui/rosebodylotion/", "product_description": "Anna Sui Rose Body Lotion is a dual layer moisturiser for the body.\nSpecially formulated to firm, tone and moisturise the skin after showering, Rose Body Lotion helps to maintain healthy hydration levels whilst smoothing and softening the skin. Suitable for daily use, Rose Body Lotion has a two layer formula which creates a smoother and firmer skin appearance and leaves the skin feeling silky soft and nourished whilst enveloped in a veil of aromatic Rose scent.", "product_name": "Rose Body Lotion 250ml", "brand": "Anna Sui"},
{"price": "HK $183.30", "id": 11, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABB0008F_1_L.jpg/1c906f428b89d9ffd0509250e5905cd3/MABB0008F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mauibabe/amazingbrowninglotiontanningsalonformula/", "product_description": "A tanning solution that helps to promote a sun-kissed finish for the skin when used in conjunction with indoor sunbeds. The rich formula smooths evenly onto the skin and remains breathable and lightweight for the duration of wear. Perfect for helping to achieve a deeper tan, Amazing Browning Lotion Tanning Salon Formula is ideal for use all year round.", "product_name": "Amazing Browning Lotion Tanning Salon Formula 236ml", "brand": "Maui Babe"},
{"price": "HK $97.10", "id": 12, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0028F_1_L.jpg/221c727e4c9bb534cc5caf4df47ce52c/MDTA0028F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/cosmetics/milliondollartan/mermaidmoussetravelset/", "product_description": "The perfect travel set of tanning must-haves for creating a flawless bronzed finish.\nCompiled by the experts over at Million Dollar Tan, the Mermaid Mousse Travel Set is essential trio of products for achieving an evenly balanced face and body tan. Consisting of two mini tanning mousses one for the face and one for the body, along with a facial tanning mitt, the set contains everything you need for topping up your bronzed glow on the go.", "product_name": "Mermaid Mousse Travel Set 2x28ml", "brand": "Million Dollar Tan"},
{"price": "HK $220.10", "id": 13, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0085F_1_L.jpg/19fc1b21d12f5e1adfeea3cfee5c7001/STTR0085F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/darkbronzinglotion/", "product_description": "St.Tropez Dark Bronzing Lotion is a delectable bronzing elixir designed to deliver a deep tan seamlessly.\nCreated using a delectable fragrance which engulfs the senses subtly and seduces the mind, Dark Bronzing Lotion doesn't impart a fake tan scent to the skin, making it a certified beauty essential for any self-tanning junkie. Dark Bronzing Lotion is ideal for all skin types and is formulated to tailor itself to your skin tone to give you a richer looking, streak-free tan.\nInfused with more moisturising agents than ever before, Dark Bronzing Lotion conditions the skin whilst maintaining the bronzed effect for even longer.\nBe clever, fake it with Dark Bronzing Lotion from the tanning experts at St.Tropez.", "product_name": "Dark Bronzing Lotion 200ml", "brand": "St.Tropez"},
{"price": "HK $244.40", "id": 14, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/talu0007f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/tanluxe/thegradual/", "product_description": "A gradual tanning lotion.\nSuitable for the face and body, The Gradual is a weightless and buildable tan. Smoothing and conditioning the skin, use regularly to tone and subtly colour for enviably soft skin and a flawless, natural looking tan.", "product_name": "The GRADUAL 250ml", "brand": "TAN-LUXE"},
{"price": "HK $137.00", "id": 15, "image_url": "http://images.contentful.com/eoaaqxyywn6o/FRBO0001F_1_L.jpg/50c1873943241f46e8df725a25735331/FRBO0001F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/frankbody/frankoriginalcoffeescrub/", "product_description": "An exfoliating body scrub.\nMade with natural ingredients, Frank Original Coffee Scrub is a gentle yet effective skin treatment. To be used up to three times a week, massage over the whole body to remove small lumps and bumps whilst encouraging healthy cell renewal and enveloping skin in an orange mocha frappuccino scent.", "product_name": "Frank Original Coffee Scrub 200g", "brand": "Frank Body"},
{"price": "HK $266.30", "id": 16, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL-jurliquerosehandcream_2_gl.jpg/f1a5cbfe991105c9af11baa24cafad9a/jurliquerosehandcream_2_gl.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/rosehandcream/", "product_description": "Jurlique Rose Hand Cream is an award winning hand cream which restores smoothness and keeps hands looking youthful.\nThis rich, protective hand cream deeply moisturises skin and is enriched with Safflower Seed Oil and Macadamia Oil to rebalance dryness and protect skin from moisture loss. Vitamin E provides antioxidant protection for hands whereas Carrot Root Extract and Aloe Vera work to sooth dryness whilst calming and softening the skin.\nRose Hand Cream leaves hands soft, smooth and hydrated for a youthful appearance.", "product_name": "Rose Hand Cream 125ml", "brand": "Jurlique"},
{"price": "HK $101.60", "id": 17, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0096F_1_L.jpg/02cc433e5d1988325d41be045c8e7254/STTR0096F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/expessstarterkit/", "product_description": "St.Tropez Express Starter Kit is the perfect cosmetic addition for any beauty junkie who is constantly on the go.\nMaking the perfect companion for any tanoholic or newbie who wants a bronzed effect instantly, Express Starter Kit exquisitely tans the body to an impeccable effect without leaving a tell-tale fake-tan smell. With the ability to both nourish and seamlessly bronze the skin, Express Starter Kit guarantees a perfect tan at any time of the year, no matter the weather.\nContaining the renowned Express Bronzing Mousse, two prepping products and the ever-convenient Applicator Mitt, this cracker of a collection promises to deliver flawless coverage without the risk of streaks or patches.\nGet the sun-kissed look of your dreams instantly with Express Bronzing Mousse.", "product_name": "Expess Starter Kit", "brand": "St.Tropez"},
{"price": "HK $292.30", "id": 18, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO8140F_1_L.jpg/c81a8fc3c0a3e8ae8e611f1852042527/THWO8140F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/skindeepdrylegoilltdedition/", "product_description": "A hydrating leg oil.\nDesigned to transform dry, dull skin, Skin Deep Dry Leg Oil Ltd Edition can be used all over the body to soften and soothe. Protecting from ageing environmental factors, massage into skin for a plumper, healthier skin texture.", "product_name": "Skin Deep Dry Leg Oil Ltd Edition 80ml", "brand": "This Works"},
{"price": "HK $257.10", "id": 19, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SICO0015F_1_L.jpg/d3a94433a241bbb0ca12c3ee630f805c/SICO0015F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sisterco/apricotvanillalemonbodymelt/", "product_description": "A natural body moisturiser.\nRich in vitamins and essential fatty acids, Apricot Vanilla Lemon Body Melt softens the skin. Suitable for all skin types, spread the smell of summer over your body for lightweight, all day smoothness and lasting hydration.", "product_name": "Apricot Vanilla Lemon Body Melt 120g", "brand": "Sister & Co."},
{"price": "HK $377.00", "id": 20, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL-jurliqueherbalrecoveryadvancedserum_1_gl.jpg/321e10a10476dce4fe28a43d53c89bab/jurliqueherbalrecoveryadvancedserum_1_gl.jpg", "colour": "Herbal Recovery Advanced Serum 30ml – HK $377.00,\nHerbal Recovery Advanced Serum 100ml – HK $763.40", "product_url": "http://beautybay.com/bathandbody/jurlique/herbalrecoveryadvancedserum/", "product_description": "Jurlique Herbal Recovery Advanced Serum is a luxurious skin treatment which helps to improve skin texture, reduce fine lines and boost radiance.\nThe next generation in advanced skincare, Herbal Recovery Advanced Serum is a youth defence concentrate serum which creates a natural defence shield to help guard the skin from environmental aggressors and oxidative stress.\nExclusively formulated with Jurlique’s revolutionary Naturadiance PB18+ Complex, Herbal Recovery Advanced Serum combines 15 Bio-Intrinsic™ Botanical Extracts with 3 breakthrough ingredients to deliver potent antioxidant benefits to protect, revitalise and enhance the skin’s natural recovery cycle.\nPersian Silk Extract helps to strengthen cellular ability to shield against environmental stress whilst Peach Leaf Extract helps the skin to recover vitality and promote cellular regeneration. Herbal Recovery Advanced Serum also utilises Wu-Zhu-Yu Extract to boost microcirculation and smooth the skin.\nSpecially developed to increase elasticity, reduce the appearance of fine lines, relieve the skin from dullness and dehydration, Herbal Recovery Advanced Serum is suitable for all skin types. Sure to be as successful as its predecessor, Herbal Recovery Advanced Serum leaves the skin visibly glowing, revitalised and more youthful with an added boost of radiance.", "product_name": "Herbal Recovery Advanced Serum", "brand": "Jurlique"},
{"price": "HK $433.30", "id": 21, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/tanluxethefaceantiage_1_gl.jpg", "colour": "Light-Medium 30ml – HK $433.30,\nMedium-Dark 30ml – HK $433.30", "product_url": "http://beautybay.com/bathandbody/tanluxe/thefaceantiage/", "product_description": "A bottle of anti-ageing tanning drops.\nCreating a bronzed, youthful complexion, The Face Anti-Age restores dry and dull skin whilst reducing fine lines and wrinkles. Completely customisable, create your own buildable colour and incorporate seamlessly into an existing skincare regime.", "product_name": "The FACE Anti-Age", "brand": "TAN-LUXE"},
{"price": "HK $42.10", "id": 22, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA-bodybuffertinglypeppermintscrub_1_GL.jpg/8d2c0a03607ce5b6322a6a1a708149d6/bodybuffertinglypeppermintscrub_1_GL.jpg", "colour": "Body Buffer Tingly Peppermint Scrub 118ml – HK $42.10,\nBody Buffer Tingly Peppermint Scrub 236ml – HK $69.80", "product_url": "http://beautybay.com/bathandbody/milliondollartan/bodybuffertinglypeppermintscrub/", "product_description": "An incredibly invigorating body scrub perfect for pre-tan preparation.\nFormulated to remove dead skin cells, dirt and oil build-up on the surface of the skin, the Body Buffer Tingly Peppermint Scrub lays the foundations for a long-lasting, seamless tan. Enriched with an array of natural skin-loving ingredients, the essential prepping step cares for the epidermis as it hydrates and moisturises whilst gently buffing away any unwanted debris that might affect the flawlessness of your golden goddess finish.", "product_name": "Body Buffer Tingly Peppermint Scrub", "brand": "Million Dollar Tan"},
{"price": "HK $94.40", "id": 23, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0053F_1_L.jpg/181923ac2b9e09b17b35b70a271a11c8/MABA0053F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/ahabotanicalbodysoap/", "product_description": "Mario Badescu AHA Botanical Body Soap (236ml) is lightly scented and enriched with fresh Fruit Extracts to exfoliate and cleanse the skin.", "product_name": "AHA Botanical Body Soap", "brand": "Mario Badescu"},
{"price": "HK $122.50", "id": 24, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/alph0076f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/alphah/cleansingcube/", "product_description": "Alpha-H Cleansing Cube is a hand crafted exfoliating bar for all skin types.\nSuitable for the face and body, Cleansing Cube is 100% free from Palm Oil and Soap and is gentle enough for daily use. Enriched with crushed Cranberries, Cleansing Cube gently buffs away dead skin cells and impurities whilst stimulating circulation for healthier skin.\nGlycolic Acid works alongside Coconut Oil to lock in moisture and refine the skin whilst the high performance formula is suitable for those suffering from eczema and other sensitive skin conditions. Cleansing Cube leaves the skin beautifully refreshed and hydrated with a satin soft surface texture.", "product_name": "Cleansing Cube 100g", "brand": "Alpha-H"},
{"price": "HK $67.70", "id": 25, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0061F_1_L.jpg/f40cb66a692203732bbc4867ca08e3d5/STTR0061F_1_L.jpg", "colour": "Light-Medium 100ml – HK $67.70,\nMedium-Dark 100ml – HK $67.70", "product_url": "http://beautybay.com/bathandbody/sttropez/instanttanfacebodylotion/", "product_description": "St. Tropez Instant Tan Face & Body Lotion is a wash-off self-tanning lotion which creates a flawless sun-kissed looking tan instantly.\nEasy to use with an advanced formula, Instant Tan Face & Body Lotion glides effortlessly onto the skin to create a natural, streak-free tan which will last up to 24 hours. Perfect for a last minute tan or for special occasions, Instant Tan Face & Body Lotion won’t transfer onto clothing but is easily removed with soap and water.\nDermatologically tested and Paraben free, Instant Tan Face & Body Lotion utilises clinically tested RAINMAC™ Technology to ensure your temporary tan won’t run or streak, even in the rain. Available in two shades to suit all skin tones, Instant Tan Face & Body Lotion leaves the skin feeling soft and supple with a natural looking sun-kissed glow.", "product_name": "Instant Tan Face & Body Lotion", "brand": "St.Tropez"},
{"price": "HK $116.70", "id": 26, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0057F_1_L.jpg/f6644f294b5e7bbd237745d6d87ee0f3/MABA0057F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/vitaminebodylotion/", "product_description": "Mario Badescu Vitamin E Body Lotion (177ml) is enriched with Vitamin E, Wheat Germ Oil and Peanut Oil to moisturize and nourish skin.", "product_name": "Vitamin E Body Lotion", "brand": "Mario Badescu"},
{"price": "HK $935.30", "id": 27, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0158F_3_L.JPG/6fd92eac94d106170aeac16682a0ddac/THWO0158F_3_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/deepsleepbathoil/", "product_description": "This Works Deep Sleep Bath Oil delivers intense relaxation for a deeper sleep.\nThis expertly blended bath oil is enriched with a combination of the highest quality Essential Oils to indulge your body and mind. Formulated at spa strength for optimal results, Lavender, Vetivert and Chamomile work harmoniously to relieve tension, stress and physical exhaustion.\nDeep Sleep Bath Oil allows you to take a proactive approach to a good night’s sleep and leaves you revived and energised the following morning.", "product_name": "Deep Sleep Bath Oil 100ml", "brand": "This Works"},
{"price": "HK $364.40", "id": 28, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SUPG0005F_1_L.jpg/c7351fbbcb31ae7e5d829c2665eea443/SUPG0005F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/supergoop/citysunscreenserumspf30/", "product_description": "Supergoop! City Sunscreen Serum SPF 30 hydrates and nourishes the complexion, whilst delivering high protection against damaging UV-rays.\nPerfect for use all year round, City Sunscreen Serum SPF 30 glides onto the skin, creating an effective defence against the harmful effects of the sun, thus preventing the development of fine lines, wrinkles and discolouration effortlessly.\nInfused with Vitamins E and B5, this rich serum melts into the skin to hydrate and restore at a deep level whilst promoting cellular turnover and a plumper, dewy finish for the complexion that will leave everybody speechless.\nHydrovotin 24 ensures that this lightweight, quick-absorbing elixir delivers long-lasting conditioning results whilst Uniprotect PT-3 dramatically reduces the signs of ageing, from dark spots to crow's feet, making it a certified skincare essential for all beauty junkies.\nActing as a sublime primer for the application of makeup, City Sunscreen Serum SPF 30 should be worn daily to prevent the development of unwanted fine lines and wrinkles, whilst smoothing the surface of the skin for a supple finish.", "product_name": "City Sunscreen Serum SPF 30 60ml", "brand": "Supergoop!"},
{"price": "HK $205.70", "id": 29, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TALI0092F_1_L.JPG/cdef1c6a09db37d8c14bdb0b5482b529/TALI0092F_1_L.JPG", "colour": "Chestnut 0.8ml – HK $205.70,\nBrown 0.8ml – HK $205.70", "product_url": "http://beautybay.com/bathandbody/talika/eyebrowlipocilsink/", "product_description": "An eyebrow definer.\nBoth a treatment and makeup, Eyebrow Lipocils Ink permanently and temporarily colours and shapes. In a fine-tipped, easy to use pen, the smudge-free formula stimulates natural pigmentation for thicker, fuller brows in just 28 days.", "product_name": "Eyebrow Lipocils Ink", "brand": "Talika"},
{"price": "HK $402.00", "id": 30, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SUPG-supergoopeverysuntech_1_gl.jpg/461ed01c16222abace56322decfc8c67/supergoopeverysuntech_1_gl.jpg", "colour": "Everyday Sunscreen with Cellular Response Technology SPF 50 532ml – HK $402.00", "product_url": "http://beautybay.com/bathandbody/supergoop/everydaysunscreenwithcellularresponsetechnologyspf50/", "product_description": "Supergoop! Everyday Sunscreen with Cellular Response Technology SPF 50 provides the face and the body with extreme protection against damaging UV-rays.\nBoasting an Oil-free, non-comedogenic and SPF 50 formula, Everyday Sunscreen with Cellular Response Technology SPF 50 ensures that the skin is protected against the damaging effects of the sun, whilst simultaneously not clogging the pores or causing unwanted oiliness and shine.\nDesigned to replenish the skin's natural moisture levels, Everyday Sunscreen with Cellular Response Technology SPF 50 prevents the skin from becoming dry and dehydrated, even under the exposure of the sun, making it a certifiable necessity for any cosmetic junkie who adores soaking up the rays.\nInfused with Natural Extracts including Basil, Boise De Rose and Citrus, this innovative skin protector provides a pleasant experience for the senses whilst remaining efficient in its aim to reflect and protect against the sun's harmful rays, ensuring that premature ageing is less likely to occur.\nBreaking the boundaries of traditional sunscreen, Everyday Sunscreen with Cellular Response Technology SPF 50 utilises Avobenzone to ensure that the cream melts gently onto the skin without leaving a tacky white residue that is synonymous with typical sun protectors, making it suitable for all skin tones.\nFormulated using Antioxidant-rich Cellular Response Technology, Everyday Sunscreen with Cellular Response Technology SPF 50 maintains the skin's natural, healthy glow whilst guaranteeing the optimal amounts of protection, making it the ultimate vacation product.\nMoisturising, lightweight and extremely breathable, Everyday Sunscreen with Cellular Response Technology SPF 50 is sure to become a Beauty Bay best-seller and is perfect for everyone.", "product_name": "Everyday Sunscreen with Cellular Response Technology SPF 50", "brand": "Supergoop!"},
{"price": "HK $148.10", "id": 31, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0034F_1_L.jpg/95a24ec452c450e93688ff15c931ee5d/COSH0034F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/invigoratelotion/", "product_description": "Como Shambhala Invigorate Lotion is a luxurious body moisturiser which softens the skin and stimulates the senses.\nStart your day on a refreshing note with this light yet deeply hydrating body lotion. Infused with Eucalyptus and Geranium, Invigorate Lotion softens and nourishes the skin whilst Lavender Essential Oil enhances your well-being.\nInvigorate Lotion also contains a stimulating blend of Peppermint Oil to awaken the body and mind so you are perfectly ready for the day ahead. An essential step in any daily regime, Invigorate Lotion leaves the skin feeling silky soft and hydrated whilst the therapeutic scent clears the mind from stress and tension to allow you to remain calm and focused.", "product_name": "Invigorate Lotion 300ml", "brand": "Como Shambhala"},
{"price": "HK $95.20", "id": 32, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI0008F_1_L.jpg/04a62fb0a44cbb67ec0b122b32e35369/VILI0008F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/bodytreatmentmoistureboostluxuryhydration/", "product_description": "A nourishing body moisturiser with a subtle shimmer for hydrated luminosity.\nDeveloped with seventy two hour moisture lock technology, Body Treatment Moisture Boost Luxury Hydration works to intensely condition the skin, for a silky soft and radiant finish.", "product_name": "Body Treatment Moisture Boost Luxury Hydration 175ml", "brand": "Vita Liberata"},
{"price": "HK $116.70", "id": 33, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABB-mauibabeamazingspf30sunblock_1_gl.jpg/9cf59e57a375a96f12b952b5c4442105/mauibabeamazingspf30sunblock_1_gl.jpg", "colour": "Amazing SPF 30 Sun Block 118ml – HK $74.00,\nAmazing SPF 30 Sun Block 236ml – HK $116.70", "product_url": "http://beautybay.com/bathandbody/mauibabe/amazingspf30sunblock/", "product_description": "Maui Babe Amazing SPF 30 Sun Block is a high protection lotion for all skin types.\nEspecially formulated for use with Maui Babe Amazing Browning Lotion, this sun block works to protect you from harmful UVA and UVB rays, whilst still giving you a deep, rich and golden brown tan.", "product_name": "Amazing SPF 30 Sun Block", "brand": "Maui Babe"},
{"price": "HK $288.30", "id": 34, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TESC0002F_1_L.JPG/8ba198ecaf059ac3beb7e91f19422a8d/TESC0002F_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/theskinnycaffe/skinnytea14dayweightlossprogramme/strawberry__pineapple_and_vanilla__cocoa", "product_description": "A 14-day weight loss programme.\nThe Skinny Caffe Skinny Tea 14 Day Supply Strawberry & Pineapple and Vanilla & Cocoa burns fat and boosts energy levels. Containing both day and night tea bags, drink as instructed over 14 days for reduced bloating and a flat stomach.", "product_name": "Skinny Tea 14 Day Weight Loss Programme", "brand": "The Skinny Caffe"},
{"price": "HK $122.50", "id": 35, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0027F_1_L.jpg/8812cbed8a4fe9fca44d98d00fcd3d13/MDTA0027F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/milliondollartan/blendfriendduo/", "product_description": "The perfect set for ensuring a seamless finish to your sunless tan.\nDeveloped to ensure that every application is as seamless as the next, the Blend Friend Duo is definitely an essential to any tan-lover's kit. Consisting of two blending mitts, one for the face and one for the body along with an incredibly nourishing oil that limits the tanner's absorption, this kit is sure to be the answer to achieving a natural, streak-free finish.", "product_name": "Blend Friend Duo", "brand": "Million Dollar Tan"},
{"price": "HK $175.30", "id": 37, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0253F_1_L.jpg/d836293c5e3fcf1b67cb8848cf2e14ea/THWO0253F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/supersleep/", "product_description": "A duo of sleep inducing pillow sprays to ensure you get the best night's sleep.\nDeveloped to help you drift off into a relaxing, deep sleep, the Super Sleep combines two naturally derived pillow sprays in the same dispenser for a travel-friendly answer to an uninterrupted nights rest. The unique two in one spray, harbours both Deep Sleep and Sleep Plus allowing you to use the best suited mist to aid your sleeping pattern, no matter where you're resting your head.", "product_name": "Super Sleep 2x20ml", "brand": "This Works"},
{"price": "HK $84.60", "id": 38, "image_url": "http://images.contentful.com/eoaaqxyywn6o/KOCO0003F_1_L.jpg/1a9443ea9dee2ab610707c09ca4b4d69/KOCO0003F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/kocostar/footpeelingpack/", "product_description": "An intensive treatment to rid the feet of dry, flaking skin.\nDeveloped to gently lift away dead skin cells, the Foot Peeling Pack is an innovative and effective way to achieve silky soft and smooth feet. The two foot-shaped pockets are infused with an AHA-enriched serum which blends lactic and glycolic acids to break down and slough away coarse, flaky patches. The perfect choice for anyone suffering with dry, cracked heels, this simple, yet effective treatment will quickly restore feet to a smooth, healthy finish.", "product_name": "Foot Peeling Pack", "brand": "Kocostar"},
{"price": "HK $228.50", "id": 39, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI-bodyblurinstanthdfinish24hrwear_1_GL.jpg/ecfa382c203eaa1ae1c4207bbfe5d5b9/bodyblurinstanthdfinish24hrwear_1_GL.jpg", "colour": "Latte 100ml – HK $228.50,\nLatte Light 100ml – HK $228.50", "product_url": "http://beautybay.com/bathandbody/vitaliberata/bodyblurinstanthdfinish24hrwear/", "product_description": "A wash off body perfecting filter for an instant tint.\nApplied delicately to the areas of the body that need a sunkissed glow the Body Blur Instant HD Finish 24HR Wear achieves an immediate colour with light reflecting filters for a photo ready finish. Available in three shades, the water resistant formula creates a look that can be worn from special events to days by the pool.", "product_name": "Body Blur Instant HD Finish 24HR Wear", "brand": "Vita Liberata"},
{"price": "HK $226.10", "id": 40, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0004F_1_L.jpg/cb9f0d0745ebbe71e1c7ae010669c5b5/JURL0004F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/soothingfoamingcleanser/", "product_description": "Jurlique Soothing Foaming Cleanser is a luxurious calming cleanser ideal for sensitive skin.\nSpecially designed to rebalance sensitivity during the cleansing process, Soothing Foaming Cleanser lifts away surface impurities to leave the complexion feeling fresh and clean. Traditional Chinese herbs of Groomwell and Sichuan Peppercorn help to soothe skin whilst Macadamia Oil helps to rebalance dryness and keep skin comfortable and soothed during cleansing.\nSoothing Foaming Cleanser provides essential hydration whilst protecting against moisture loss and leaves sensitive skin feeling clean, soothed and comfortable.", "product_name": "Soothing Foaming Cleanser 200ml", "brand": "Jurlique"},
{"price": "HK $216.10", "id": 41, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0211F_1_L.jpg/80157e29ff88c7abedfb8ada454c041e/JURL0211F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/sunspecialistspf40highprotectioncream/", "product_description": "Jurlique Sun Specialist SPF40 High Protection Cream is a versatile all natural sunscreen that can be used on both the body and the complexion.\nGliding exquisitely onto the skin, Sun Specialist SPF40 High Protection Cream magnificently protects against damaging UV-rays, ensuring that the face and the body can maintain a youthful, healthy finish. Ideal for all skin types, this innovatively formulated sun cream also intensely hydrates and conditions the skin with Antioxidants, guaranteeing to deliver touchably soft results that will leave you in awe.\nEnjoy the sun but stay protected with Sun Specialist SPF40 High Protection Cream.", "product_name": "Sun Specialist SPF40 High Protection Cream 100ml", "brand": "Jurlique"},
{"price": "HK $277.20", "id": 42, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TESC0001F_1_L.JPG/02fbd1caa329ff94515c8f31235147a6/TESC0001F_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/theskinnycaffe/skinnycoffee30dayweightlossprogramme/", "product_description": "An effective weight loss drink.\nBoosting metabolism and burning fat, The Skinny Caffe Skinny Coffee 30 Day Supply flattens the stomach and beats the bloat. Made with natural, organic coffee and a blend of superfood ingredients, drink a cup a day for noticeable, healthy results.", "product_name": "Skinny Coffee 30 Day Weight Loss Programme 100g", "brand": "The Skinny Caffe"},
{"price": "HK $207.40", "id": 43, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0093F_1_L.jpg/7b40c6b90c247f624d638fe70fc69610/STTR0093F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/classicbronzingmousse240ml/", "product_description": "St.Tropez Classic Bronzing Mousse is a light-weight, easy to apply self-tan for a long-lasting sun kissed glow.\nInfused with conditioning Aloe Vera and highly-hydrating components, Classic Bronzing Mousse has a super-lightweight and velvety formula which dries in an instant and washes off to reveal a perfectly natural looking, streak-free tan.\nInnovative and effortless to use, Gradual Tan Face eliminates the tell-tale scent often associated with self-tanning products and leaves skin smelling deliciously fresh.", "product_name": "Classic Bronzing Mousse 240ml", "brand": "St.Tropez"},
{"price": "HK $104.60", "id": 44, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0104F_1_L.jpg/4fae91c95b03ab4b6b877741d1d33233/STTR0104F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/instanttanfinishinggloss/", "product_description": "An instant bronzing gloss.\nDesigned to add a high shine finishing effect, Instant Tan Finishing Gloss has an easy wash off formula. Adding an instant touch of bronze, build it up and wear alone or apply over an existing tan to enhance skin with a subtle shimmer. Easy to apply and even easier to remove, wash off with soap and water for one night wear.", "product_name": "Instant Tan Finishing Gloss 100ml", "brand": "St.Tropez"},
{"price": "HK $147.60", "id": 45, "image_url": "http://images.contentful.com/eoaaqxyywn6o/FRBO0002F_1_L.jpg/cde0152d5e1136680edc1d3dbad5c9cb/FRBO0002F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/frankbody/frankcoconutcoffeescrub/", "product_description": "An exfoliating body scrub.\nWith a summer holiday scent, Frank Coconut Coffee Scrub softens and evens skin. Made with natural ingredients, massage over the body 2-3 times a week to remove lumps and bumps whilst healthily hydrating.", "product_name": "Frank Coconut Coffee Scrub 200g", "brand": "Frank Body"},
{"price": "HK $197.90", "id": 46, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COOL-coolamineralliplux_1_GL.JPG/e0009ee78d813fb911695ae736705198/coolamineralliplux_1_GL.JPG", "colour": "Tan Line 4.25g – HK $197.90,\nSummer Crush 4.25g – HK $197.90,\nFirecracker 4.25g – HK $197.90,\nBonfire 4.25g – HK $197.90,\nNude Beach 4.25g – HK $197.90", "product_url": "http://beautybay.com/bathandbody/coola/minerallipluxspf30/", "product_description": "A conditioning lip balm.\nAvailable in five different shades and flavours, Mineral Liplux SPF30 adds a hint of natural colour whilst treating and protecting. Retaining moisture, apply throughout the day for smooth, plump lips that are protected from the sun for up to 80 minutes.", "product_name": "Mineral Liplux SPF30", "brand": "COOLA"},
{"price": "HK $266.00", "id": 47, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SICO0005F_1_L.jpg/4eb8ead95227c352d158feae4e1789d7/SICO0005F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sisterco/rawcoconutactivatedcharcoalsugarscrub/", "product_description": "A finely ground scrub ideal for use on irritated skin.\nFormulated specifically to help target congested skin, the Raw Coconut & Activated Charcoal Sugar Scrub is must have for drawing out stubborn impurities. The charcoal based scrub not only removes dead skin cells populating the surface but also deeply nourishes leaving the skin feeling and looking rejuvenated and refreshed with diminished redness.", "product_name": "Raw Coconut & Activated Charcoal Sugar Scrub 300g", "brand": "Sister & Co."},
{"price": "HK $97.10", "id": 48, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0019F_1_L.jpg/eb16e22e2db7fac144b3e3233e756b52/MDTA0019F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/milliondollartan/shadeupgrademediumfoundationbooster/", "product_description": "The perfect addition to your favourite foundation for a seamless match to your glowing tan.\nFinally the answer to all of our tanning prayers; lightweight bronze drops created so you can achieve a perfectly balanced finish without buying a new foundation every time you tan. The innovative Shade Upgrade Medium Foundation Booster is a must-have, tanning essential for anyone that is serious about achieving a seamless natural looking finish to their bronzed beauty appearance.", "product_name": "Shade Upgrade Medium Foundation Booster 50ml", "brand": "Million Dollar Tan"},
{"price": "HK $147.60", "id": 49, "image_url": "http://images.contentful.com/eoaaqxyywn6o/FRBO0003F_1_L.jpg/cfae30aa3741bf4cd63481a30096f964/FRBO0003F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/frankbody/frankcacaocoffeescrub/", "product_description": "An exfoliating body scrub.\nRich and chocolatey, Frank Cacao Coffee Scrub is a vegan mix of skin-smoothing ingredients. Packed with antioxidants, apply 2-3 times weekly to eradicate dull winter skin and replace it with a healthy, full body glow.", "product_name": "Frank Cacao Coffee Scrub 200g", "brand": "Frank Body"},
{"price": "HK $217.90", "id": 50, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI0023F_1_L.jpg/8adc462a3ec81250f4806ea9d688b60d/VILI0023F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/neroliarganmilkfacebodyspf50/", "product_description": "Moisturised, long lasting sun protection for both the face and body.\nFormulated with a lightweight liquid texture, the high factor sun barrier blocks UV and UVA rays offering a full strength protection. Neroli & Argan Milk Face & Body SPF50 also offers firming, anti-ageing properties which work in synergy with the SPF50 to perfect the body and the face as well as protecting skin.", "product_name": "Neroli & Argan Milk Face & Body SPF50 100ml", "brand": "Vita Liberata"},
{"price": "HK $624.60", "id": 51, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STRI0009F_1_L.jpg/c0c7c423e491edaacf20160a36c7e99c/STRI0009F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/strivectin/tladvancedtighteningneckcream/", "product_description": "A gravity fighting neck cream suited to mature skin.\nTL Tightening Face & Neck Cream applies smoothly along both the neck and jawline to help tackle the signs of sagging and ageing skin. The thick, bouncy texture of the hydrating formula visibly tightens and firms revealing rejuvenated, moisture-replenished skin.", "product_name": "TL Advanced Tightening Neck Cream 50ml", "brand": "StriVectin"},
{"price": "HK $160.80", "id": 52, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI-vitaliberatafabulousselftanningmousse_1_GL.jpg/69a7417fd7a02e6421d638a1c58e98be/vitaliberatafabulousselftanningmousse_1_GL.jpg", "colour": "Fabulous Self Tanning Tinted Mousse Dark 100ml – HK $160.80", "product_url": "http://beautybay.com/bathandbody/vitaliberata/fabulousselftanningtintedmoussedark/", "product_description": "A luxurious mousse tan formulated with plant extracts and botanicals for a natural bronzed hue suited to medium to tanned skin tones.\nThe Fabulous Self Tanning Tinted Mousse is innovatively created with an odour-free formula for a pleasant tanning experience. Applied to the skin, the quick drying tan offers an instant colour which gradually develops over a four to eight hour period into a holiday worthy glow.", "product_name": "Fabulous Self Tanning Tinted Mousse Dark", "brand": "Vita Liberata"},
{"price": "HK $290.20", "id": 53, "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAIS0044F_1_L.jpg/a207aa17e047847ac3122406119c0c86/PAIS0044F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/skincare/paiskincare/petitpaiapplemallowblossomfacebodycream/", "product_description": "A soothing face and body cream ideal for your little ones.\nPetit Pai Apple & Mallow Blossom Face & Body Cream has been created with the delicate skin of a baby in mind. Formulated with a cocktail of soothing botanical oils and butters, the rich cream works to deliver caring hydration whilst offering a much needed relief from itchiness, leaving your baby's skin feeling comfortable and smooth.", "product_name": "Petit Pai Apple & Mallow Blossom Face & Body Cream 200ml", "brand": "Pai Skincare"},
{"price": "HK $147.60", "id": 54, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SCLO0013F_1_L.jpg/1029c87df704472062e196095a8b5986/SCLO0013F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/scrublove/cacaobodyscrubcacaoorange/", "product_description": "A softening body scrub.\nPerfect for normal to dry skin types, Cacao Body Scrub Cacao & Orange treats and protects. Made with Dead Sea Salt, stimulate and exfoliate whilst simultaneously moisturising for soft, chocolate orange scented skin.", "product_name": "Cacao Body Scrub Cacao & Orange 200g", "brand": "Scrub Love"},
{"price": "HK $312.50", "id": 55, "image_url": "http://images.contentful.com/eoaaqxyywn6o/INES0035F_2_L.jpg/c51e1dec4f2a1b1be21d28c76ecedb9a/INES0035F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/institutesthederm/adaptasunprotectivemilkybodyspraymoderatesun/", "product_description": "Institut Esthederm Adaptasun Protective Milky Body Spray Moderate Sun is a body lotion spray ideal for tanning safely under normal to strong sun.", "product_name": "Adaptasun Protective Milky Body Spray Moderate Sun 150ml", "brand": "Institut Esthederm"},
{"price": "HK $112.10", "id": 56, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0021F_1_L.jpg/8faad3c1c34a2b3813d12caf534329c0/MDTA0021F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/milliondollartan/allthatshimmersdryoilshimmer/", "product_description": "A luxuriously hydrating dry oil for the body, with a glamorous shimmer finish.\nEspecially formulated to highlight and perfect the body, the All That Shimmers Dry Oil Shimmer is a must-have finishing touch for the skin. Produced with an array of hydrating, skin-loving botanicals, the weightless, tinted oil offers a smoothing finish with a subtle glow and shimmer on even the driest of skin. Add a mesmerising sparkle to any look with this dazzling body oil.", "product_name": "All That Shimmers Dry Oil Shimmer 118ml", "brand": "Million Dollar Tan"},
{"price": "HK $47.60", "id": 57, "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO-yestocarrotsnourishingbodywash_3_gl.jpg/227515ea2d30adcf8209a6b9169fcb82/yestocarrotsnourishingbodywash_3_gl.jpg", "colour": "Carrots Nourishing Body Wash 280ml – HK $47.60", "product_url": "http://beautybay.com/bathandbody/yesto/carrotsnourishingbodywash/", "product_description": "Yes To Carrots Nourishing Body Wash is a pampering shower gel which naturally nourishes all skin types.\nLoaded with a fusion of Organic Carrots and Melon, Carrots Nourishing Body Wash provides natural antioxidant protection and nurtures the skin with Vitamins A & C. Suitable for all skin types and ideal for daily use, this rejuvenating body wash naturally exfoliates and hydrates the skin to promote softness and has a refreshing scent which will entice the senses.\nCarrots Nourishing Body Wash is free from Parabens, Petroleum and SLS and leaves the skin looking and feeling silky smooth, squeaky clean and deeply nourished.", "product_name": "Carrots Nourishing Body Wash", "brand": "Yes To"},
{"price": "HK $37.10", "id": 58, "image_url": "http://images.contentful.com/eoaaqxyywn6o/HOHO0025F_1_L.jpg/7de1afb1d69430a9e7a3c29eea488e87/HOHO0025F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/holikaholika/babysilkyfootmasksheet/", "product_description": "A moisturising foot mask.\nWith two separate, disposable sheet masks, Baby Silky Foot Mask Sheet softens and moisturises. Soaking the feet in deeply nourishing ingredients, transform dry, flaking skin into super soft, smooth feet.", "product_name": "Baby Silky Foot Mask Sheet 18ml", "brand": "Holika Holika"},
{"price": "HK $97.30", "id": 59, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0109F_1_L.jpg/99defe29d916aee3ef59b68a2849381c/STTR0109F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/gradualtaninshowerlotionmedium/", "product_description": "St Tropez Gradual Tan In Shower Lotion Medium is a revolutionary, one-of-a-kind self-tanning lotion which is activated by water.\nPerfect for people who are constantly on-the-go, Gradual Tan In Shower Lotion takes just a mere three minutes to apply, so it can be effortlessly added to your shower regime. Sunkissed skin is just a shower away with this innovative, time-saving gradual tan that creates a flawlessly radiant glow all year round.\nBuild up a fabulous tan and moisturise the skin with this revolutionary beauty essential, which provides a uniquely streak-free glow whilst enjoying your morning shower. Providing 24 hour moisturisation and suitable for all skin types, Gradual Tan In Shower Lotion is enriched with Sweet Almond Oil and works to subtly build a streak free, sunkissed glow.", "product_name": "Gradual Tan In Shower Lotion Medium 200ml", "brand": "St.Tropez"},
{"price": "HK $47.70", "id": 60, "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO0174F_1_L.jpg/d17d91a84c50d469d546103bba4b7e47/YETO0174F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/skincare/yesto/activatedcharcoalbarsoap/", "product_description": "A detoxifying, charcoal infused soap ideal for blemish prone skin.\nCreated to be used head to toe to rid the skin of impurities, the Activated Charcoal Bar Soap is an in shower essential. The incredibly creamy formula harbours a cocktail of skin-nourishing natural ingredients that work in synergy to draw out and absorb oils and sebum that sit beneath. Gentle enough to be used on the face and body, the caring soap takes skincare back to basics.", "product_name": "Activated Charcoal Bar Soap 195g", "brand": "Yes To"},
{"price": "HK $69.80", "id": 61, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA-cabanatangraduallotion_1_GL.jpg/c42b5fdaebf1a765dcea31ebe8885434/cabanatangraduallotion_1_GL.jpg", "colour": "Cabana Tan Gradual Sunless Tanning Lotion 118ml – HK $69.80", "product_url": "http://beautybay.com/bathandbody/milliondollartan/cabanatangradualsunlesstanninglotion/", "product_description": "An effortless, buildable tan which is ideal for creating a flawless streak-free finish.\nPerfect for beginners or those who want to achieve a subtle sun-kissed finish, the Cabana Tan Gradual Tanning Lotion boasts an intensely hydrating, skin-nourishing cream formula. Applied regularly, the botanically enriched formula creates a flawless, even and natural looking tan, making it ideal for maintaining a year round glow.", "product_name": "Cabana Tan Gradual Sunless Tanning Lotion", "brand": "Million Dollar Tan"},
{"price": "HK $281.90", "id": 62, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0075F_2_L.jpg/0ad1dff2472eb8cb63f4e3ebeb34c439/THWO0075F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/deepsleeppillowtalk/", "product_description": "This Works Deep Sleep Pillow Talk contains all the essentials needed to promote a deep and peaceful slumber.\nCreate a peaceful haven before bedtime with this calming double act. Combining two precious products formulated with Lavender and Chamomile Essential Oils, Pillow Talk is specially designed to help you sleep.\nThe best-selling Deep Sleep Pillow Spray is enriched with a peaceful blend of Lavender, Vetivert and Chamomile Essential Oils to promote relaxation, whilst the newly developed Deep Sleep Stress Less Rollerball is enriched with Eucalyptus and Lavender Oils to help you breathe easily and calm your senses.\nSure to become an essential step in your bedtime ritual, Deep Sleep Pillow Talk is the ideal introduction to the This Works Deep Sleep range.", "product_name": "Deep Sleep Pillow Talk", "brand": "This Works"},
{"price": "HK $211.60", "id": 63, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/alph0030f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/alphah/agedelayhandcuticlecarecream/", "product_description": "Alpha-H Age Delay Hand & Cuticle Care Cream is a richly moisturising anti aging cream for all skin types.\nFormulated with 10% Glycolic Acid and Keratin, this cream is also enriched with Flower Extracts and Antioxidants and has a non greasy texture that is quickly absorbed. The skin is gently hydrated, softened, smoothed and youthful once more.", "product_name": "Age Delay Hand & Cuticle Care Cream 100ml", "brand": "Alpha-H"},
{"price": "HK $116.90", "id": 64, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MITO0045F_1_L.jpg/aae74789281ef6b90771ae8838d87202/MITO0045F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/michaeltodd/organicaloenourishinghealingoil/", "product_description": "Michael Todd Organic Aloe Nourishing Healing Oil masterfully heals and replenishes the skin at a cellular level, delivering intense treatment and care for many common ailments of the skin.\nWith the ability to work tirelessly to reverse any damage caused to the skin by daily environmental aggressors, Organic Aloe Nourishing Healing Oil utilises a cocktail of Natural ingredients to sumptuously soften and condition the skin, even the deeper layers, whilst maintaining a healthy, clear finish.\nIdeal for those who suffer with dryness, stretch marks, blackheads, acne and blemishes, this one-of-a-kind healing elixir enchantingly eradicates all the usual signs of de-stress from the skin without leaving a greasy residue.\nFormulated using calming Lavender, Organic Aloe Nourishing Healing Oil ensures that the skin is soothed after being exposed to the sun or being irritated by a damaging environmental radical, making it a certifiable skin care necessity for any cosmetic junkie who adores soaking up the sun.\nInfused with nature's miracle worker, the Acai Berry, this decadent oil rejuvenates and restores the skin to its natural health, offering true clarity and purification at a cellular level.\nWith the inclusion of Aloe Vera Extract, this scrumptiously effective liquid glides over the skin delicately, subtly nourishing and hydrating even the deepest layers whilst amending discolouration and hyper-pigmentation.\nGet the skin of your dreams and escape your cosmetic nightmare with Organic Aloe Nourishing Healing Oil from the beauty experts at Michael Todd.", "product_name": "Organic Aloe Nourishing Healing Oil 300ml", "brand": "Michael Todd"},
{"price": "HK $241.20", "id": 65, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0189F_1_L.jpg/99e399fdfc56346525cea80d68f93292/JURL0189F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/calendularednessrescuecalmingmist/", "product_description": "Jurlique Calendula Redness Rescue Calming Mist is a hydrating toner which soothes sensitive and irritated complexions.\nEnriched with the proprietary Comfort Complex, Calendula Redness Rescue Calming Mist utilises a blend of Calendula, Chamomile, Echinacea, Spilanthes and Marshmallow Extracts to provide an effective defence against free radical attack.\nDesigned specifically for delicate, irritated and sensitive skin types, Calendula Redness Rescue Calming Mist combats redness whilst refreshing and hydrating the skin. Cucumber and Chamomile Extracts uplift the senses with a fresh aroma whilst restoring moisture and clarity for a healthier complexion.\nAlcohol free, Calendula Redness Rescue Calming Mist is also infused with Aloe and Linseed Extracts which help to support the skin against external factors such as cold, wind and pollution whilst nurturing the skin with Amino Acids and Polysaccharides. Sure to be a Beauty Bay best-seller, Calendula Redness Rescue Calming Mist leaves the skin feeling hydrated, refreshed and comforted.", "product_name": "Calendula Redness Rescue Calming Mist 100ml", "brand": "Jurlique"},
{"price": "HK $52.90", "id": 66, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0024F_1_L.jpg/8639d3773c204630faef1717f844dd2a/COSH0024F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/invigoratebalm/", "product_description": "Como Shambhala Invigorate Balm is a reviving blend of natural oils which helps to uplift the senses.\nDesigned to bring you a perfect dose of well-being on-the-go, Invigorate Balm features Como Shambhala’s exclusive and original blend of Essential Oils to clear the mind and uplift the senses.\nA powerful blend of Eucalyptus, Peppermint, Lavender and Geranium works to clear the mind and allow you to rediscover mental clarity and physical energy whilst enhancing and uplifting your mood.", "product_name": "Invigorate Balm 10ml", "brand": "Como Shambhala"},
{"price": "HK $1011.90", "id": 67, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ARGE0002F_1_L.jpg/e466bf4f4aca42253f8d66e65cbb95f8/ARGE0002F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/argentum/lalotioninfinie/", "product_description": "ARgENTUM La Lotion Infinie is an advanced body cream which offers superior hydration and anti-ageing benefits.\n99.5% Natural, La Lotion Infinie is based on the essence of the award winning La Potion Infinie (sold separately) and provides the same synthesis of powerful ingredients to target problem areas and ultimately refine and rejuvenate the skin.\nSuitable for all skin types and a Beauty Bay must have for a flawless body, La Lotion Infinie is the culmination of many years of research into skin ageing and promotes topical application to combat the principal causes of ageing.\nAn all-encompassing body treatment which targets wrinkles, imperfections and oxidative stress, La Lotion Infinie has a patented formula which harnesses two vital ingredients Silver Hydrosol and DNA HP to offer super hydrating and restorative benefits.\nBased on the work of Nobel Prize winning scientists, DNA HP is a natural marine sourced ingredient which works by trapping a toxic radical, namely Hydroxyl which causes oxidation and degradation of Collagen and Elastin to maintain a youthful body appearance. DNA HP simply attempts to trap water into the skin to promote and increase skin hydration by carrying 10,000 times its weight in water.\nThe ultimate refinement and purity of colloidal Silver, Silver Hydrosol delivers powerful anti-inflammatory and antibacterial properties and effectively fights free radical aggression and promote tissue regeneration.\nLa Lotion Infinie is also enriched with an Antioxidant rich blend of Vitamin E, Sweet Almond and Argan Oil and Shea Butter which work harmoniously to smooth and soften the skin whilst strengthening the natural barrier against free radical attack.\nA body care innovation, this patented body lotion targets problematic areas and makes an exceptional difference to the overall appearance of the skin, leaving it feeling silky soft, firm and deeply hydrated without any sticky or oily residue.", "product_name": "La Lotion Infinie 200ml", "brand": "ARgENTUM"},
{"price": "HK $69.80", "id": 68, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA-tanicongradualspray_1_GL.jpg/006a37934a348efd15a0c5ec0407f32b/tanicongradualspray_1_GL.jpg", "colour": "Tan Icon Gradual Sunless Tanning Spray 118ml – HK $69.80", "product_url": "http://beautybay.com/bathandbody/milliondollartan/tanicongradualsunlesstanningspray/", "product_description": "The original and bestselling Million Dollar Tan sunless tanner.\nExpertly created to give a professional, streak-free glow in the comfort of your own home, the Tan Icon Gradual Sunless Tanning Spray is the easy option for tan-aholics and beginners alike. Formulated with a unique lightweight texture and skin-loving ingredients, the tanning mist boasts an instant bronzed colour that gradually develops into a rich hue, giving you an airbrushed finish that leaves skin feeling and looking good.", "product_name": "Tan Icon Gradual Sunless Tanning Spray", "brand": "Million Dollar Tan"},
{"price": "HK $42.30", "id": 69, "image_url": "http://images.contentful.com/eoaaqxyywn6o/OHKB0022F_1_L.jpg/654a2abc2d7319310e1d2109d3543e9c/OHKB0022F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/ohk/ohkvioletflowerhandmask/", "product_description": "A moisturising mask for tired, over worked hands.\nCreated to intensely nourish and hydrate tired hands, the Oh K! Violet Flower Hand Mask is a one-step treatment to achieving soft, supple skin. Infused with a deeply nourishing serum, the treatment gloves allow for effective penetration into the skin, for hands which are soft, soothed and more youthful in appearance.", "product_name": "Oh K! Violet Flower Hand Mask 25ml", "brand": "Oh K!"},
{"price": "HK $156.40", "id": 70, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0030F_1_L.jpg/b48b5e491167be4283f22703df17f52b/MDTA0030F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/milliondollartan/essentialskit/", "product_description": "A kit that carries all the must-have products for creating a seamless streak-free finish.\nDeveloped by the experts at Million Dollar Tan, the Essentials Kit holds everything you need to create an effortlessly bronzed finish for beginners and tan-addicts alike. Consisting of the original sunless tanning mist, a lightweight tanning lotion, a peppermint scented prepping scrub and a foam brush applicator you will have everything you need from start to finish for professional results.", "product_name": "Essentials Kit 3x118ml", "brand": "Million Dollar Tan"},
{"price": "HK $107.90", "id": 71, "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAJC1265F_1_L.jpg/64321e8f7dd2dce2b22d0387d7a02891/PAJC1265F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/pauljoe/hairbodymist/", "product_description": "Paul & Joe Hair & Body Mist rehydrates and refreshes the hair, body and skin.\nEnriched with French Rose Water Extract, Hair & Body Mist improves troubled skin whilst a blend of Orange Flower Water, Orange Extract, Orange Oil and Honey works to moisturise the skin and provide a cooling, soothing and revitalising sensation.\nThe elegance of Sweet Rose combines harmoniously with the light citrusy aroma of Orange to provide an all over sense of relaxation whilst the gorgeously crisp scent will keep you feeling fresh and fabulous throughout the day.", "product_name": "Hair & Body Mist", "brand": "Paul & Joe"},
{"price": "HK $206.40", "id": 72, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO8121F_1_L.jpg/9cc5cc6292fa8798c907f603a5ebf247/THWO8121F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/deepsleepshowergellimitededition/", "product_description": "A natural shower gel promoting rest and relaxation.\nCleanse the body and mind with Deep Sleep Shower Gel Limited Edition 250ml. This Works' delicately scented shower gel leaves skin soft, moisturised and protected whilst calming the senses for a peaceful night's sleep.", "product_name": "Deep Sleep Shower Gel Limited Edition 250ml", "brand": "This Works"},
{"price": "HK $185.70", "id": 73, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0063F_1_L.jpg/40382aeb3b9e2ce69c1f0662e7372dea/THWO0063F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/perfectheelsrescuebalm/", "product_description": "This Works Perfect Heels Rescue Balm is a rich, hydrating foot balm ideal for dry, cracked heels.\nThis deeply moisturising, fast acting foot treatment features a natural formula enriched with Eco-cert Cotton Thistle Extract, refreshing Lemon Oil and soothing Lavender to help reconstruct the skin barrier.\nPerfect Heels Rescue Balm prevents and repairs dry, cracked skin whilst effectively transforming badly cracked heels into younger looking, healthy feet.", "product_name": "Perfect Heels Rescue Balm 75ml", "brand": "This Works"},
{"price": "HK $97.30", "id": 74, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0101F_1_L.jpg/3de702c7e954d6ca067aa5238156ba21/STTR0101F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/gradualtanmousse/", "product_description": "St.Tropez Gradual Tan Mousse is a light-weight, easy to apply daily self-tan for a long-lasting sun kissed glow.\nInfused with conditioning Aloe Vera and long-lasting colour, Gradual Tan Mousse has a super-lightweight and velvety formula which dries in an instant and builds up to create a perfectly natural looking, streak-free tan.\nInfused with a delicate scent that will seduce the senses, Gradual Tan Mousse breaks the boundaries of what a self-tan should do: this enchanting mousse provides a gradual sun-kissed effect, whilst the creamy lightweight formula smooths onto the skin resulting in a sumptuous finish that will leave you feeling like a Hollywood starlet.\nSupple, subtly tanned skin is only an application away with Gradual Tan Mousse.", "product_name": "Gradual Tan Mousse 200ml", "brand": "St.Tropez"},
{"price": "HK $291.50", "id": 75, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANTI0012F_1_L.jpg/9fe9dcb995932c115001bb7eaf6e4fcc/ANTI0012F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/skincare/antipodes/immortalspf15facebodymoisturiser/", "product_description": "ANTIPODES Immortal SPF15 Face & Body Moisturiser is a natural sun protection cream, for all skin types.\nOffering a high shield of defence against UVA and UVB rays, Immortal SPF15 Face & Body Moisturiser is formulated with Vinanza Performance Plus which is a natural anti-ageing compound which combines Extracts of Kiwi Seeds and Grape Seeds for exceptional antioxidant protection whilst decreasing melanin production which can cause freckling and pigmentation.\nImmortal SPF15 Face & Body Moisturiser also helps to moisturise and hydrate the skin whilst Raspberry Seed Oil protects the skin from sun damage and repairs and nourishes the skin with high levels of Vitamin A, essential Fatty Acids and Omegas 3 & 6.\nFragrance free with a natural formulation, Immortal SPF15 Face & Body Moisturiser leaves the skin thoroughly protected from UV damage with a noticeable improvement in hydration.", "product_name": "Immortal SPF15 Face & Body Moisturiser 50ml", "brand": "Antipodes"},
{"price": "HK $133.30", "id": 76, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA-taniconextremedarkspray_1_GL.jpg/f0768606b9ce73a9b731b32cb02f321a/taniconextremedarkspray_1_GL.jpg", "colour": "Tan Icon Extreme Dark Sunless Tanning Spray 118ml – HK $91.00,\nTan Icon Extreme Dark Sunless Tanning Spray 236ml – HK $133.30", "product_url": "http://beautybay.com/bathandbody/milliondollartan/taniconextremedarksunlesstanningspray/", "product_description": "The original sunless tanning spritz from Million Dollar Tan ideal for deeply bronzed beauties.\nDeveloped to offer an intensely sun kissed hue, the Tan Icon Extreme Dark Sunless Tanning Spray is the perfect bronzing companion for those tanning veterans out there. The weightless, hydrating skin-conscious formula delivers an instant glowing colour that develops into a post Bahama hue making it the perfect sunless tanner for those faking it til they make it.", "product_name": "Tan Icon Extreme Dark Sunless Tanning Spray", "brand": "Million Dollar Tan"},
{"price": "HK $220.10", "id": 77, "image_url": "-", "colour": "Express Bronzing Mousse 50ml – HK $80.40,\nExpress Bronzing Mousse 200ml – HK $220.10", "product_url": "http://beautybay.com/bathandbody/sttropez/expressbronzingmousse/", "product_description": "St.Tropez Express Bronzing Mousse is a revolutionary self-tanning mouse which creates a natural looking tan in as little as an hour.\nA Beauty Bay must-have for a last minute tan, Express Bronzing Mousse lets you control the depth and tone of your tan with the most advanced, no fuss formula to date. Featuring an intelligent Shade Complex which continues to develop once the guide colour has been washed off, Express Bronzing Mousse allows you to say goodbye to stained bed sheets and the prolonged wait for golden skin.\nSuitable for all skin types, this innovative mousse allows you to tan, shower and go in as little as an hour for a light sun-kissed glow, two hours for a medium tan and three hours for a deep, dark bronzed glow.\nGransolve DMI accelerates delivery of the innovative DHA blend to absorb quickly and develop instantly whilst the Vegetan and Vegetan Premium mix creates the optimum blend of 100% Natural Tanning Agents for an easy to apply, quick drying, streak free and customisable tan.\nInfused with moisturising components, Express Bronzing Mousse not only lasts longer than usual at-home tans, whilst a deliciously subtle fragrance banishes any traces of the dreaded fake-tan smell, certifying this mousse as an absolute beauty essential for any sun-kissed cosmetic obsessive.\nSure to be a best-seller, Express Bronzing Mousse also promotes a more even fading process to prevent a patchy tan and leaves you looking and feeling fabulous and flawless.", "product_name": "Express Bronzing Mousse", "brand": "St.Tropez"},
{"price": "HK $275.10", "id": 78, "image_url": "http://images.contentful.com/eoaaqxyywn6o/PTRO0076F_1_L.jpg/5756cd1c0392254f586965e0ee0b65f8/PTRO0076F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/peterthomasroth/blemishbuffingbeads/", "product_description": "Peter Thomas Roth Blemish Buffing Beads is an ultra gentle anti-acne version of Botanical Buffing Beads scrub that can be used on the face or body for the treatment and control of acne.", "product_name": "Blemish Buffing Beads 250ml", "brand": "Peter Thomas Roth"},
{"price": "HK $228.50", "id": 79, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI0034F_1_L.jpg/a712c7834feef502edd6c3341fbd30fb/VILI0034F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/tenminutetan/", "product_description": "A quick and easy gradual tanning lotion.\nSuitable for all skin tones and types Ten Minute Tan is infused with organic ingredients to add a subtle glow that's easily buildable whilst conditioning and nourishing skin. Designed to last for up to 7 days with no patching, streaking or transferring, apply all over the body pre shower for a tan that develops over 4-8 hours.", "product_name": "Ten Minute Tan 150ml", "brand": "Vita Liberata"},
{"price": "HK $147.60", "id": 80, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SCLO0014F_1_L.jpg/a8b75f7e7857eeaf43c74b4a367eefee/SCLO0014F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/scrublove/cacaobodyscrubcacaopeppermint/", "product_description": "A nourishing body scrub.\nWith a mint chocolate fragrance, Cacao Body Scrub Cacao & Peppermint stimulates and softens skin. Cooling and healing, the Peppermint Oil treats irritated skin making it soft, supple and thoroughly moisturised.", "product_name": "Cacao Body Scrub Cacao & Peppermint 200g", "brand": "Scrub Love"},
{"price": "HK $190.40", "id": 81, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0003F_1_L.jpg/7a478e19bdfc7f041b2749e8bfa080d5/COSH0003F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/comfortbodyoil/", "product_description": "Como Shambhala Comfort Body Oil moisturises the skin whilst soothing the senses.\nEnriched with the moisturising benefits of Sweet Almond, Grapeseed and Evening Primrose Oils, Comfort Body Oil also contains Vitamin E to nourish and hydrate the skin. A fatigue relieving blend of Nutmeg, Lavender and Cedarwood Essential Oils indulges tired muscles and soothes irritated skin.\nNon greasy and lusciously lightweight, Comfort Body Oil absorbs deep into the skin, leaving it feeling silky soft, nourished and pampered.", "product_name": "Comfort Body Oil 100ml", "brand": "Como Shambhala"},
{"price": "HK $69.80", "id": 82, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0016F_1_L.jpg/6477f9cf42338e5f4ba4b444d1e917f3/MDTA0016F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/milliondollartan/blendfriendbarriercream/", "product_description": "A lightweight cream designed to prevent self-tan from over-developing on drier areas of the skin.\nExpertly formulated to prevent patches and create a smooth, flawless glow on all areas of the body, the Blend Friend Barrier Cream works to reduce absorption of self-tan on problem areas such as the knees and elbows. Incorporate this into your tanning routine for professional looking results with the ultimate ease.", "product_name": "Blend Friend Barrier Cream 236ml", "brand": "Million Dollar Tan"},
{"price": "HK $385.10", "id": 84, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO8132F_1_L.jpg/f503ce28807bf7a3892be05370adda44/THWO8132F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/deepsleeppillowspray2017ltdedition/", "product_description": "A supersized pillow spray.\nA natural and clinically proven sleep aid, Deep Sleep Pillow Spray 2017 Ltd Edition reduces anxiety. With a Lavender and Camomile scent, soothe yourself to sleep faster and wake up feeling more refreshed after just one use.", "product_name": "Deep Sleep Pillow Spray 2017 Ltd Edition 250ml", "brand": "This Works"},
{"price": "HK $120.60", "id": 85, "image_url": "http://images.contentful.com/eoaaqxyywn6o/GRAL0034F_1_L.jpg/7020d067ab2ca3ace31e6b033c548583/GRAL0034F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/grownalchemist/purifyingbodyexfoliantpearlpeppermintylangylang/", "product_description": "Grown Alchemist Purifying Body Exfoliant Pearl Peppermint & Ylang Ylang is a revitalising body scrub for all skin types, especially oily skin.\nBlissfully free from Parabens and Sulphates, Purifying Body Exfoliant Pearl Peppermint & Ylang Ylang is enriched with a sensuous blend of nutrients and Antioxidants including Botanicals and Pearl Bioactive ingredients which work harmoniously to gently remove dead skin cells.\nAragonite and Conchiolin Proteins derived from Pearl noticeably decongest the skin and improve cell turnover whilst a fusion of Peppermint and Ylang Ylang Essential Oils revive and energise the mind, body and senses.\nSure to be a Beauty Bay best-seller for a softer, smoother and more refined body appearance, Purifying Body Exfoliant Pearl Peppermint & Ylang Ylang leaves the skin soft, smooth and deeply cleansed with a renewed sense of refreshment and well-being.", "product_name": "Purifying Body Exfoliant Pearl Peppermint & Ylang Ylang 170ml", "brand": "Grown Alchemist"},
{"price": "HK $264.50", "id": 86, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MALA0003F_1_L.JPG/914bc5c6c44ca6dfe1c0eab2d0051767/MALA0003F_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/madamelala/westcoastfacebronzingserum/", "product_description": "An instant facial tan.\nAdapting to all skin tones, West Coast Face Bronzing Serum gradually develops. Infused with Coco water and Green Tea, bronze, hydrate and brighten whilst boosting cellular renewal and smoothing the complexion with a delicate coconut scent.", "product_name": "West Coast Face Bronzing Serum 100ml", "brand": "Madame LA LA"},
{"price": "HK $241.80", "id": 87, "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAIS0052F_1_L.jpg/03999334a87671e60402fa157e14f70f/PAIS0052F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/paiskincare/comfreycalendulacalmingbodycream/", "product_description": "A moisturiser for dry skin.\nFormulated with organic plant oils and butters, Comfrey & Calendula Calming Body Cream combats itchiness and irritation. With a rich and nourishing texture, apply regularly over affected areas for visible relief.", "product_name": "Comfrey & Calendula Calming Body Cream 200ml", "brand": "Pai Skincare"},
{"price": "HK $148.10", "id": 88, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0040F_1_L.jpg/f50a03dc19c659c1af548d0f5f589db6/COSH0040F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/sheltershowergel/", "product_description": "Como Shambhala Shelter Shower Gel is a gentle body cleanser enriched with a balancing fusion of Essential Oils.\nThis natural shower gel allows you to cleanse and rebalance each morning with a soothing blend of Eucalyptus, Peppermint, Ginger and Basil Essential Oils. Perfect for relaxing tired muscles and relieving tension and fatigue, Shelter Shower Gel leaves the skin gently cleansed and nourished.\nFree from Parabens, Silicones and synthetic ingredients, Shelter Shower Gel leaves the skin hydrated and supple with a radiant glow whilst stress and tension are relieved from the mind for a sense of emotional clarity and well-being.", "product_name": "Shelter Shower Gel 300ml", "brand": "Como Shambhala"},
{"price": "HK $285.70", "id": 89, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI-vitaliberataphenomenal23weekmousse_1_GL.jpg/a9695cc6985e94419e9080eb0b16788e/vitaliberataphenomenal23weekmousse_1_GL.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/phenomenallightasair23weektanmoussefair/", "product_description": "An incredibly long lasting tanning mousse ideal for light skin tones.\nCreated with innovative pHenO2 technology which delivers an anti-aging bronzed glow lasting up to three weeks, pHenomenal Light As Air 2-3 Week Tan Mousse glides over the skin's surface providing a streak free instant tan that continues to develop. Quick drying and odour free you can apply and go within minutes.", "product_name": "pHenomenal Light As Air 2-3 Week Tan Mousse Fair 125ml", "brand": "Vita Liberata"},
{"price": "HK $292.30", "id": 90, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0216F_1_L.jpg/2a600b3a98de1076346a44191a9c968b/THWO0216F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/intransitrevivingshowergel/", "product_description": "This Works In Transit Reviving Shower Gel is a gentle Sulphate free body cleanser perfect for all skin types.\nRefreshing and calming, In Transit Reviving Shower Gel leaves the skin feeling moisturised, hydrated and silky soft. This lightly fragranced gel is infused with Essential Oils of zesty Mandarin which helps to ease daily tension whilst Bergamot and Ho Wood entice the senses.\nPerfect for everyday use, indulge yourself with this environmentally friendly cleanser and see the results with astonishingly supple skin and a rejuvenated mind and body.", "product_name": "In Transit Reviving Shower Gel 300ml", "brand": "This Works"},
{"price": "HK $69.80", "id": 91, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0017F_1_L.jpg/72122e18851d99a2cd7388f1b83dc7b2/MDTA0017F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/milliondollartan/blendfriendbarrieroil/", "product_description": "A nourishing preparation oil that helps to create a seamless, streak-free tan.\nDesigned to moisturise and hydrate even the driest of skin, the Blend Friend Barrier Oil is an essential step to creating a professional looking tan with ease. Applied to the areas where the tan is most likely to over-develop, the unique formula limits the skin's absorption of tanning ingredients to prevent colour from becoming too dark or uneven. Used every time you tan, the weightless oil ensures an effortless finish every time.", "product_name": "Blend Friend Barrier Oil 236ml", "brand": "Million Dollar Tan"},
{"price": "HK $135.70", "id": 92, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0085F_1_L.jpg/0627f57e624551763d100673a1a2a07d/JURL0085F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/jasmineshowergel/", "product_description": "Jurlique Jasmine Shower Gel is a gentle body cleanser with a soothing scent of Jasmine to clarify and refresh all skin types.\nThis luscious cleansing foam is enriched with Soap Bark and Horse Chestnut which lather on contact for effective cleansing. Grapefruit Seed Extract helps clarify and refresh skin whilst Hydrolysed Soy Protein and Honey help smooth, soften and rebalance dry skin.\nJasmine Shower Gel is infused with beneficial antioxidants which protect, revive and invigorate skin which the sensual aroma of Jasmine is imparted leaving skin feeling soft, firm, smooth and supple.", "product_name": "Jasmine Shower Gel 300ml", "brand": "Jurlique"},
{"price": "HK $771.30", "id": 93, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TALI0094F_1_L.JPG/c204404870f007faf86b6dab8f10864d/TALI0094F_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/talika/eyebrowlipocilsplatinium/", "product_description": "An eyebrow growth serum.\nWith both a day and night treatment, Eyebrow Lipocils Platinium creates fuller, thicker and darker eyebrows. Stimulating new growth, maximise the number of visible brow hairs whilst boosting natural pigmentation for effortless, enviable brows.", "product_name": "Eyebrow Lipocils Platinium 2 X 8.5ml", "brand": "Talika"},
{"price": "HK $174.60", "id": 94, "image_url": "http://images.contentful.com/eoaaqxyywn6o/PTRO0138F_2_L.jpg/143ec210a7a531e8f2643d5836f8a1e8/PTRO0138F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/peterthomasroth/megarichbodycleanser/", "product_description": "Peter Thomas Roth Mega Rich Body Cleanser is a Vitamin infused shower/bath wash which cleanses and revitalises skin.\nUniquely enhanced with Vitamins A, C & E this luxurious Mega Rich Body Cleanser  intensely moisturises skin whilst Pro Vitamin B5 nourishes and smoothes skin.\nInfused with a deliciously refreshing scent Mega Rich Body Cleanser thoroughly cleanses skin leaving it revitalised, moisturised and silky soft.", "product_name": "Mega Rich Body Cleanser 250ml", "brand": "Peter Thomas Roth"},
{"price": "HK $165.00", "id": 95, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0069F_2_L.jpg/61f83c1c8cb2a30ac6b139031d1af4ea/STTR0069F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/selftanluxedryoil/", "product_description": "St.Tropez Self Tan Luxe Dry Oil is an indulgent tanning oil which creates a natural golden glow.\nNon-greasy and deeply nourishing, Self Tan Luxe Dry Oil is the ultimate way to achieve a natural looking luminous glow which lasts for days. Suitable for all skin tones, Self Tan Luxe Dry Oil has a quick drying formula which is naturally fragranced with Essential Oils and is clinically proven to moisturise the skin for up to one week.\nParaben and Sulphate free, Self Tan Luxe Dry Oil is enriched with Natural Neroli, Lemongrass and Grapefruit Essential Oils and improves suppleness in all skin types whilst lending your limbs an instant shimmering glow for those occasions when you need to look great from the word go. Once this decadent self tan has fully developed simply wash off the subtle shimmer which acts as a guide colour to reveal a beautiful golden tan.\nEnriched with a 100% natural Tanning Agent, Self Tan Luxe Dry Oil has a Brazilian inspired formula which glides onto the skin evenly and develops into a lusciously even, streak free tan with a luminous, sensual glow.", "product_name": "Self Tan Luxe Dry Oil 100ml", "brand": "St.Tropez"},
{"price": "HK $147.60", "id": 96, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SCLO0009F_1_L.jpg/70cf603587dec79214175fd410ab75c3/SCLO0009F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/scrublove/activecharcoalbodyscrubpricklypear/", "product_description": "A purifying body scrub.\nBinding charcoal and impurities, Active Charcoal Body Scrub Prickly Pear gently clears pores. Bursting with Vitamin E, the 100% natural body scrub removes toxins from all skin types whilst simultaneously balancing and revitalising.", "product_name": "Active Charcoal Body Scrub Prickly Pear 200g", "brand": "Scrub Love"},
{"price": "HK $69.80", "id": 97, "image_url": "http://images.contentful.com/eoaaqxyywn6o/cosmoprixdebeaute_1_L.jpg/8144014cd52a83aca6dbbe38a9ea3d20/cosmoprixdebeaute_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/starskin/hollywoodhandmodelnourishingdoublelayertechnologyhandmaskgloves/", "product_description": "StarSkin Hollywood Hand Model Nourishing Double Layer Technology Hand Mask Gloves are unique, patented hand treatment which hydrates, nourishes and repairs your hands and cuticles.\nUtilising Double Layer Technology which creates a sauna effect for the hands, Hollywood Hand Model Nourishing Double Layer Technology Hand Mask Gloves effectively deliver skin treating, powerhouse serum deep into the skin to improve hydration and suppleness in just 15 minutes.\nYour hands will be one of the first areas of the body to show significant signs of ageing; Hollywood Hand Model Nourishing Double Layer Technology Hand Mask Gloves are a patented, serum infused pair of gloves which infuse hard working hands with softening Shea Butter and a blend of 16 Botanical Extracts and Oils to wrap the hands in deep nourishment.\nThe dual layers of this hand treatment works to repair, rejuvenate and soften even the roughest of hands whilst conditioning thecuticles for a manicured appearance. A moisturising blend of Goji Berry, Macadamia Nut and Olive Oil deeply nourish the hands whilst Liquorice and Peony Roots work harmoniously to heal and brighten the hands so they no longer give away your age.", "product_name": "Hollywood Hand Model Nourishing Double Layer Technology Hand Mask Gloves 1pair", "brand": "STARSKIN"},
{"price": "HK $439.40", "id": 98, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/tanluxethebody_1_gl.jpg", "colour": "Light-Medium 50ml – HK $439.40,\nMedium-Dark 50ml – HK $439.40", "product_url": "http://beautybay.com/bathandbody/tanluxe/thebody/", "product_description": "A bottle of tanning body drops.\nTransforming dull, dry skin, The Body mixes with regular moisturisers and oils to lock in hydration and colour. With skin firming benefits, add as desired to create a natural, buildable tan and a firmer, toned finish.", "product_name": "The BODY", "brand": "TAN-LUXE"},
{"price": "HK $74.00", "id": 99, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABB-mauibabeamazingafterbrowninglotion_1_gl.jpg/af00a9cc6e887143f301b958aedeaeb3/mauibabeamazingafterbrowninglotion_1_gl.jpg", "colour": "Amazing After Browning Lotion 118ml – HK $74.00", "product_url": "http://beautybay.com/bathandbody/mauibabe/amazingafterbrowninglotion/", "product_description": "Maui Babe Amazing After Browning Lotion is a soothing, hydrating cream for all skin types.\nFormulated with soothing Aloe Vera, vitamins and nourishing tropical oils, it nourishes and rehydrates tanned skin, preventing peeling and flaking. Sun, salt and wind damaged skin is helped to heal and your tan is maintained and prolonged.\nUse this year round for softer, smoother skin.", "product_name": "Amazing After Browning Lotion", "brand": "Maui Babe"},
{"price": "HK $321.10", "id": 100, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0217F_1_L.jpg/9ec79da85dbe320575843a8ee1cc84d3/JURL0217F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/activatingwateressence/", "product_description": "An innovative, lightweight water-based skincare booster ideal for all skin types.\nCreated to enhance the effects of your serum and moisturiser, the Activating Water Essence is an additional step in your skincare routine that will change your skin for the better. Applied after toner, the unique liquid offers an additional layer of hydration as well as conditioning benefits that boost your skin's capability to absorb nutrients from your skincare for a rejuvenated finish.", "product_name": "Activating Water Essence 150ml", "brand": "Jurlique"},
{"price": "HK $124.80", "id": 101, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA-mermaidmoussegradualmousse_1_GL.jpg/560cb9e7c7000777b207519341a40d20/mermaidmoussegradualmousse_1_GL.jpg", "colour": "Mermaid Mousse Gradual Sunless Tanning Mousse 118ml – HK $91.00,\nMermaid Mousse Gradual Sunless Tanning Mousse 207ml – HK $124.80", "product_url": "http://beautybay.com/bathandbody/milliondollartan/mermaidmoussegradualsunlesstanningmousse/", "product_description": "An incredibly nourishing tanner for a sun-kissed glow.\nDeveloped to produce a streak-free tan every time, the Mermaid Mousse Gradual Sunless Tanning Mousse is must-have for tan addicts and beginners alike. Created with a host of nourishing botanicals, the high performance formula provides an instant holiday glow whilst working to develop a much richer colour over a period of six to eight hours. A tan that keeps the skin happy, hydrated and effortlessly bronzed, what more could you want?", "product_name": "Mermaid Mousse Gradual Sunless Tanning Mousse", "brand": "Million Dollar Tan"},
{"price": "HK $317.40", "id": 103, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MALA0002F_1_L.JPG/c0f1e3ea4e70cfd3eac6fe405a52324c/MALA0002F_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/madamelala/selftanmousselight/", "product_description": "A long-lasting false tan.\nDeveloping in three hours, Self Tan Mousse is lightweight and quick drying. Formulated with hydrating ingredients, apply evenly over clean, dry skin for a natural, golden glow that lasts for up to 10 days.", "product_name": "Self Tan Mousse Light 200ml", "brand": "Madame LA LA"},
{"price": "HK $52.90", "id": 104, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0111F_1_L.jpg/d6d152515bb3cb989676d8ee0fcedcbe/STTR0111F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/expresssheetmask/", "product_description": "A tanning face mask.\nThe first of its kind, St Tropez's Express Sheet Mask is an easy and convenient way to tan your face. Allowing ultimate control, decide the intensity of the tan whilst the nourishing ingredients hydrate the skin for instant and effective results.", "product_name": "Express Sheet Mask 20g", "brand": "St.Tropez"},
{"price": "HK $135.70", "id": 105, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0054F_1_L.jpg/5d25cdcc8d954630f83aaedf138a933a/JURL0054F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/citrusshowergel/", "product_description": "Jurlique Citrus Shower Gel is a refreshing body cleanser which clarifies and revitalises skin.\nInfused with an uplifting scent of Lemon and Grapefruit, Citrus Shower Gel refreshes, clears and hydrates skin. This gentle, hydrating body cleanser is formulated with Sodium Laureth Sulfate and Decyl Polyglucoside; these mild foaming agents are derived from Coconut and effectively cleanse skin without irritation.\nChamomile, Macadamia and Jojoba Oils soften, calm and hydrate skin whilst Rosemary and Lemon Balm invigorate, refresh and rebalance oiliness. Citrus Shower Gel leaves skin feeling silky, smooth and refreshed.", "product_name": "Citrus Shower Gel 300ml", "brand": "Jurlique"},
{"price": "HK $467.60", "id": 106, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COOL-coolamineralfacerosiliancetint_1_GL.JPG/3a984b7bb1f5998f2fb9c75415f76d32/coolamineralfacerosiliancetint_1_GL.JPG", "colour": "Light-Medium 45ml – HK $467.60,\nMedium-Dark 45ml – HK $467.60", "product_url": "http://beautybay.com/bathandbody/coola/mineralfacerosilliancetintspf30/", "product_description": "A tinted facial sun cream.\nEvening skin tone and creating a radiant glow, Mineral Face Rosilliance Tint SPF30 covers and protects. With a sheer tinted finish, apply directly on to skin for the perfect summer makeup solution.", "product_name": "Mineral Face Rosilliance Tint SPF30", "brand": "COOLA"},
{"price": "HK $97.10", "id": 107, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0020F_1_L.jpg/277bd820795f7d8c16b8a2d2c62e1765/MDTA0020F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/milliondollartan/shadeupgradeextremedarkfoundationbooster/", "product_description": "A deep bronze foundation adjuster to ensure a perfect makeup match to your self-tan.\nDeveloped to eliminate the need to buy a new foundation every time you tan, the Shade Upgrade Extreme Dark Foundation Booster is a true tone matching essential. Simply mix a couple of drops with your favourite foundation until your shade completely matches the rest of your new bronzed hue and apply as you normally would for a perfectly balanced finish without the need to spend more.", "product_name": "Shade Upgrade Extreme Dark Foundation Booster 50ml", "brand": "Million Dollar Tan"},
{"price": "HK $285.70", "id": 108, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI-vitaliberataphenomenal23weekmousse_1_GL.jpg/a9695cc6985e94419e9080eb0b16788e/vitaliberataphenomenal23weekmousse_1_GL.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/phenomenallightasair23weektanmoussedark/", "product_description": "An incredibly long lasting tanning mousse ideal for deep skin tones.\nCreated with innovative pHenO2 technology which delivers an anti-aging bronzed glow lasting up to three weeks, pHenomenal Light As Air 2-3 Week Tan Mousse glides over the skin's surface providing a streak free instant tan that continues to develop. Quick drying and odour free you can apply and go within minutes.", "product_name": "pHenomenal Light As Air 2-3 Week Tan Mousse Dark 125ml", "brand": "Vita Liberata"},
{"price": "HK $42.30", "id": 109, "image_url": "http://images.contentful.com/eoaaqxyywn6o/KOCO0001F_1_L.jpg/ea23e4741b6a264ef99d00e00187fa7b/KOCO0001F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/kocostar/5fingernailpack/", "product_description": "An innovative treatment mask for stressed nails.\nWith ten individual pockets perfectly sized for each finger, the 5Finger Nail Pack is an innovative and effective way to intensely treat nails. Enveloped in a rich serum these pockets deliver an array of vitamins and botanicals that work together to deeply penetrate, strengthening and preventing peeling and splitting of brittle nails.", "product_name": "5Finger Nail Pack", "brand": "Kocostar"},
{"price": "HK $76.10", "id": 110, "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO-yestoblueberriesultrahydratingbodywash_3_gl.jpg/3a7938efb12b9fe55329421a9b55d981/yestoblueberriesultrahydratingbodywash_3_gl.jpg", "colour": "Blueberries Ultra Hydrating Body Wash 500ml – HK $76.10", "product_url": "http://beautybay.com/bathandbody/yesto/blueberriesultrahydratingbodywash/", "product_description": "Yes To Blueberries Ultra Hydrating Body Wash is a luxurious body cleanser which pampers the skin.\nSuitable for use as a daily shower gel or an indulgent bubble bath, Blueberries Ultra Hydrating Body Wash is packed with Antioxidant rich Blueberries which help to fight the formation of free radicals that can damage the skin’s microstructure and helps to protect against environmental damage with high levels of Vitamin C.\n95% Natural and formulated without Petrolatum, Sulphates and Parabens, Blueberries Ultra Hydrating Body Wash is ideal for dry skin types and utilises Shea Butter to protect the skin from dehydration whilst restoring suppleness and improving the appearance of dryness. Blueberries Ultra Hydrating Body Wash pampers the skin with some serious decadence, leaving it beautifully soft, nourished and moisturised.", "product_name": "Blueberries Ultra Hydrating Body Wash", "brand": "Yes To"},
{"price": "HK $52.90", "id": 111, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0021F_1_L.jpg/bffadb1244a83866a243ffa4c32d3140/COSH0021F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/calmbalm/", "product_description": "Como Shambhala Calm Balm is an aromatherapy balm which rebalances your senses.\nFeaturing a reassuring blend of Lavender, Bergamot, Geranium and Marjoram, Calm Balm helps to relieve tension and provide a quick stress relief to bring you a perfect dose of renewed well-being whilst on-the-go.\nFree from Parabens, Silicones and Sulphates, Calm Balm has a 100% natural formulation and is ideal for a quick stress relieving fix throughout the day.", "product_name": "Calm Balm 10ml", "brand": "Como Shambhala"},
{"price": "HK $366.60", "id": 112, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/talu0015f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/tanluxe/thegloss/", "product_description": "An instant tanning highlighter.\nDesigned for both the face and body, The Gloss is a multi-tasking tanning stick. Simultaneously bronzing and illuminating, sweep as desired for instant results and deep, long-lasting hydration.", "product_name": "The GLOSS 75ml", "brand": "TAN-LUXE"},
{"price": "HK $137.00", "id": 113, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SCLO0008F_1_L.jpg/d912588307200d3e8ed1deaaa874b322/SCLO0008F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/scrublove/coconutbodyscrubcoconutmango/", "product_description": "A body scrub for normal to dry skin.\nProtecting from environmental and weather damage, Coconut Body Scrub Coconut Mango exfoliates and moisturises. With a tropical scent, the conditioning body scrub removes dry, dead skin and stimulates cell turnover. Infused with natural mango butter, work deep into skin to soften, soothe and hydrate.", "product_name": "Coconut Body Scrub Coconut Mango 200g", "brand": "Scrub Love"},
{"price": "HK $75.40", "id": 114, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SUPG0003U_2_L.jpg/2653686e1e6b40ac297f3d4388865f09/SUPG0003U_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/supergoop/acaifusionlipbalmspf30/", "product_description": "Supergoop! AcaiFusion Lip Balm SPF 30 hydrates and nourishes the lips at a cellular level whilst imparting highly effective sun protection.\nGentle on the delicate skin yet powerfully effective, AcaiFusion Lip Balm SPF 30 glides onto the lips, delivering layer-deep hydration, providing a plumper, more conditioned finish that will leave you with a truly kissable pout. Formulated using SPF 30, this moisturising lip balm protects the delicate skin against the damaging effects of the sun, whilst the inclusion of a sheer pink tint gives the mouth a pop of colour that will leave everyone in awe.\nInfused with Acai Berry, AcaiFusion Lip Balm SPF 30 defends the lips against damaging environmental radicals, whilst Shea Butter conditions even the driest of lips, making this balm ideal for use both on its own or partnered with your signature lipstick.\nGet the lips you deserve with AcaiFusion Lip Balm SPF 30.", "product_name": "AcaiFusion Lip Balm SPF 30 15ml", "brand": "Supergoop!"},
{"price": "HK $211.10", "id": 115, "image_url": "http://images.contentful.com/eoaaqxyywn6o/FRBO0007F_1_L.jpg/28292c26d9394edd959f79ba03b53679/FRBO0007F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/frankbody/coconutbodybalm/", "product_description": "A hydrating body moisturiser.\nTo be used any and everywhere, Coconut Body Balm deeply nourishes the arms, legs and body. Smoothing the skin and depositing a soft, subtle glow, apply over the cheekbones for a dewy finish or the ends of hair to nourish and protect.", "product_name": "Coconut Body Balm 100ml", "brand": "Frank Body"},
{"price": "HK $95.10", "id": 116, "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO0128F_2_L.jpg/fcdf486fbb070a5d22b5e6e5a8ce28ad/YETO0128F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/yesto/coconutpolishingbodyscrub/", "product_description": "Yes To Coconut Polishing Body Scrub is a moisture rich body exfoliator ideal for very dry skin types.\nInfused with Coconut Husk, a natural exfoliant from the Coconut Shell, Coconut Polishing Body Scrub gently exfoliates the skin without irritation to reveal softer, smoother, healthier looking skin. Using nearly all the components of a Coconut, this tropical scented body scrub uses Virgin Coconut Oil to provide the skin with vital nutrients to stay hydrated whilst Sweet Almond Oil offers natural moisturisation.\nCruelty free, 98% Natural and formulated without Parabens or Sulphates, Coconut Polishing Body Scrub is perfect for those looking for a dose of tropical hydration to their bathing regime and leaves the skin looking and feeling silky soft and smooth.", "product_name": "Coconut Polishing Body Scrub 280g", "brand": "Yes To"},
{"price": "HK $145.70", "id": 117, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0111F_1_L.jpg/23703ec5fbaf85043df66d2723571594/JURL0111F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/rosemoistureplusmoisturisingcleanser/", "product_description": "Jurlique Rose Moisture Plus Moisturising Cleanser is a high performance cleanser which dissolves impurities and moisturises skin.\nFeaturing a lightly whipped formulation of Rose Hip Oil and Willow Bark Extract this luxuriously hydrating cleanser provides immediate and long lasting hydration to the surface of the skin whilst dissolving impurities and enhancing cell turnover.\nWith continued use the overall skin texture is improved as Rose Moisture Plus Moisturising Cleanser combines an antioxidant complex with the micro-fine exfoliation process of Pumice which gently polishes and smoothes the skin. Avocado Oil and Green Tea Extract work together to protect and recondition the skin.\nThis high performance foaming cleanser leaves skin looking revitalised and visibly smoother and feeling lusciously hydrated and refreshed.", "product_name": "Rose Moisture Plus Moisturising Cleanser 100ml", "brand": "Jurlique"},
{"price": "HK $258.00", "id": 118, "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAIS0045F_1_L.jpg/89e45401b1e6eda691eec5b1da2b0a5c/PAIS0045F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/paiskincare/petitpaiapplemallowblossomhairbodywash/", "product_description": "A nourishing hair and body wash created to gently cleanse your baby's delicate skin and scalp.\nFormulated to offer skin loving hydration, the Petit Pai Apple & Mallow Blossom Hair & Body Wash offers an extremely gentle cleansing experience. Designed to uphold the natural pH balance of your little one's skin, the mild botanicals deliver a unique rich lather for a soothing yet fun bath time experience.", "product_name": "Petit Pai Apple & Mallow Blossom Hair & Body Wash 200ml", "brand": "Pai Skincare"},
{"price": "HK $289.00", "id": 119, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SUPG0007F_1_L.jpg/c6d22f9d9018ad5573930277edd4c0eb/SUPG0007F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/supergoop/dailycorrectcccreamspf35/medium-dark", "product_description": "Supergoop! Daily Correct CC Cream SPF 35 is a powerful sun-protector that also creates a veil of perfection for the complexion.\nDiminishing the appearance of discolouration and uneven skin tone, Daily Correct CC Cream SPF 35 utilises a tinted formula to craft an aesthetically flawless finish for the face whilst defending even the deepest layers of the skin from damaging UV-rays.\nInfused with Omegas 3 and 6, Daily Correct CC Cream SPF 35 penetrates the skin with Essential Fatty Acids, resulting in a clearer, purified effect that will enhance the complexion's natural beauty and youthfulness.\nLight-diffusing Mica Minerals present the skin with a lit-from-within glow whilst the inclusion of SPF 35 ensures that this effective cream guards the complexion against harmful sun rays, thus preventing the development of expression lines and hyperpigmentation.\nProtect and perfect with the revolutionary Daily Correct CC Cream SPF 35 which is sure to become a handbag staple for all.", "product_name": "Daily Correct  CC Cream SPF 35 47ml", "brand": "Supergoop!"},
{"price": "HK $292.30", "id": 120, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO8135F_1_L.jpg/bb811f808e120729ebb7fa9b0650d9bb/THWO8135F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/sleepplusbodytreatments/", "product_description": "A collection of sleep treatments.\nRest and renew the mind, body and skin with Sleep Plus Body Treatments. Helping to tackle dull, dry and aging skin, each travel-sized product is designed to simultaneously calm and soothe for an uninterrupted night's sleep. Use often and together to optimise skin's performance and wake up feeling and looking refreshed.", "product_name": "Sleep Plus Body Treatments", "brand": "This Works"},
{"price": "HK $133.20", "id": 121, "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO0130F_1_L.jpg/fc48dc8f1ec10c8b4e1448fd6249c870/YETO0130F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/yesto/coconutheadtotoerestoringbodybalm/", "product_description": "Yes To Coconut Head to Toe Restoring Body Balm is a super moisturising body balm which is clinically proven to heal and hydrate dry and cracked skin.\n98% Natural and formulated with Virgin Coconut, Sweet Almond and Avocado Oils, Coconut Head to Toe Restoring Body Balm provides a much needed moisture boost to dry elbows, hands, needs or toes and anywhere else experience dry and cracked skin.\nFree from Petroleum, SLS and Parabens, Coconut Head to Toe Restoring Body Balm is also enriched with Shea Butter and Cocoa Seed Butter which helps to protect against dehydration and restore suppleness.\nIdeal for moisturising and nurturing the skin whilst on the go, Coconut Head to Toe Restoring Body Balm also includes a handy applicator which reaches troubled areas easily and laves the skin feelng soft and harmonised.", "product_name": "Coconut Head to Toe Restoring Body Balm 85g", "brand": "Yes To"},
{"price": "HK $266.00", "id": 122, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SICO0003F_1_L.jpg/f587c58b4ceaded2d1c8d87eee60b70a/SICO0003F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sisterco/rawcoconutmatchagreenteasugarscrub/", "product_description": "Intensely nourishing and hydrating, a raw scrub that works to remove dead skin cells.\nDeveloped with a unique collection of antioxidant rich ingredients, the Raw Coconut & Matcha Green Tea Sugar Scrub envelops the body with a number of skin-loving benefits. From hydrating the skin to gently removing dead skin cells on the surface, this is an essential for all your exfoliating needs.", "product_name": "Raw Coconut & Matcha Green Tea Sugar Scrub 300g", "brand": "Sister & Co."},
{"price": "HK $147.60", "id": 123, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SCLO0010F_1_L.jpg/d8113a2dc2b1bfbb330d95aa8380d985/SCLO0010F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/scrublove/activecharcoalbodyscrubavocadoaloevera/", "product_description": "A soothing body scrub.\nFormulated with gentle clays, Active Charcoal Body Scrub Avocado & Aloe Vera clears and soothes the skin. Regularly massaged into the body, the universal scrub absorbs oils and impurities whilst soothing and healing with antioxidant rich oils.", "product_name": "Active Charcoal Body Scrub Avocado & Aloe Vera 200g", "brand": "Scrub Love"},
{"price": "HK $460.80", "id": 124, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0010F_4_L.jpg/070a2133918851a1e12c6225dc3d1d39/THWO0010F_4_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/skindeepdrylegoil/", "product_description": "This Works Skin Deep Dry Leg Oil is an award-winning, deeply moisturising natural body oil which transforms dull, dry skin.\nFormulated with a highly concentrated, 100% natural blend of Essential and Plant Oils, Skin Deep Dry Leg Oil targets dry, rough and undernourished skin on the legs and body and works to enhance and rehydrate dull skin.\nSkin Deep Dry Leg Oil uses no less than nine exotic Essential Oils blended with a deeply nourishing fusion of seven pure cold-pressed Plant Oils high in Vitamins and GLAs. Among them are anti-ageing Moroccan Rose, nourishing Indian Sandalwood, regenerative and blemish-defying Indonesian Patchouli and costly Tuberose. Evening Primrose, Macadamia and Pure Coconut Oil work to rehydrate the skin and restore healthy moisture levels.\nIdeal for dry elbows, knees and shins and suitable for all skin types, Skin Deep Dry Leg Oil enhances neglected legs and leaves the skin looking silky smooth and regenerated with a radiant glow.\n", "product_name": "Skin Deep Dry Leg Oil 120ml", "brand": "This Works"},
{"price": "HK $116.70", "id": 125, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0063F_1_L.jpg/2bda6e79511fbe50c1532fc969c79ed9/MABA0063F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/walnutbodylotion/", "product_description": "Mario Badescu Walnut Body Lotion (177ml) is an extremely rich body lotion formulated to help moisturize rough, dry skin without leaving a greasy film.", "product_name": "Walnut Body Lotion", "brand": "Mario Badescu"},
{"price": "HK $105.70", "id": 126, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABB-mauibabeamazingbrowninglotion_1_gl.jpg/2b3d494820b2a454425b9ce98fd9c08d/mauibabeamazingbrowninglotion_1_gl.jpg", "colour": "Amazing Browning Lotion 118ml – HK $105.70", "product_url": "http://beautybay.com/bathandbody/mauibabe/amazingbrowninglotion/", "product_description": "Maui Babe Amazing Browning Lotion is a tan accelerating lotion, suitable for all skin types.\nFormulated with all natural Hawaiian ingredients, this lotion works to speed up the sun triggered tanning process in the skin so you can get a real, natural deep tan in a much shorter length of time. Safe for all skin types and ideal for use with", "product_name": "Amazing Browning Lotion", "brand": "Maui Babe"},
{"price": "HK $166.10", "id": 127, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SICO0009F_1_L.jpg/4d470ff61bc780fb2813a2d63f88bda9/SICO0009F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sisterco/dreamcreamformothersbabies/", "product_description": "A soothing and moisturising organic cream for you and your little ones.\nCreated to offer you a multi-purpose skincare option that you and your baby can enjoy, the Dream Cream For Mothers & Babies is an essential for any changing bag. The intensely caring formula can be used on any ailment from cradle cap to dry and sore nappy rash, as well as on yourself as a super nourishing moisturiser.", "product_name": "Dream Cream For Mothers & Babies 60ml", "brand": "Sister & Co."},
{"price": "HK $122.70", "id": 128, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0107F_1_L.jpg/4bad87429a56e6882071ffcd8c1376c4/STTR0107F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/gradualtanplusluminousveil/", "product_description": "An illuminating face cream.\nWith light reflecting pearls, Gradual Tan Plus Luminous Veil brightens and evens the complexion. Gentle on skin, it can be massaged in daily for a gradual, sun kissed glow that's suitable for all skin tones and moisturises for up to 24 hours.", "product_name": "Gradual Tan Plus Luminous Veil 50ml", "brand": "St.Tropez"},
{"price": "HK $733.20", "id": 129, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0164U_1_L.jpg/ac422e1e8bd5082367b732801feb53ef/MABA0164U_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/skincare/mariobadescu/mbfavoriteskit/", "product_description": "Mario Badescu MB Favorites Kit is a complete skincare regime for normal and combination skin types.\nFeaturing an array of number 1 best-sellers, MB Favorites Kit is packaged in a reusable tote bag and is the perfect introduction to Mario Badescu. MB Favorites Kit combines a cleanser, toner and moisturiser with hand and body creams and also includes a bath sponge and compact mirror.", "product_name": "MB Favorites Kit", "brand": "Mario Badescu"},
{"price": "HK $141.00", "id": 130, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0071F_1_L.jpg/9077554c546983feb4b633414813687f/THWO0071F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/sleepbalm/", "product_description": "This Works Sleep Balm is a powerful, multipurpose skin balm which calms and relaxes the nerves and senses.\nSeek solace from the trials and tribulations of everyday life and stresses with this relaxing pulse point balm. Formulated with aroma-therapeutic benefits of Lavender, Monoi and Coconut Oils, Sleep Balm nurtures the skin, body and mind, allowing you to unwind and drift into a peaceful nights slumber.\nInner peace is the key to outer beauty; Sleep Balm hydrates and protects the skin and calms your senses so you wake looking fresh and revitalised by morning.", "product_name": "Sleep Balm 8.6g", "brand": "This Works"},
{"price": "HK $37.10", "id": 131, "image_url": "http://images.contentful.com/eoaaqxyywn6o/HOHO0023F_1_L.jpg/69f29e27e773adff918557c9e0b626fe/HOHO0023F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/holikaholika/babysilkyhandmasksheet/", "product_description": "Sheet masks for dry, rough hands.\nWith high concentrates of moisturising ingredients, Baby Silky Hand Mask Sheet transforms dry, damaged hands. Containing two disposable sheet masks, apply to both hands for up to 20 minutes for silky soft skin.", "product_name": "Baby Silky Hand Mask Sheet 15ml", "brand": "Holika Holika"},
{"price": "HK $144.40", "id": 132, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0093F_1_L.jpg/1b23ab56f65c5629658efad11bb151cc/MABA0093F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/specialcleansinglotiono/", "product_description": "Mario Badescu Special Cleansing Lotion O (236ml) is a body astringent especially developed to treat back and chest acne.\nWith daily use, this extra strength lotion works to clean, clear and reduce acne on the back and chest areas, whilst also preventing new blemishes from appearing.\nFor fast results to clear body acne, wash gently with AHA Botanical Body Soap first, wipe the affected areas with Special Cleansing Lotion O and then apply Drying Mask 2-3 times a week. Additional acne products such as Buffering Lotion and Drying Lotion can also be used.", "product_name": "Special Cleansing Lotion O", "brand": "Mario Badescu"},
{"price": "HK $170.90", "id": 133, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SUPG0012F_1_L.jpg/f2c70a9d31ceb31b3e502859bfb89194/SUPG0012F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/supergoop/shineonlipscreenspf50/", "product_description": "A water resistant sun shield for the lips.\nDesigned to be worn alone or over the top of your favourite lip colour Shine On Lip Screen SPF50 glides across the pout to produce a soft natural sheen. Enriched with skin loving ingredients the unique formula combines nourishment and protection all in one so you can feel stylishly protected in the sun.", "product_name": "Shine On Lip Screen SPF50 4ml", "brand": "Supergoop!"},
{"price": "HK $180.90", "id": 134, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0056F_1_L.jpg/662ad16cc60c8f9712cad7c588fbb7c0/JURL0056F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/bodyexfoliatinggel/", "product_description": "Jurlique Body Exfoliating Gel deeply cleanses and lifts away dead skin cells for softer, smoother skin.\nRich in Herbal Antioxidants, this skin smoothing exfoliating gel is infused with Walnut Shell Powder which provides gentle exfoliation without irritation and works to lift away dead skin cells and impurities from the body.\nBody Exfoliating Gel is formulated with a blend of Avocado Oil and Glycerin which leaves skin soft, hydrated and protected. Witch Hazel, Rosemary, Tea Tree Oil and Lemon Balm refresh and invigorate skin whilst rebalancing oiliness.\nIdeal for all skin types, except sensitive, Body Exfoliating Gel leaves skin smooth, soft and radiant with a fresh, invigorated sensation.", "product_name": "Body Exfoliating Gel 300ml", "brand": "Jurlique"},
{"price": "HK $147.60", "id": 135, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SCLO0012F_1_L.jpg/857cd0e170a20da88a02b34110183c4e/SCLO0012F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/scrublove/cacaobodyscrubdarkchocolate/", "product_description": "A moisturising body scrub.\nBuffing away dry and dead skin, Cacao Body Scrub Dark Chocolate revitalises and refreshes. With a dark chocolate scent, envelop the body in gentle exfoliants and natural essential oils for luxuriously soft skin.", "product_name": "Cacao Body Scrub Dark Chocolate 200g", "brand": "Scrub Love"},
{"price": "HK $226.10", "id": 136, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0058F_1_L.jpg/425eef6e53d83589511c3646c3660a69/JURL0058F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/rosebodycarelotion/", "product_description": "Jurlique Rose Body Care Lotion restores lost moisture whist refreshing, hydrating and protecting all skin types.\nFeaturing the relaxing scent of Rose to entice the senses, Rose Body Care Lotion is infused with a blend of Beeswax, Glycerin and Honey which helps soothe dryness and calm delicate skin. Vitamin E and Green Tea Extract provide antioxidant protection whilst Safflower Seed and Avocado Oil nurtures skin and protects it from dehydration.\nRose Body Care Lotion helps to increase the softness and suppleness of skin whilst providing long-lasting hydration and restoring lost moisture. Skin is left looking smooth, supple and glowing for instant health and radiance.", "product_name": "Rose Body Care Lotion 300ml", "brand": "Jurlique"},
{"price": "HK $152.40", "id": 137, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO-thisworksdeepsleepdreamcream_1_gl.jpg/caa9b2499169be18d1a783dfab61495e/thisworksdeepsleepdreamcream_1_gl.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/deepsleepdreamcream/", "product_description": "This Works Deep Sleep Dream Cream soothes tired hands and feet whilst encouraging a good nightÉs sleep.\nFormulated with a powerful, therapeutic combination of Aromatherapy Essential Oils, Deep Sleep Dream Cream absorbs quickly and penetrates deeply into the skin to help you relax and unwind. Specifically designed to give you a good nightÉs sleep, this luxurious multi-purpose cream targets weary hands and the body. It also deeply hydrates and moisturises the skin whilst inducing the peacefulness necessary to drop off to sleep after a stressful day.\nAn expert fusion of Provencal Lavender calms the senses whilst Vetivert, otherwise known as the oil of tranquillity, relieves tension and stress. A blend of soothing Wild Chamomile and Organic Crambe Oil restores hydration and repairs damaged or dry skin while Camelina, rich in Omega 3 improves skin elasticity and suppleness.\nGolden pleasure oils of Larch Extract andJojobaWax seal in moisture and leaves the skin deeply nourished. Deep Sleep Dream Cream allows you to wrap yourself in a cocoon of soothing Essential Oils and leaves you feeling relaxed and peaceful whilst your skin is deeply nourished and hydrated.", "product_name": "Deep Sleep Dream Cream 75ml", "brand": "This Works"},
{"price": "HK $171.40", "id": 138, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0110F_1_L.jpg/22ae4f44bc337737afeceea0c704d228/STTR0110F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/sunshinereadykit/", "product_description": "A collection of bronzing false tans.\nWith everything you need for a golden glow, Sunshine Ready Kit preps and creates the perfect summer skin. With three tanning lotions, a mitt and stylish bag, use whilst travelling for instant, gradual and stunning streak-free looks.", "product_name": "Sunshine Ready Kit", "brand": "St.Tropez"},
{"price": "HK $95.10", "id": 139, "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO0114F_1_L.jpg/9c8332a4eb7c42e75dcc6de0d93d7ced/YETO0114F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/yesto/carrotssuperrichbodybutter/", "product_description": "Yes To Carrots Super Rich Body Butter is a rich and creamy lotion which indulges normal to dry skin types.\nThis long lasting moisture treatment has a 99% natural formula which is enriched with Organic Carrots which nurture the skin with Beta Carotene and Antioxidants. Carrots Super Rich Body Butter helps to nourish the skin and helps to maintain a silky soft texture and radiant glow.\nDesigned to improve the appearance of dry skin, Carrots Super Rich Body Butter is free from Parabens and SLS and is also infused with Shea Butter which protects the skin from dehydration and restores suppleness. The faint, light refreshing scent entices the senses whilst the rich, creamy consistency absorbs deep into the skin, leaving it feeling smooth, hydrated and revitalised.", "product_name": "Carrots Super Rich Body Butter 177ml", "brand": "Yes To"},
{"price": "HK $282.10", "id": 140, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/alph0137f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/alphah/protectionplushairandbodysprayspf50100ml/", "product_description": "A multitasking sun spray.\nWater resistant, Protection Plus Hair and Body Spray SPF50 100ml is both lightweight and colourless for comfortable, long-lasting wear. Designed to nourish and revitalise, generously spray over the hair and body to protect from the drying and damaging effects of the sun.", "product_name": "Protection Plus Hair and Body Spray SPF50 100ml", "brand": "Alpha-H"},
{"price": "HK $175.30", "id": 141, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO8131F_1_L.jpg/2c0119bea1cb136e57268c370326a7df/THWO8131F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/sleepoverkit2017ltdedition/", "product_description": "A deep sleep trio.\nA collection of natural remedies, Sleep Over Kit 2017 Ltd Edition is the perfect routine for an uninterrupted night's sleep. In convenient travel sizes, destress and sleep easy wherever you go with lightweight sprays, balms and oils to soothe away anxieties.", "product_name": "Sleep Over Kit 2017 Ltd Edition", "brand": "This Works"},
{"price": "HK $67.70", "id": 142, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0091F_1_L.jpg/464125ddbc93d5c9044fc0c5140cfd68/STTR0091F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/classicbronzingmousse50ml/", "product_description": "St.Tropez Classic Bronzing Mousse is a lightweight, easy to apply self-tan for a long-lasting sun kissed glow.\nInfused with skin conditioning Aloe Vera and other highly-hydrating ingredients, Classic Bronzing Mousse has a super-lightweight and velvety formula which dries in an instant and washes off to reveal a perfectly natural looking, streak-free tan. Suitable for all skin types, this innovative mousse allows you to tan and go effortlessly for a delicately fabulous sun-kissed glow that is set to make you the centre of attention.\nInnovative and effortless to use, Gradual Tan Face eliminates the tell-tale scent often associated with self-tanning products and leaves the skin smelling deliciously fresh. Providing the skin with seamless bronzing, this tanning necessity is a certified must-have for any tannoholic and cosmetic junkie.", "product_name": "Classic Bronzing Mousse 50ml", "brand": "St.Tropez"},
{"price": "HK $443.60", "id": 143, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0112F_2_L.jpg/84a24ba948c52e20d037c6a04250bd4a/THWO0112F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/perfectlegsgradualtan/", "product_description": "This Works Perfect Legs Gradual Tan is a luscious serum which adds a summer glow to legs whilst repairing and perfecting skin imperfections.\nInstantly enhance your legs and get them summer-ready with this innovative streak-free, gradual tanning serum. Enriched with naturally sourced DHA and Erythulose to deliver a long-lasting golden tan with a subtle shimmer, Perfect Legs Gradual Tan combats skin imperfections.\nVitamins C & E work together to moisturise skin and perfect uneven tone; legs are left with an instant summer glow whilst a natural golden tan builds gradually on soft, moisturised skin.", "product_name": "Perfect Legs Gradual Tan 120ml", "brand": "This Works"},
{"price": "HK $85.40", "id": 144, "image_url": "http://images.contentful.com/eoaaqxyywn6o/cosmoprixdebeaute_1_L.jpg/8144014cd52a83aca6dbbe38a9ea3d20/cosmoprixdebeaute_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/starskin/magichourexfoliatingdoublelayerfootmasksocks/", "product_description": "A gently exfoliating sheet mask for feet that softens any rough patches and deeply moisturises any dehydrated patches, perfect for treating cracked heels and calluses.\nMagic Hour Exfoliating Double Layer Foot Mask Socks uses Lactic Acid to gently yet effectively lift away dead skin cells and smooth out rough patches on both the soles of the feet and the heels. The feet will feel instantly rejuvenated, soft and supple without the need for harsh scrubs, all in the comfort of your own home.", "product_name": "Magic Hour Exfoliating Double Layer Foot Mask Socks", "brand": "STARSKIN"},
{"price": "HK $91.30", "id": 145, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BOBL0005U_1_L.jpg/b4caaf27db136e0d5ea2b85fffa3928e/BOBL0005U_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/bodyblendz/bodywraps/", "product_description": "An innovative body wrap that targets the appearance of wrinkles, discolouration, cellulite and stretch marks. Delivering a smooth, blemish-free finish for the skin, the Body Blendz's Body Wraps are made of natural products and can be used on all skin types.", "product_name": "Body Wraps", "brand": "Body Blendz"},
{"price": "HK $213.20", "id": 146, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0246U_1_L.jpg/98a1ccdc03aafe61a626d259222c00e4/THWO0246U_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/deepsleepbreathein/", "product_description": "This Works Deep Sleep Breathe In is a sensual fusion of Natural Oils designed to lull you into a relaxing and soothing slumber.\nWe all have those moments when we're too stressed and busy to calm the senses fully enough to drift off into a deep sleep, and this solution from the experts at This Works tackles just that.\nFormulated using 100% Natural Fragrance Oils, Deep Sleep Breathe In is a portable lullaby created to help the senses slowly close down for the day and aid you in drifting off into a much needed slumber.\nWith added Lavender, Vetivert and Wild Chamomile Oils, Deep Sleep Breathe In relaxes the senses, thus preparing you to face the best night's sleep you will ever experience.", "product_name": "Deep Sleep Breathe In 8ml", "brand": "This Works"},
{"price": "HK $433.30", "id": 147, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0062F_3_L.jpg/faec9455deebd5e11cf3f11c78231488/THWO0062F_3_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/perfectlegsskinmiracle/", "product_description": "This Works Perfect Legs Skin Miracle is a powerful, lightly tinted serum developed especially for legs.\nEnriched with Arnica and Vitamins A and C, this luxurious serum helps to even out skin tone and heal and treat bruises. A hint of Caramel tint covers existing imperfections whilst taking the edge off pale skin – without looking like you’ve been tangoed!\nPerfect Legs Skin Miracle instantly enhances the legs and helps to combat skin imperfections, discolouration and scars. The skin is given a light shimmer, a hint of sun kissed glow and an even, flawless finish.", "product_name": "Perfect Legs Skin Miracle 120ml", "brand": "This Works"},
{"price": "HK $148.10", "id": 148, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0035F_1_L.jpg/474679bfc98c64023cb97615712ba70a/COSH0035F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/invigorateshowergel/", "product_description": "Como Shambhala Invigorate Shower Gel is an energising body cleanser enriched with therapeutic Essential Oils.\nThis natural shower gel allows you to recharge each morning with a revitalising blend of Eucalyptus, Peppermint, Lavender and Geranium Essential Oils. Perfect for uplifting your mood and nourishing your skin, Invigorate Shower Gel is a Beauty Bay favourite.\nFree from Parabens, Silicones and synthetic ingredients, Invigorate Shower Gel leaves the skin hydrated and supple with a radiant glow whilst stress and tension are relieved from the mind for a sense of emotional clarity and well-being.", "product_name": "Invigorate Shower Gel 300ml", "brand": "Como Shambhala"},
{"price": "HK $123.80", "id": 149, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SICO0016F_1_L.jpg/d5fc82b7d1a4fe6afd911131491e17a5/SICO0016F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sisterco/activatedcharcoalultimatecleansedetoxifyingsoapbar/", "product_description": "Detoxifying soap for blemish-prone skin.\nLifting impurities from the skin, Activated Charcoal Ultimate Cleanse Detoxifying Soap Bar is best suited to oily and combination skin types. Gentle enough for everyday use, use on both face and body to clear pores and promote smooth, hydrated skin.", "product_name": "Activated Charcoal Ultimate Cleanse Detoxifying Soap Bar 110g", "brand": "Sister & Co."},
{"price": "HK $211.10", "id": 150, "image_url": "http://images.contentful.com/eoaaqxyywn6o/FRBO0013F_1_L.jpg/1f85ad956727952d95fea47b1305c87c/FRBO0013F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/frankbody/bodybalm/", "product_description": "A dewy, multi-use balm.\nMade with coffee seed oil, Body Balm refreshes the skin for a healthily glowing complexion. To be used on the face, hair and body, tame, illuminate and soften for quick and easy results that soak beautifully into skin after exfoliating.", "product_name": "Body Balm 100ml", "brand": "Frank Body"},
{"price": "HK $116.70", "id": 151, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0061F_1_L.jpg/f52ffb3784c459bbe17c70b0edea1d4a/MABA0061F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/hydratinghandcream/", "product_description": "Mario Badescu Hydrating Hand Cream (118ml) is formulated with Hyaluronic Acid to lock in the skins natural moisture.", "product_name": "Hydrating Hand Cream", "brand": "Mario Badescu"},
{"price": "HK $251.80", "id": 152, "image_url": "http://images.contentful.com/eoaaqxyywn6o/EMBR0013F_1_L.jpg/8c278ca9583442b2a6ef9fae61f25f9a/EMBR0013F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/skincare/embryolisse/laitcremefluidmultifunctionnourishingmoisturiser/", "product_description": "Embryolisse Lait Crème Fluid Multi Function Nourishing Moisturiser is a multi-purpose body lotion for all skin types.\nVelvety smooth, Lait Crème Fluid Multi Function Nourishing Moisturiser replenishes lost moisture and seals in hydration with a light consistency which absorbs deep into the skin. Shea Butter and Aloe Vera nurture and nourish the skin whilst the highly versatile formula can also be used as a creamy makeup remover, soothing after sun lotion and also helps to reduce shaving irritation.\nLait Crème Fluid Multi Function Nourishing Moisturiser has an award winning formula which leaves the skin feeling soft, supple, hydrated and comfortable.", "product_name": "Lait Creme Fluid Multi Function Nourishing Moisturiser 500ml", "brand": "Embryolisse"},
{"price": "HK $228.50", "id": 153, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TALI0095F_1_L.JPG/a918001e37df4033705ab7ee6acb3cca/TALI0095F_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/talika/eyedecompress/", "product_description": "A soothing eye mask.\nDesigned to brighten dark circles and reduce puffiness, Eye Decompress is a quick, easy and effective treatment. With a relaxation podcast, use together with the convenient, compact mask to deeply soothe and completely relax.", "product_name": "Eye Decompress", "brand": "Talika"},
{"price": "HK $55.00", "id": 154, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TOMO0014F_2_L.jpg/c7ec4949696994fa1095fd488e2e7e5b/TOMO0014F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/tonymoly/changingumagicfootpeelingshoes/", "product_description": "Show your feet some tender loving care with this set of exfoliating sheet masks.\nDesigned to keep your feet in optimum condition, the Changing U Magic Foot Peeling Shoes are a foot care essential. Easy to use and completely fuss-free, the foot shaped sheet masks have been infused with a naturally enhanced serum that aims to lift away dead skin cells whilst delivering intense hydration.", "product_name": "Changing U Magic Foot Peeling Shoes 2x17g", "brand": "TONYMOLY"},
{"price": "HK $528.50", "id": 155, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STRI-intensiveconcwrinklesstretchmarks_1_GL.jpg/f39625a8566238ecc5c54075c37449a8/intensiveconcwrinklesstretchmarks_1_GL.jpg", "colour": "SD Advanced Intensive Concentrate For Wrinkles & Stretch Marks 60ml – HK $528.50", "product_url": "http://beautybay.com/skincare/strivectin/sdadvancedintensiveconcentrateforwrinklesstretchmarks/", "product_description": "A fine line, wrinkle and stretch mark diminishing cream for both the face and body of all skin types.\nSD Advanced Intensive Concentrate For Wrinkles & Stretch Marks penetrates the epidermis delivering intense hydration and stimulated collagen levels resulting in a firmer, plumper and more youthful looking complexion. Working in synergy with one another the active ingredients incorporated in the creamy formula achieve noticeable anti-ageing results within just fifteen days of use.", "product_name": "SD Advanced Intensive Concentrate For Wrinkles & Stretch Marks", "brand": "StriVectin"},
{"price": "HK $101.60", "id": 156, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0053F_1_L.jpg/8d0f578a2956eecfcc95d617af095908/STTR0053F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/selftantanbooster/", "product_description": "St.Tropez Self Tan Tan Booster intensifies your natural or self tan to make it stay looking radiant for longer.\nInspired by salon professionals, Self Tan Tan Booster is a lightweight lotion which is specially formulated with a blend of tanning ingredients to intensify your tan and make it last up to four days longer.\nPacked with a nourishing blend of Mango Butter, Shea Butter and Vitamin E, Self Tan Tan Booster provides essential antioxidant protection and moisturises the skin to keep it looking smooth and healthy.\nThe best secret weapon to prolong your tan and keep the skin in perfect condition, Self Tan Tan Booster is also enriched with Pro Vitamin B5 which helps the skin to produce natural Amino Acid which the DHA reacts with to deliver a deeper, longer lasting tan.\nSelf Tan Tan Booster gives your tan a radiance boost and leaves your skin feeling luminous, healthy and nourished.", "product_name": "Self Tan Tan Booster 200ml", "brand": "St.Tropez"},
{"price": "HK $467.60", "id": 157, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO8139F_1_L.jpg/e4c68b9443538fa312547af258425648/THWO8139F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/perfectlegsskinprotectorspf30/", "product_description": "A leg perfecting and protecting spray.\nIdeal beach preparation, Perfect Legs Skin Protector SPF 30 is a moisturising skin enhancer. Made with vitamins C & E, the nourishing yet lightweight formula boosts radiance whilst protecting from harmful UV rays and adding a subtle golden glow. With a branded, zipped bag, securely attach your spray to a beach bag for easy and convenient use.", "product_name": "Perfect Legs Skin Protector SPF 30 100ml", "brand": "This Works"},
{"price": "HK $148.10", "id": 158, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI-vitaliberatafFabulousselftanninglotion_1_GL.jpg/579335a3ad18411f62cb9ae5701ca290/vitaliberatafFabulousselftanninglotion_1_GL.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/fabulousselftanningtintedlotiondark/", "product_description": "A non-toxic, odourless tanning lotion ideal for medium to tanned skin tones.\nWith seventy two hours' worth of moisture locking technology the Fabulous Self Tanning Tinted Lotion gives instant colour and works to achieve a natural looking tan within four to eight hours. Enriched with plant extracts and botanicals the quick dry formula penetrates the skin for a conditioned and hydrated glow.", "product_name": "Fabulous Self Tanning Tinted Lotion Dark 100ml", "brand": "Vita Liberata"},
{"price": "HK $296.50", "id": 159, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0094F_1_L.jpg/4f47e714b1212dfb800ababfe5d2242c/JURL0094F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/herbalrecoverynightcream/", "product_description": "Jurlique Herbal Recovery Night Cream is a high performance night treatment which nourishes skin and helps to revitalise and restore skin smoothness.\nThis luxurious, antioxidant overnight cream is rich in powerful Botanical Extracts and targets fine lines whilst helps to increase skin elasticity and hydration. Formulated with Moth Bean Extract, which has similar effects to Vitamin A, Herbal Recovery Night Cream refines skin texture to enhance radiance.\nAfrican Birch Extract is a powerful antioxidant which increases skin firmness and combats visible signs of ageing whilst Kakadu Plum Extract reduces the appearance of skin discolouration and evens skin tone.\nHerbal Recovery Night Cream provides intense hydration and allows you to wake up to skin that feels smooth, firm and hydrated and is radiant, bright and healthy in appearance.", "product_name": "Herbal Recovery Night Cream 50ml", "brand": "Jurlique"},
{"price": "HK $76.20", "id": 160, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI0003F_1_L.jpg/064aafa20968fbf005415aca946378c2/VILI0003F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/fabulousilluminatewashoffbodybronzer/", "product_description": "A bronzed, instant tanner for immediate results on all skin tones.\nCreated with an innovative transfer resistant formula, Vita Liberata's Fabulous Illuminate Wash Off Body Bronzer achieves sunless tanning with ease. Simply washed off in the shower, the formula provides the skin with seventy two hour hydration for incredible luminosity and a beautiful glow.", "product_name": "Fabulous Illuminate Wash Off Body Bronzer 100ml", "brand": "Vita Liberata"},
{"price": "HK $977.00", "id": 161, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TALI0091F_1_L.JPG/62ba37305f865ae6383a8215e6afa7a0/TALI0091F_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/talika/lipocilsplatinium/", "product_description": "An eyelash growth serum.\nCombining a day and night formula, Lipocils Platinium creates longer, fuller and darker lashes. With visible results after just 15 days, use for 2-3 months as a treatment and up to 1 month for maintenance to regenerate and stimulate healthy growth.", "product_name": "Lipocils Platinium 2 x 8.5ml", "brand": "Talika"},
{"price": "HK $114.30", "id": 162, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI0004F_1_L.jpg/b015496ce3196176f9cbcdb0e0ea28d3/VILI0004F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/fabulousselftanninggraduallotion/", "product_description": "A buildable tanning lotion enhanced with moisture locking technology and ideal for dry, mature and sensitive skin.\nFabulous Self Tanning Gradual Lotion delivers a soft bronzed glow as well as doubling as an essential daily moisturiser.  Odourless and non-toxic, the innovative formula is enriched with an infusion of botanicals to deliver a luminous, natural colour.", "product_name": "Fabulous Self Tanning Gradual Lotion 200ml", "brand": "Vita Liberata"},
{"price": "HK $401.50", "id": 163, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0082F_1_L.jpg/64c438ade933248acee7f81e8b2f5099/JURL0082F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/purelyagedefyingultrafirmliftcream/", "product_description": "Jurlique Purely Age Defying Ultra Firm & Lift Cream is a high performance anti-ageing cream which helps smooth and firm skin.\nFeaturing the breakthrough, triple action DPHP Plant Based Amino Acid, Purely Age Defying Ultra Firm & Lift Cream helps firm, lift, strengthen and moisturise the skin. Dermatologically tested, this rich anti-ageing cream is ideal for all skin types and helps promote the regeneration of elastin, collagen and new skin cells.\nFormulated with Rock Samphire Extract and Beech Tree Bud Extract, Purely Age Defying Ultra Firm & Lift Cream strengthens skin to help reduce the appearance of fine lines and wrinkles. A high concentration of Ascorbyl Glucoside (Vitamin C) helps protect skin from environmental aggressors whilst improving skin clarity and supporting natural collagen for firmer skin.\nPurely Age Defying Ultra Firm & Lift Cream has outstanding clinical results and offers immediate and long term benefits:\nSkin is left firmer, rejuvenated and lifted whilst visible signs of ageing including fine lines and wrinkles appeared smoother for a youthful complexion.", "product_name": "Purely Age Defying Ultra Firm & Lift Cream 50ml", "brand": "Jurlique"},
{"price": "HK $189.10", "id": 164, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO8126F_1_L.jpg/b0fb2327bfbd2654703c15fb22d484f7/THWO8126F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/stresscheckbreathein/", "product_description": "A calming blend of fragrant oils with roller-ball application.\nReducing tension, Stress Check Breathe In is a natural aroma-therapeutic treatment to calm the mind. Formerly known as Deep Sleep Stress Less, the travel friendly bottle can applied to pulse points on the go to combat daily stresses helping you to sleep easier at night.", "product_name": "Stress Check Breathe In 8ml", "brand": "This Works"},
{"price": "HK $595.10", "id": 165, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STRI0012F_1_L.jpg/8635971ca0c34be7bdbf728a172b7aed/STRI0012F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/strivectin/tighteningneckserumroller/", "product_description": "A skin tightening serum for the neck encased in a soothing rollerball applicator.\nTightening Neck Serum Roller glides across the skin dispensing a smooth, silky serum which works to hydrate, moisturise and tone the neck area. Massaged in by the unique cooling rollerball, the formula is absorbed quickly leaving the skin feeling supple, nourished and more defined.", "product_name": "Tightening Neck Serum Roller 50ml", "brand": "StriVectin"},
{"price": "HK $139.70", "id": 166, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0092F_1_L.jpg/b28f709b352cdc2cf04d1a73de32208e/STTR0092F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/classicbronzingmousse120ml/", "product_description": "St.Tropez Classic Bronzing Mousse is a light-weight, easy to apply self-tan for a long-lasting sun kissed glow.\nInfused with conditioning Aloe Vera and highly-hydrating components, Classic Bronzing Mousse has a super-lightweight and velvety formula which dries in an instant and washes off to reveal a perfectly natural looking, streak-free tan.\nInnovative and effortless to use, Gradual Tan Face eliminates the tell-tale scent often associated with self-tanning products and leaves skin smelling deliciously fresh.", "product_name": "Classic Bronzing Mousse 120ml", "brand": "St.Tropez"},
{"price": "HK $88.90", "id": 167, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0099F_1_L.jpg/21d41aa7bb27047c450db5697bdba83a/MABA0099F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/elbowheelsmoothingcream/", "product_description": "Mario Badescu Elbow & Heel Smoothing Cream (59ml) is a nourishing cream formula ideal for all skin types.\nWith a thick gel-cream formula, this rich moisturiser works to smooth and soften dry, chapped skin at the heels and elbows. Ingredients such as salicylic acid help to gently exfoliate skin whilst glycerine smoothes. Skin is left soft, supple and super smooth.", "product_name": "Elbow & Heel Smoothing Cream", "brand": "Mario Badescu"},
{"price": "HK $222.20", "id": 168, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0038F_1_L.jpg/983af28ffb09e6af37c8ddd186649302/COSH0038F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/shelterbathsalts/", "product_description": "Como Shambhala Shelter Bath Salts is a relaxing bath treat for soft, nourished skin.\nRestore yourself with these warming scented bath salts. Infused with a blend of Eucalyptus, Peppermint, Basil and Camphor Essential Oils, Shelter Bath Salts soften and nourish the skin whilst allowing you to unwind and relax.\nDesigned to promote a healthy sense of well-being, these natural bath salts are a great way to turn your regular bathing regime into a tranquil spa treatment. Shelter Bath Salts calm the senses and leave you feeling rejuvenated, soothed and peaceful.\n", "product_name": "Shelter Bath Salts 310g", "brand": "Como Shambhala"},
{"price": "HK $433.80", "id": 169, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0048F_1_L.jpg/c88d461d9342826915137ead5709fabf/COSH0048F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/comfort4piecegiftset/", "product_description": "A hair and body gift set.\nWith four luxurious minis, Comfort 4 Piece Gift Set cleanses and cares for the hair and body. In compact travel sizes, the rich, nourishing formulas are displayed in a branded box making the perfect gift for all hair and skin types.", "product_name": "Comfort 4 Piece Gift Set", "brand": "Como Shambhala"},
{"price": "HK $194.50", "id": 170, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA0031F_1_L.jpg/2ce88b663c5a5e63bbcdf68525331e7f/MDTA0031F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/milliondollartan/essentialskitextreme/", "product_description": "A kit that carries all the must-have products for creating a seamless streak-free finish.\nDeveloped by the experts at Million Dollar Tan, the Essentials Kit holds everything you need to create an effortlessly bronzed finish for beginners and tan-addicts alike. Consisting of the original sunless tanning mist, a lightweight tanning lotion and a peppermint scented prepping scrub you will have everything you need from start to finish for professional results.", "product_name": "Essentials Kit Extreme 3x118ml", "brand": "Million Dollar Tan"},
{"price": "HK $398.90", "id": 171, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0255F_1_L.jpg/00dd7b9a6ca6d976e687e755a4015a2f/THWO0255F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/greatdaygoodnight/", "product_description": "A calming and soothing day to night routine created to aid a peaceful night's sleep.\nDeveloped to offer an anxiety reducing experience throughout both the day and night, Great Day Good Night is a must-have duo of This Work's best-sellers. Reducing anxiety throughout the day is a stepping stone to getting a relaxed sleep without troublesome tossing and turning and thatÉs exactly where this set begins. With a roller-ball for the day and a spray for the night, this set in sure to induce a sleep you can't wait to repeat.", "product_name": "Great Day Good Night", "brand": "This Works"},
{"price": "HK $170.90", "id": 172, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANTI0021F_1_L.jpg/bcdb2a127e902c5f8bd75521f7ce6ab5/ANTI0021F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/antipodes/deliverancekowhaiflowerhandcream/", "product_description": "ANTIPODES Deliverance Kowhai Flower Hand Cream is a non-greasy hand cream which moisturises and heals hard working hands.\nDesigned to soften, smooth and sooth, Deliverance Kowhai Flower Hand Cream is rich in Vitamin E and Avocado Oil which work synergistically to nurture the skin with antioxidant protection and essential Fatty Acids.\nA stunning infusion of Sweet Orange and Cedarwood fragrances help to alleviate sensations of stress whilst the natural Kowhai formula helps to eliminate harmful bacteria from the hands. Deliverance Kowhai Flower Hand Cream is a handbag essential and leaves the hands silky soft, clean and moisturised without any greasy or sticky residue.", "product_name": "Deliverance Kowhai Flower Hand Cream 75ml", "brand": "Antipodes"},
{"price": "HK $216.60", "id": 173, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0149F_1_L.jpg/54a5f4e6e8d62ca6a7fd726207e91e74/MABA0149F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/botanicalfirminglotion/", "product_description": "Mario Badescu Botanical Firming Lotion (236ml) works to effectively minimise and control the appearance of cellulite.\nFormulated with several stimulating botanicals including Sweet Clover, Chamomile and Grapefruit extract, it works to smooth and tone skin. Enriched with active ingredient Aminophyllene, it gives maximum results in reducing the appearance of cellulite on the buttocks and thighs. Skin appears smoother, more toned and firmer.", "product_name": "Botanical Firming Lotion", "brand": "Mario Badescu"},
{"price": "HK $233.70", "id": 174, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0113F_1_L.jpg/d73cb6a04120fcf79a650d9d052c3792/JURL0113F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/rosemoistureplusmoisturisingcream/", "product_description": "Jurlique Rose Moisture Plus Moisturising Cream deeply hydrates skin whilst helping to address signs of premature aging.\nProviding immediate and long lasting hydration to the skins surface this high performance moisturiser helps to protect the skin with a blend of antioxidant ingredients. Extracts of Green Tea, Grape Seed, Rose Hip and Soy Proteins protect against environmental damage whilst non-greasy oils from Rosehip, Avocado, Sunflower and Macadamia are packed full of Vitamins which provides essential nourishment to dehydrated skin.\nWith a spa-like essence of Jurlique’s signature blend of Rose Oils, Rose Moisture Plus Moisturising Cream is a dream to apply and will leave skin looking and feeling younger, soft and supple.", "product_name": "Rose Moisture Plus Moisturising Cream 40ml", "brand": "Jurlique"},
{"price": "HK $126.00", "id": 175, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANSU0354F_1_L.jpg/2c5d348939186942d1ab092cdc56677c/ANSU0354F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/annasui/brighteninghandcream/", "product_description": "A brightening hand cream.\nWith a rich cream texture, Brightening Hand Cream soothes and moisturises hands. A carefully selected blend of ingredients work to fight age spots, leaving skin brighter and more youthful in appearance. Never greasy, it's quickly absorbed into skin offering an instant hit of hydration on the go for softer, smoother hands.", "product_name": "Brightening Hand Cream", "brand": "Anna Sui"},
{"price": "HK $76.10", "id": 176, "image_url": "-", "colour": "", "product_url": "http://beautybay.com/bathandbody/yesto/carrotsmoisturisinghandcream/", "product_description": "Yes To Carrots Moisturising Hand Cream hydrates and protects hard working hands.\nSpecially formulated for normal to dry skin types, Carrots Moisturising Hand Cream has a 97% natural formula which utilises Organic Carrots and Shea butter to rehydrate, soften and nourish the hands.\nCarrots Moisturising Hand Cream promotes healthy moisture retention and leaves the hands feeling silky soft and is sure to be a Beauty Bay best-seller.", "product_name": "Carrots Moisturising Hand Cream 80ml", "brand": "Yes To"},
{"price": "HK $112.10", "id": 177, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA-mdtamermaidmousseextremedark_1_GL.jpg/cca9521fbe62493d29e66696e1fc78c2/mdtamermaidmousseextremedark_1_GL.jpg", "colour": "Mermaid Mousse Extreme Dark Sunless Tanning Mousse 118ml – HK $112.10,\nMermaid Mousse Extreme Dark Sunless Tanning Mousse 207ml – HK $146.00", "product_url": "http://beautybay.com/bathandbody/milliondollartan/mermaidmousseextremedarksunlesstanningmousse/", "product_description": "A skin-loving fake tan that helps to create a rich bronzed finish.\nDeveloped by tanning experts, the Mermaid Mousse Extreme Dark Sunless Tanning Mousse is the tanner of choice for those of us who love a deep, golden tan. Created with an array of skin-nourishing botanicals, the weightless formula glides onto the skin with a hit of instant colour that develops into a long lasting tan over six to eight hours. This hydrating mousse is a must-have addition to any tan-lovers collection.", "product_name": "Mermaid Mousse Extreme Dark Sunless Tanning Mousse", "brand": "Million Dollar Tan"},
{"price": "HK $133.30", "id": 178, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MDTA-cabanatanextremedarklotion_1_GL.jpg/4a748fbdeafd898cc5cc0fd7ea426209/cabanatanextremedarklotion_1_GL.jpg", "colour": "Cabana Tan Extreme Dark Sunless Tanning Lotion 118ml – HK $91.00,\nCabana Tan Extreme Dark Sunless Tanning Lotion 236ml – HK $133.30", "product_url": "http://beautybay.com/bathandbody/milliondollartan/cabanatanextremedarksunlesstanninglotion/", "product_description": "A lightweight, hydrating lotion which gives a deep, dark and natural looking tan.\nDesigned to achieve an ultra-rich colour with ease, the Cabana Tan Extreme Dark Sunless Tanning Lotion is a must-have for any bronzed beauty. Simply massaged into the surface of the skin, the weightless formula develops to a uniquely caramel tan whilst deeply hydrating and nourishing for a beautiful finish.", "product_name": "Cabana Tan Extreme Dark Sunless Tanning Lotion", "brand": "Million Dollar Tan"},
{"price": "HK $67.70", "id": 179, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0033F_1_L.jpg/5d395487caec145b9ed0a29f1e332078/STTR0033F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/prepmaintaintanenhancingmoisturiser/", "product_description": "St.Tropez Prep & Maintain Tan Enhancing Moisturiser deeply nourishes and moisturises skin and is ideal for prolonging your self-tan.\nWell-nourished and deeply moisturised skin is St.Tropez’s top tip for a natural looking tan. This daily hydrating lotion is packed with a luxurious blend of ingredients and is formulated to help keep your skin looking sleek, supple and hydrated.\nEssential for softening dry areas such as elbows, feet and knees before self-tan application; Prep & Maintain Tan Enhancing Moisturiser leaves the skin lusciously soft and hydrated and works to prolong your natural looking St.Tropez tan.", "product_name": "Prep & Maintain Tan Enhancing Moisturiser 200ml", "brand": "St.Tropez"},
{"price": "HK $366.60", "id": 180, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/tanluxethewater_1_gl.jpg", "colour": "Light-Medium 200ml – HK $366.60,\nMedium-Dark 200ml – HK $366.60", "product_url": "http://beautybay.com/bathandbody/tanluxe/thewater/", "product_description": "A hydrating false tan.\nInfused with vitamins, The Water is a translucent spray that illuminates and hydrates. Developing in 2-4 hours, spray liberally over the arms, legs and body for a quick-drying, fragrance free finish.", "product_name": "The WATER", "brand": "TAN-LUXE"},
{"price": "HK $148.10", "id": 181, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0033F_1_L.jpg/b6cb67f355afe6621b80e4daacc446f2/COSH0033F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/invigoratehandwash/", "product_description": "Como Shambhala Invigorate Handwash refreshes and softens hard working hands.\nA must for any bathroom, Invigorate Handwash is enriched with an aromatherapy blend of refreshing Eucalyptus, Peppermint and Lavender Essential Oils. Luxuriously natural and free from Parabens, Sodium Laureth Sulphate and Silicones, Invigorate Handwash cleanses the hands and imparts a heavenly therapeutic scent.\nYour own daily luxury, Invigorate Handwash leaves the skin feeling fresh, rejuvenated and silky soft.", "product_name": "Invigorate Handwash 300ml", "brand": "Como Shambhala"},
{"price": "HK $207.40", "id": 182, "image_url": "-", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/classicbronzinglotion/", "product_description": "St.Tropez Classic Bronzing Lotion is especially developed to give you a rich, deep and natural looking tan.\nEnriched with soothing Aloe Vera and other moisturising ingredients, this salon-performance Classic Bronzing Lotion cares deeply for the skin whilst maintaining the tanned effect for even longer. Formulated with a new mood-boosting fragrance, this enchanting bronzing essential guarantees a flawless finish without providing the tell-tale scent of fake tan.\nCreated by the tanning experts St.Tropez, Classic Bronzing Lotion is ideal for all skin types and is designed to leave a long lasting and even golden colour for the most natural looking, even tan.", "product_name": "Classic Bronzing Lotion 240ml", "brand": "St.Tropez"},
{"price": "HK $116.70", "id": 183, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0064F_1_L.jpg/7af12d6eaae27adf5eaba128759a3662/MABA0064F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/superricholiveoilbodylotion/", "product_description": "Mario Badescu Super Rich Olive Body Lotion (177ml) restores moisture and leaves the skin feeling soft and silky.", "product_name": "Super Rich Olive Oil Body Lotion", "brand": "Mario Badescu"},
{"price": "HK $198.40", "id": 184, "image_url": "http://images.contentful.com/eoaaqxyywn6o/GRAL0033F_1_L.jpg/601a77d2c567a37e6b32d47e947d5e14/GRAL0033F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/grownalchemist/bodytreatmentoilylangylangtamanuomega7/", "product_description": "Grown Alchemist Body Treatment Oil Ylang Ylang Tamanu & Omega 7 is a sensuous body moisturiser which softens and smoothes all skin types.\nHighly absorbent and rich in skin loving Organic Botanical Oils, Body Treatment Oil Ylang Ylang Tamanu & Omega 7 helps to increase elasticity and hydration whilst noticeably improving skin texture, tone and overall appearance to boost body confidence.\nAn infusion of Essential Fatty Acids, Omega 6 & 9 and Xanthones are derived from Tamanu Oil and help to visibly restore softness and suppleness to the skin whilst revitalising the skin and dramatically improving the appearance of age spots, stretch marks and scarring.\nBody Treatment Oil Ylang Ylang Tamanu & Omega 7 is also enriched with Sea Buckthorn Berry which nurtures the skin with Omega 7 Palmitoleic Acid for added skin toning benefits as Polyphenols, Carotenoids and Antioxidants derived from Camellia SeedOil provide exceptional hydration below the surface of the skin.\nA succulent aroma of Ylang Ylang, Sandalwood and Bergamot envelop the skin and entice the senses whilst free radical fighting Lycopene found in Rosehip Oil shields the skin from environmental aggressors.\nSuitable for all skin types and ideal for daily use after showering, Body Treatment Oil Ylang Ylang Tamanu & Omega 7 leaves the skin looking smooth, toned and radiant.", "product_name": "Body Treatment Oil Ylang Ylang Tamanu & Omega 7 100ml", "brand": "Grown Alchemist"},
{"price": "HK $377.80", "id": 185, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/talu0014f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/tanluxe/thesleepoil/", "product_description": "An overnight tanning oil.\nDeveloping overnight, Tan Luxe's Sleep Oil rejuvenates, stimulates and hydrates the skin. Packed with natural tanning actives, use regularly to eradicate dry, dull skin and wake with a natural, healthy-looking glow.", "product_name": "The SLEEP OIL 20ml", "brand": "TAN-LUXE"},
{"price": "HK $179.90", "id": 186, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0005F_1_L.jpg/e6a825763e04d7f69c55eb17d4ba1dd5/COSH0005F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/invigoratebodyoil/", "product_description": "Como Shambhala Invigorate Body Oil moisturises the skin whilst promoting mental energy and concentration.\nComo Shambhala’s original and substantial blend, Invigorate Body Oil utilises Eucalyptus and Peppermint to help relieve respiratory problems associated with cold and flu symptoms while their cooling, penetrating characteristics promote energy and concentration. Peppermint also works to relieve headaches and mental fatigue whilst Lavender balances the senses and works harmoniously with Geranium to ease anxiety and PMS.\nInvigorate Body Oil is also formulated with a natural blend of Evening Primrose, Grapeseed Oil, Sweet Almond Oil and Vitamin E to nourish, hydrate and moisturise the skin. Non-greasy and delightfully lightweight, Invigorate Body Oil absorbs deep into the skin to soften and smooth for a flawless appearance.", "product_name": "Invigorate Body Oil 100ml", "brand": "Como Shambhala"},
{"price": "HK $100.00", "id": 187, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0059F_1_L.jpg/29db04e94fe7adb128ab42c6c1411ccd/MABA0059F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/specialhandcreamvitamine/", "product_description": "Mario Badescu Special Hand Cream Vitamin E (118ml) is a Rich, non-greasy formula of Vitamin A, Vitamin E, Wheat Germ Oil and Honey.", "product_name": "Special Hand Cream Vitamin E", "brand": "Mario Badescu"},
{"price": "HK $226.10", "id": 188, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0003F_1_L.jpg/3231a9b7413c3269e352cb7b6c6d187a/JURL0003F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/balancingfoamingcleanser/", "product_description": "Jurlique Balancing Foaming Cleanser is a revitalising cleanser ideal for normal and combination skin types.\nThis luxurious cleanser is designed to clear skin of impurities which refreshing the complexion. Ginseng Root helps firm the skin while Rosehip Oil helps restore skin radiance. A luscious blend of Vitamins C & E and Ginkgo Biloba help to protect and restore skin whilst Marshmallow intensely hydrates, softens and soothes.\nBalancing Foaming Cleanser improves skin firmness and minimises visible signs of ageing; skin is left feeling clean and balanced whilst the complexion appears firm and youthful.", "product_name": "Balancing Foaming Cleanser 200ml", "brand": "Jurlique"},
{"price": "HK $132.30", "id": 189, "image_url": "http://images.contentful.com/eoaaqxyywn6o/PTRO0139F_2_L.jpg/740d16d1f7fb3f864d4d8b53bd32b7ab/PTRO0139F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/peterthomasroth/megarichbodylotion/", "product_description": "Peter Thomas Roth Mega Rich Body Lotion instantly soothes and nourishes dehydrated skin.\nRich in Vitamins C & E skin is protected against free radical and environmental damage whilst Pro Vitamin B5 moisturises, nourishes and clarifies skin leaving it silky soft.\nThis luxurious Mega Rich Body Lotion is infused with a deliciously refreshing scent which leaves skin intensely moisturised, revitalised and rejuvenated.", "product_name": "Mega Rich Body Lotion 235ml", "brand": "Peter Thomas Roth"},
{"price": "HK $388.80", "id": 190, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/tanluxetheface_1_gl.jpg", "colour": "Light-Medium 30ml – HK $388.80,\nMedium-Dark 30ml – HK $388.80", "product_url": "http://beautybay.com/bathandbody/tanluxe/theface/", "product_description": "A bottle of tanning face drops.\nCreating a tailor-made colour, The Face can be mixed with moisturisers and oils to create a natural, buildable tan. With no fragrance and a streak-free formula, incorporate into your existing skincare regime for convenient and controlled application.", "product_name": "The FACE", "brand": "TAN-LUXE"},
{"price": "HK $449.80", "id": 191, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0020F_2_L.jpg/7c722bae729872704a9637897ddfa533/JURL0020F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/purelyagedefyingfirmingandtighteningserum/", "product_description": "Jurlique Purely Age Defying Firming and Tightening Serum is a high performance facial treatment which targets the visible signs of ageing and brightens skin for increased radiance.\nInfused with Blue Algae Extract, Purely Age Defying Firming and Tightening Serum helps to increase firmness and improve skin density whilst Beech Tree Bud Extract helps to reduce the appearance of fine lines and wrinkles and strengthen skin for a more youthful complexion.\nPurely Age Defying Firming and Tightening Serum works to fade skin discolouration for a brighter complexion and is enriched with Ectoin which protects the skin from environmental aggressors and against photo ageing damage; it also helps boost skinÉs moisture levels.\nClinical tests show this luxurious treatment delivers outstanding results and offers both instant and long term benefits:\nPurely Age Defying Firming and Tightening Serum improves skin tone and clarity and leaves skin visibly brighter, firmer and smoother with the appearance of fine lines, wrinkles and discolouration minimised.", "product_name": "Purely Age Defying Firming and Tightening Serum 30ml", "brand": "Jurlique"},
{"price": "HK $101.60", "id": 192, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0078F_1_L.jpg/c891f1ecacd960b2a7860b06935e6945/STTR0078F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/tintedgradualtanlotion/", "product_description": "St.Tropez Tinted Gradual Tan Lotion is a sumptuous gradual taning elixir which provides a subtle bronzing effect instantly, then continues to develop after application effortlessly and seamlessly.\nIdeal for everyday use, Tinted Gradual Tan Lotion eliminates the dreaded tell-tale self-tan scents and leaves the skin refreshingly fragrant with an uplifting and subtle scent. Perfect for adding a subtle golden glow to pasty winter skin or boosting a natural summer tan, Tinted Gradual Tan Lotion leaves the skin deliciously soft and supple with a healthy flush of sun-kissed bronze colour.\nEnriched with decadent moisturising ingredients such as Vitamin E, Tinted Gradual Tan Lotion soothes, smoothes and hydrates the skin whilst building a gradual golden tan and maintaining it for longer than ever before.", "product_name": "Tinted Gradual Tan Lotion 200ml", "brand": "St.Tropez"},
{"price": "HK $137.00", "id": 193, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SCLO0002F_2_L.jpg/02a48ee3a10ae95f88b6e7a1705ea6c6/SCLO0002F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/scrublove/coffeebodyscrubminttemptation/", "product_description": "A 100% natural and organic mint and coffee scrub to leave skin soft, smooth, exfoliated, and hydrated, from head to toe.\nThis smoothening, softening treatment is packed with vitamins and essential oils to treat a variety of skin concerns, from cellulite to stretch marks, dry skin, blackheads, breakouts, eczema, and psoriasis. Combined with vitamin-rich oils and rock salt (for an extra exfoliating kick), crushed coffee beans release caffeine, which is absorbed into skin with the help of water, delivering antioxidants and increasing circulation. The gentle texture of Mint Temptation body scrub exfoliates skin to stimulate blood flow and buff away dead skin cells, helping to reduce the appearance of damage and give skin a smoother, more refined texture. For a refreshing twist and skin-clearing benefits, the formula is infused with peppermint and tea tree.", "product_name": "Coffee Body Scrub Mint Temptation 200ml", "brand": "Scrub Love"},
{"price": "HK $97.30", "id": 194, "image_url": "http://images.contentful.com/eoaaqxyywn6o/STTR0072F_2_L.jpg/017c564cc52352dba982defbc95194c0/STTR0072F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sttropez/gradualtaninshowerlotionlight/", "product_description": "St Tropez Gradual Tan In Shower Lotion Light is a revolutionary, one-of-a-kind self-tanning lotion which is activated by water.\nPerfect for people who are constantly on-the-go, Gradual Tan In Shower Lotion takes just a mere three minutes to apply, so it can be effortlessly added to your shower regime. Sunkissed skin is just a shower away with this innovative, time-saving gradual tan that creates a flawlessly radiant glow all year round.\nBuild up a fabulous tan and moisturise the skin with this revolutionary beauty essential, which provides a uniquely streak-free glow whilst enjoying your morning shower. Providing 24 hour moisturisation and suitable for all skin types, Gradual Tan In Shower Lotion is enriched with Sweet Almond Oil and works to subtly build a streak free, sunkissed glow.", "product_name": "Gradual Tan In Shower Lotion Light 200ml", "brand": "St.Tropez"},
{"price": "HK $388.80", "id": 195, "image_url": "http://images.contentful.com/eoaaqxyywn6o/GRAL-grownalchemintenbodycreamrosmascacaipom_1_gl.jpg/da5a3e834102029760af4536a40b2f6d/grownalchemintenbodycreamrosmascacaipom_1_gl.jpg", "colour": "Intensive Body Cream Rosa Damascena Acai & Pomegranate 500ml – HK $388.80", "product_url": "http://beautybay.com/bathandbody/grownalchemist/intensivebodycreamrosadamascenaacaipomegranate/", "product_description": "Grown Alchemist Intensive Body Cream Rosa Damascena Acai & Pomegranate is a rich and indulgent Organic body cream ideal for extremely dry and dehydrated skin types.\nTreat your skin to some intensive hydration with this rich and creamy body moisturiser; Intensive Body Cream Rosa Damascena Acai & Pomegranate has been specially formulated to maximise moisture levels in the skin along with promoting elasticity and suppleness.\nRich in Polyphenol Antioxidants, Intensive Body Cream Rosa Damascena Acai & Pomegranate utilises Pomegranate and Capuacu Butter to nourish, soften and hydrate the skin whilst shielding against free radical aggression.\nExcellent for all skin types, especially dry and depleted skin, Intensive Body Cream Rosa Damascena Acai & Pomegranate leaves the skin looking and feeling beautifully soft and hydrated with a more revitalised and firmer appearance.", "product_name": "Intensive Body Cream Rosa Damascena Acai & Pomegranate", "brand": "Grown Alchemist"},
{"price": "HK $47.70", "id": 196, "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO0173F_1_L.jpg/4ec3e965df8be6d8a0ea5d7a7b377c9e/YETO0173F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/skincare/yesto/coconutmilkbarsoap/", "product_description": "An intensely moisturising soap bar ideal for cleansing dry skin from head to toe.\nHarbouring a whole coconut, husk and all, the Coconut Milk Bar Soap is a simple way to achieve refreshed and polished skin. The creamy bar imparts a gentle exfoliating action that works to buff away dead skin cells sitting on the surface leaving the skin feeling soft and supple. Gentle enough to be used on the face and body this moisture imparting bar is a skin-loving essential.", "product_name": "Coconut Milk Bar Soap 195g", "brand": "Yes To"},
{"price": "HK $161.90", "id": 197, "image_url": "http://images.contentful.com/eoaaqxyywn6o/RMSB0025F_1_L.JPG/5146b9645861784444ef590e1608fc8d/RMSB0025F_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/skincare/rmsbeauty/rawcoconutcream/", "product_description": "RMS Beauty Raw Coconut Cream is the ultimate multi-tasking beauty essential which nourishes, cleanses, moisturises and protects all skin types.\nFormulated with 100% pure, certified organic, raw, unrefined Virgin Coconut Oil which is untouched by heat or chemical treatment and left in its raw state, Raw Coconut Cream contains the original living enzymes and nutrients found in Coconut Oil to nourish the skin and eyelashes. Renowned for its anti-microbial, anti-fungal and anti-bacterial properties, Raw Coconut Cream helps to remove dirt, makeup and bacteria from the skin and prevents free radical damage with natural antioxidant protection.\nGreat for all skin types, even sensitive and acne prone complexions, Raw Coconut Cream stalls premature ageing and is great for softening hard skin on the knees and elbows. Raw Coconut Cream effortlessly removes all traces of makeup including waterproof mascara and can also be used under the arms as a natural alternative to deodorant.\nA Beauty Bay essential, Raw Coconut Cream is like no other beauty product and leaves the skin beautifully nourished, hydrated, protected and healthy with an added youthful radiance.", "product_name": "Raw Coconut Cream 70g", "brand": "RMS Beauty"},
{"price": "HK $306.50", "id": 198, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0174F_1_L.jpg/6791fbdb6d0bf98d28bd7e6b836836f5/JURL0174F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/purelyagedefyingfaceoil/", "product_description": "Jurlique Purely Age Defying Face Oil conditions and rehydrates the skin whilst smoothing wrinkles and correcting uneven skin tone.\nBoasting a 100% natural formulation enriched with Botanical and Essential Oils, Purely Age Defying Face Oil helps to protect against environmental aggressors and targets moisture loss and visible signs of ageing.\nJurlique’s Age Repair Biodynamic+ Blend helps to deeply replenish the skin and improve the skin tone whilst diminishing the appearance of fine lines and wrinkles. Purely Age Defying Face Oil is also infused with a trio of potent anti-ageing ingredients. Blackcurrant Seed Oil helps to improve elasticity and firmness, Buriti Oil reduces fine lines and wrinkles and Rock Samphire Extract helps to support collagen synthesis and promotes a firmer complexion.\nPurely Age Defying Face Oil leaves the skin feeling firm and hydrated with a more even tone and enhanced luminosity.", "product_name": "Purely Age Defying Face Oil 50ml", "brand": "Jurlique"},
{"price": "HK $100.00", "id": 199, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0060F_1_L.jpg/aaf1d77bc61baba40a019a7bd71c2c1a/MABA0060F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/elastoseamoillienthandcream/", "product_description": "Mario Badescu Elasto Seamoillient Hand Cream (118ml) contains a unique formulation of protective Seamollient and nourishing Vitamin E, making this thick, rich hand cream perfect for frequently washed hands.", "product_name": "Elasto Seamoillient Hand Cream", "brand": "Mario Badescu"},
{"price": "HK $100.00", "id": 200, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0100F_1_L.jpg/69ac25603ad5f981d581ac8824f1696b/MABA0100F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/azulenebodysoap/", "product_description": "Mario Badescu Azulene Body Soap (236ml) is a gentle, soothing body cleanser that is suitable for all skin types and especially formulated for dry and sensitive types.\nEnriched with azulene derived from chamomile and glycerin, this body wash has anti inflammatory properties and a soothing action on irritated skin. It also nourishes and purifies skin for a refreshing, thorough cleanse.", "product_name": "Azulene Body Soap", "brand": "Mario Badescu"},
{"price": "HK $97.30", "id": 201, "image_url": "-", "colour": "Light Medium 200ml – HK $97.30,\nMedium Dark 200ml – HK $97.30", "product_url": "http://beautybay.com/bathandbody/sttropez/gradualtanlotion/", "product_description": "St.Tropez Gradual Tan Lotion cleverly combines serious skin care benefits with a healthy touch of sun-kissed colour.\nEnriched with decadent moisturising benefits, Gradual Tan Lotion soothes, smoothes and hydrates skin whilst building a gradual golden tan and maintaining it for longer than ever before. Ideal for everyday use, Gradual Tan Lotion eliminates the dreaded tell-tale self-tan scents and leaves skin refreshingly fragrant with an uplifting and subtle scent.\nPerfect for adding a subtle golden glow to pasty winter skin or boosting a natural summer tan, Gradual Tan Lotion leaves the skin deliciously soft and supple with a healthy flush of sun-kissed bronze colour.\nGradual Tan Lotion is available in two stunning shades to perfectly compliment your natural skin tone.", "product_name": "Gradual Tan Lotion", "brand": "St.Tropez"},
{"price": "HK $52.90", "id": 202, "image_url": "http://images.contentful.com/eoaaqxyywn6o/KOCO0002F_1_L.jpg/703d4563c3639f2a70eed80f9ec3e3f9/KOCO0002F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/kocostar/handmoisturepack/", "product_description": "An ultra-moisturising treatment for dry, over worked hands.\nComprised of two paper gloves enveloped in a nourishing serum, the Hand Moisture Pack is an innovative, intensive treatment that delivers much needed nourishment to skin. Wearing a glove on each hand, the unique mask gets to works deeply moisturising and soothing dehydrated skin cells leaving hands feeling silky soft and glowing with health.", "product_name": "Hand Moisture Pack", "brand": "Kocostar"},
{"price": "HK $147.60", "id": 203, "image_url": "http://images.contentful.com/eoaaqxyywn6o/FRBO0004F_1_L.jpg/7b284969a526deebc182c74b436d7b70/FRBO0004F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/frankbody/frankpeppermintcoffeescrub/", "product_description": "An exfoliating body scrub.\nVegan and minty fresh, Frank Peppermint Coffee Scrub is the perfect post-gym treat. To be used 2-3 times weekly, soothe muscles, wash away bacteria and exfoliate the skin for a fresh, clear and healthily hydrated complexion.", "product_name": "Frank Peppermint Coffee Scrub 200g", "brand": "Frank Body"},
{"price": "HK $340.40", "id": 204, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0217F_1_L.jpg/62ab53873043da471db2bf4db0f2ee3b/THWO0217F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/intransitbalancingbodylotion/", "product_description": "This Work In Transit Balancing Body Lotion offers a lusciously hydrating experience for the skin.\nMoisturising and relaxing, In Transit Balancing Body Lotion promotes the healthy development of the skin whilst ensuring it maintains a natural glow.\nA luxurious infusion of Ginger and Nutmeg Essential Oils envelopes the skin and leaves it with a calming veil of warmth, whilst a combination of Lavender and Shea Butter ensure that it is bathed in hydration all day long.", "product_name": "In Transit Balancing Body Lotion 300ml", "brand": "This Works"},
{"price": "HK $145.70", "id": 205, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0112F_1_L.jpg/c9f69dd2bb07076a26a5e17eba7fb66d/JURL0112F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/rosewaterbalancingmist/", "product_description": "Jurlique Rose Moisture Plus Balancing Mist is a refreshing spray to soften and hydrate skin throughout the day.\nIdeal for normal/combination skin types this daily balancing mist features the relaxing scent of Rose to restore and hydrate the complexion. Jurlique’s blend of potent Botanical Extracts including Grapefruit Seed provides natural antioxidant protection whilst a blend of Rose and Aloe Vera softens, soothes and calms skin.\nWith a fusion of Marshmallow, Glycerin, Avocado and Rose Hip Oils that work together to prevent moisture loss whilst intensely hydrating the skin. This refreshing spray is the perfect addition to any handbag.\nRose Moisture Plus Balancing Mist leaves skin feeling refreshed, balanced and soothed.", "product_name": "Rosewater Balancing Mist 50ml", "brand": "Jurlique"},
{"price": "HK $127.00", "id": 206, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0013F_1_L.jpg/6c5c81fecdc200e8f50da43f50531918/COSH0013F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/sheltermassageoil/", "product_description": "Como Shambhala Shelter Massage Oil clears the mind and boosts circulation.\nRecreate the Como Shambhala Spa experience at home with this luxurious 100% natural massage oil. Enhanced with a stimulating blend of Basil, Eucalyptus and Lemon, Shelter Massage Oil remains well balanced with healing Ginger and Camphor Essential Oils.\nShelter Massage Oil is free from Parabens, Silicone and Sulphates and leaves the skin feeling smooth whilst the mind remains clear and circulation is boosted for a renewed sense of well-being.", "product_name": "Shelter Massage Oil 50ml", "brand": "Como Shambhala"},
{"price": "HK $142.90", "id": 207, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZESK0002F_1_L.jpg/9a3c52330336c86987e4c42401314126/ZESK0002F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/zeroskin/coconutcoffeescrub/", "product_description": "A fragrant body scrub.\nEnveloping the body with a light coconut scent, Coconut Coffee Scrub gently and effectively exfoliates. Stimulating blood flow, treat acne, cellulite and eczema whilst simultaneously protecting and repairing for radiant, softer skin.", "product_name": "Coconut Coffee Scrub 200ml", "brand": "Zeroskin"},
{"price": "HK $142.90", "id": 208, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZESK0004F_1_L.jpg/15d157baed3959e8037f1f6222322f51/ZESK0004F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/zeroskin/chocolatecoffeescrub/", "product_description": "A fragrant body scrub.\nEnveloping the body with a rich chocolate scent, Chocolate Coffee Scrub gently and effectively exfoliates. Stimulating blood flow, treat acne, cellulite and eczema whilst simultaneously protecting and repairing for radiant, softer skin.", "product_name": "Chocolate Coffee Scrub 200ml", "brand": "Zeroskin"},
{"price": "HK $306.50", "id": 209, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0042F_3_L.jpg/5766cab37eb5aa67863ecbd462a29de1/JURL0042F_3_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/skinbalancingfaceoil/", "product_description": "Jurlique Skin Balancing Face Oil is a luxurious facial treatment which hydrates skin and softens the appearance of fine lines and wrinkles.\nInfused with an intensely hydrating blend of Evening Primrose Oil, Macadamia Seed Oil and Marshmallow, Skin Balancing Face Oil softens skin to improve its overall condition. Ideal for all skin types, this lightweight, moisturising treatment can be used day or night to keep skin hydrated and balanced.\nRose Hip Oil and Safflower Oil work in tandem to soften fine lines and wrinkles and firm skin for a youthful complexion whilst Shea Butter, Avocado Oil and Jojoba Oil provide luscious moisturisation and gives skin a smoother, healthier appearance.\nSkin Balancing Face Oil improves skin elasticity and absorbs quickly to instantly deliver a velvety smooth finish. Skin is left soft, smooth, hydrated and protected.", "product_name": "Skin Balancing Face Oil 50ml", "brand": "Jurlique"},
{"price": "HK $660.20", "id": 210, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BIEF0004F_1_l.jpg/e9b0a0acd05ffc0dfa246d59048afe64/BIEF0004F_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/bioeffect/bodyintensiveagedefyingbodyserum/", "product_description": "BIOEFFECT Body Intensive Age Defying Body Serum replenishes, softens and hydrates the skin and targets specific body concerns such as dryness and uneven skin tone for a boost of youthful radiance.\nFormulated with BIOEFFECT’s highly acclaimed EGF (Epidermal Growth Factor); a substance which occurs naturally in human skin and has the ability to increase the rate of cell turnover within the skin. While the skin is young, it produces enough of its own EGF to maintain its youthful radiance. As we age, the skin slows its natural production of EGF and begins to lose firmness and elasticity. Fine lines appear and the surface epidermis becomes duller in appearance. Over time the amount of collagen and elastin in the skin‘s dermal layers dwindles, the skin grows thinner and wrinkles begin to form. By applying Body Intensive Age Defying Body Serum to the skin, it is possible to stimulate the natural process of cell renewal and minimise the visible effect of skin ageing.\nThis deeply nourishing body serum improves the skins tone and texture and has a firming effect on the body. Ideal for areas of the body which often lose firmness and elasticity through ageing such as the bust, arms, legs and décolleté, Body Intensive Age Defying Body Serum also combats dryness and rough skin.\nBody Intensive Age Defying Body Serum adds a youthful radiance and luminosity to the skin and reverses the ageing process of cellular activators which causes skin to renew itself less frequently and begin to wrinkle. Other signs associated with ageing such as dullness, dry spots and uneven pigmentation begin to show dramatic improvements within days of initial use.\nSuitable for all skin types, Body Intensive Age Defying Body Serum leaves the skin fully hydrated and silky soft with a noticeable improvement in tone, suppleness, texture and firmness.", "product_name": "Body Intensive Age Defying Body Serum 75ml", "brand": "BIOEFFECT"},
{"price": "HK $317.40", "id": 211, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MALA0001F_1_L.JPG/21503a8645dd5972e27714168bef2e4b/MALA0001F_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/madamelala/selftanmousseregular/", "product_description": "A long-lasting false tan.\nDeveloping in three hours, Self Tan Mousse is lightweight and quick drying. Formulated with hydrating ingredients, apply evenly over clean, dry skin for a natural, golden glow that lasts for up to 10 days.", "product_name": "Self Tan Mousse Regular 200ml", "brand": "Madame LA LA"},
{"price": "HK $138.10", "id": 212, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NATQ0015F_4_L.jpg/aa17ec8007e72a275255f4d52a475e12/NATQ0015F_4_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/nailtiques/handconditioner/", "product_description": "Nailtiques Hand Conditioner is a nourishing hand cream specially formulated to soften cuticles and skin without softening or weakening nails.\nFeaturing a lightweight, non-greasy formula enriched with a highly concentrated blend of pure Aloe and Jojoba Oils, Hand Conditioner rehydrates and conditions the hands and cuticles. Fast absorbing, this high-performance hand treatment leaves the hands and cuticles soft, healthy and nourished whilst maintaining strong, healthy, flexible nails.", "product_name": "Hand Conditioner 114g", "brand": "Nailtiques"},
{"price": "HK $95.10", "id": 213, "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO0113F_1_L.jpg/c714f376812f32342e069c1e5af10cd0/YETO0113F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/yesto/carrotsdailymoisturebodylotion/", "product_description": "Yes To Carrots Daily Moisture Body Lotion is a 99% natural body moisturiser which smoothes and hydrates normal to dry skin types.\nRich in Beta Carotene and Antioxidants, Carrots Daily Moisture Body Lotion is formulated with Organic Carrots and Sweet Potatoes which work harmoniously to protect the skin from environmental aggressors and nurture the skin with essential Fatty Acids. Safflower Oil promotes skin softness whilst the Paraben free formula is suitable for sensitive skin.", "product_name": "Carrots Daily Moisture Body Lotion 350ml", "brand": "Yes To"},
{"price": "HK $189.90", "id": 214, "image_url": "http://images.contentful.com/eoaaqxyywn6o/FRBO0012F_1_L.jpg/9ed597012dd17d6db0865240e3876191/FRBO0012F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/frankbody/bodycream/", "product_description": "A nourishing body moisturiser.\nFor dry, dehydrated skin, Body Cream intensely nourishes with its rich and creamy consistency. 100% vegan, use post shower to lock in moisture and create silky soft, shining skin that smells deliciously like frosting.", "product_name": "Body Cream 200ml", "brand": "Frank Body"},
{"price": "HK $266.00", "id": 215, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SICO0004F_1_L.jpg/9c2c7f659a4e1465b62ff95a3d0f3e2f/SICO0004F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/sisterco/rawcoconutcoffeesugarscrub/", "product_description": "A rejuvenating skin resurfacing scrub ideal for troubled skin.\nFormulated with a number of skin-loving organic ingredients, the Raw Coconut & Coffee Sugar Scrub works to nourish the skin whilst gently lifting away dead skin cells. The base of granulated coffee has a stimulating effect, achieving an increased blood flow which in turn anti-oxidises the skin. This helps to show a massive improvement in a number of woes such as stretch marks, eczema, cellulite and psoriasis, helping feel more confident and comfortable in your body.", "product_name": "Raw Coconut & Coffee Sugar Scrub 300g", "brand": "Sister & Co."},
{"price": "HK $411.00", "id": 216, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/tanluxehydramousse_1_gl.jpg", "colour": "Light-Medium 200ml – HK $411.00,\nMedium-Dark 200ml – HK $411.00", "product_url": "http://beautybay.com/bathandbody/tanluxe/hydramousse/", "product_description": "A transparent false tan.\nDeveloping in 4-6 hours, Hydra Mousse colours and hydrates from head to toe. Increasing skin's moisture levels, the vitamin enriched formula conditions and softens for quick, natural and enviable results.", "product_name": "HYDRA MOUSSE", "brand": "TAN-LUXE"},
{"price": "HK $466.60", "id": 217, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/talu0010f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/tanluxe/tanbooster/", "product_description": "A tan activator, accelerator and extender.\nEnhancing and deepening a natural tan, Tan Booster works before, during and after sun exposure. To be mixed with moisturisers and oils, start applying two weeks before holidaying to prepare and encourage safe, long-lasting tanning.", "product_name": "Tan Booster 30ml", "brand": "TAN-LUXE"},
{"price": "HK $166.70", "id": 218, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABB0007F_1_L.jpg/a5cdb766c0fe4f0708f73ba75b31aecf/MABB0007F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mauibabe/amazinghandbodylotion/", "product_description": "Maui Babe Amazing Hand & Body Lotion is a deeply nourishing and hydrating cream for all skin types.\nEnriched with Macadamia Nut Oil, vitamins and Aloe Vera, this year round moisturiser will replenish skins moisture barrier, whilst strengthening skins resistance to every day drying conditions. Amazing Hand & Body Lotion smoothes and nourishes for super soft, glowing skin every day.", "product_name": "Amazing Hand & Body Lotion 236ml", "brand": "Maui Babe"},
{"price": "HK $148.10", "id": 219, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI-vitaliberatafFabulousselftanninglotion_1_GL.jpg/579335a3ad18411f62cb9ae5701ca290/vitaliberatafFabulousselftanninglotion_1_GL.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/fabulousselftanningtintedlotionmedium/", "product_description": "A non-toxic, odourless tanning lotion ideal for lighter skin tones.\nWith seventy two hours' worth of moisture locking technology the Fabulous Self Tanning Tinted Lotion gives instant colour and works to achieve a natural looking tan within four to eight hours. Enriched with plant extracts and botanicals the quick dry formula penetrates the skin for a conditioned and hydrated glow.", "product_name": "Fabulous Self Tanning Tinted Lotion Medium 100ml", "brand": "Vita Liberata"},
{"price": "HK $285.70", "id": 220, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI-vitaliberataphenomenal23weektanlotion_1_GL.jpg/a6a9450c264536d0f0d1defdb9cf3a70/vitaliberataphenomenal23weektanlotion_1_GL.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/phenomenalfineassilk23weektanlotiondark/", "product_description": "A long wearing seventy two hour moisture locking tan lotion for a rich bronzed hue ideal for tan to deep skin tones.\npHenomenal Fine As Silk 2-3 Week Tan Lotion provides an instant tan that continues to develop for up to eight hours. Formulated with natural and organic ingredients the thick cream like consistency smooths over the skin to provide a quick drying natural tan without the classic fake tan odour.", "product_name": "pHenomenal Fine As Silk 2-3 Week Tan Lotion Dark 150ml", "brand": "Vita Liberata"},
{"price": "HK $285.70", "id": 221, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI-vitaliberataphenomenal23weekmousse_1_GL.jpg/a9695cc6985e94419e9080eb0b16788e/vitaliberataphenomenal23weekmousse_1_GL.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/phenomenallightasair23weektanmoussemedium/", "product_description": "An incredibly long lasting tanning mousse ideal for medium to tan skin tones.\nCreated with innovative pHenO2 technology which delivers an anti-aging bronzed glow lasting up to three weeks, pHenomenal Light As Air 2-3 Week Tan Mousse glides over the skin's surface providing a streak free instant tan that continues to develop. Quick drying and odour free you can apply and go within minutes.", "product_name": "pHenomenal Light As Air 2-3 Week Tan Mousse Medium 125ml", "brand": "Vita Liberata"},
{"price": "HK $147.60", "id": 222, "image_url": "http://images.contentful.com/eoaaqxyywn6o/SCLO0011F_1_L.jpg/dd85de4b17b8dca1b09a164951b9f4c6/SCLO0011F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/scrublove/activecharcoalbodyscrubcucumberbamboo/", "product_description": "A detoxifying body scrub.\nExfoliating and tightening pores, Active Charcoal Body Scrub Cucumber & Bamboo cleanses and protects. Packed with essential minerals, skin is deeply nourished and balanced to control oil production and enhance radiance.", "product_name": "Active Charcoal Body Scrub Cucumber & Bamboo 200g", "brand": "Scrub Love"},
{"price": "HK $114.20", "id": 223, "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO0129F_1_L.jpg/b9809806b28749ca1908e4fa07ea20a2/YETO0129F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/yesto/coconutultralightspraybodylotion/", "product_description": "Yes To Coconut Ultra Light Spray Body Lotion is a super light body moisturiser with an innovative spray applicator which reaches all areas of the body.\nIdeal for very dry skin types, Coconut Ultra Light Spray Body Lotion sprays onto the skin evenly without leaving any greasy residue. Featuring a 97% Natural super snazzy formula which is enriched with Virgin Coconut and Jojoba Oils, this cruelty free body lotion spray penetrates the skin in such a way only oils can to replenish lost moisture and promote velvety softness.\nA Beauty Bay essential addition to any bathing regime, Coconut Ultra Light Spray Body Lotion leaves the skin beautifully hydrated, silky soft and healthy.", "product_name": "Coconut Ultra Light Spray Body Lotion 295ml", "brand": "Yes To"},
{"price": "HK $215.80", "id": 224, "image_url": "http://images.contentful.com/eoaaqxyywn6o/INES0061F_1_L.jpg/ce93bee6fc06833f66b1fbc877a9fa68/INES0061F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/skincare/institutesthederm/repairapressoleilaftersunrepairtanenhancingantiwrinklecream/", "product_description": "Institut Esthederm Repair Apres Soleil After Sun Repair Tan Enhancing Anti Wrinkle Cream has been formulated to treat sunburn immediately and rapidly and to repair the skin after over-exposure to the sun. The soothing and desensitising complex relieves and decreases immediately red patches and pains associated with sunburn.\nThe hydrating complex hydrates and restructures the hydrolipidic film of the aggressed skin while the cellular water content helps optimise the cell's energetic environment.\nRepair Apres Soleil After Sun Repair Tan Enhancing Anti Wrinkle Cream from Institut Estherderm rehydrates and calms skin, whilst preparing it for any further exposure. With repeated use, the skin becomes more resistant and better prepared against solar aggressions whilst noticeably reducing the appearance of sun induced signs of ageing.", "product_name": "Repair Apres Soleil After Sun Repair Tan Enhancing Anti Wrinkle Cream 50ml", "brand": "Institut Esthederm"},
{"price": "HK $116.90", "id": 225, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO8133F_1_L.jpg/53693ba2329cd170ead8c64853594f23/THWO8133F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/choosesleep2017ltdedition/", "product_description": "A sleep inducing duo.\nIn convenient, pocket-sized bottles, Choose Sleep 2017 Ltd Edition is perfect for travelling. With natural and clinically proven formulas, the Lavender and Camomile fragrance soothes and destresses for an easy, uninterrupted night's sleep.", "product_name": "Choose Sleep 2017 Ltd Edition", "brand": "This Works"},
{"price": "HK $292.30", "id": 226, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COOL0003U_1_L.jpg/f5c56c0f39cd724c8b9ed011618c3f03/COOL0003U_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/coola/mineralsunscreenbabyspf50unscentedmoisturiser/", "product_description": "A mineral sunscreen which protects baby skin and extra sensitive skin types from UV damage.\nMineral Sunscreen Baby SPF50 Unscented Moisturiser safeguards baby skin from harmful sun rays and pollutants like smog and dust. The fragrance-free formula utilises a blend of organic oils to naturally boost SPF protection whilst a blend of fruit butters work synergistically with plant oils to keep baby skin beautifully soft, hydrated and fully protected.", "product_name": "Mineral Sunscreen Baby SPF50 Unscented Moisturiser 89ml", "brand": "COOLA"},
{"price": "HK $226.10", "id": 227, "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL0005F_1_L.jpg/c0bd5ecf6a663ed3021b6e10e283a7c8/JURL0005F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/jurlique/replenishingfoamingcleanser/", "product_description": "Jurlique Replenishing Foaming Cleanser intensely hydrates and softens dry skin whilst lifting away surface impurities.\nThis luscious foaming cleanser provides dry skin with hydration and protects against moisture loss whilst cleansing skin and effectively removing impurities and make-up. Marshmallow deeply hydrates and softens the skin whilst Violet and Calendula help to soothe and rebalance any skin sensitivity.\nReplenishing Foaming Cleanser is enriched with a blend of Macadamia and Avocado Oils to comforts skin whilst protecting against moisture loss during the cleansing process. Ideal for all skin types, especially dry skin, this luxurious moisturising cleanser leaves skin feeling clean, hydrated, soft and refreshed.", "product_name": "Replenishing Foaming Cleanser 200ml", "brand": "Jurlique"},
{"price": "HK $172.20", "id": 228, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0075F_1_L.jpg/e2889ad4e1e51eddff9f9e2de20ad3b8/MABA0075F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/mariobadescu/raspberrybodyscrub/", "product_description": "Mario Badescu Raspberry Body Scrub (236ml) is an indulgent body exfoliant that gently buffs away dull, dry skin from the entire body.", "product_name": "Raspberry Body Scrub", "brand": "Mario Badescu"},
{"price": "HK $95.20", "id": 229, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI0007F_1_L.jpg/01eec125bd73073c80c32946f5171ea8/VILI0007F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/skinpolishsuperfinemoisturisingexfoliator/", "product_description": "The perfect preparation before your Vita Liberata tan.\nThe Skin Polish Fine Moisturising Exfoliator has been formulated with micro fine beads which gently buff away dead cells revealing smooth and hydrated skin. The addition of nourishing moisture locking technology ensures skin is soft and hydrated for up to seventy two hours.", "product_name": "Skin Polish Super Fine Moisturising Exfoliator 175ml", "brand": "Vita Liberata"},
{"price": "HK $238.10", "id": 230, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/alph0134f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/alphah/liquidgoldluxebodyresurfacingcloths/", "product_description": "A pack of twenty-five rejuvenating body cloths.\nEnriched with skin rejuvenating benefits synonymous with the Liquid Gold family, the Liquid Gold Luxe Body Resurfacing Cloths will soon become your favourite head to toe exfoliation method. With two contrasting textures either side, these innovative wipes diminish the appearance of dry skin, blemishes and uneven skin tones as well as being ideal for pre and post tanning.", "product_name": "Liquid Gold Luxe Body Resurfacing Cloths 25Pieces", "brand": "Alpha-H"},
{"price": "HK $150.70", "id": 231, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANTI0019F_1_L.jpg/a1a32f7b9bc3ff558ba85b65ee7d277f/ANTI0019F_1_L.jpg", "colour": "Saviour Skin Balm 75g – HK $233.20,\nSaviour Skin Balm 30ml – HK $150.70,\nSaviour Skin Balm 30ml – HK $150.70", "product_url": "http://beautybay.com/skincare/antipodes/saviourskinbalm/", "product_description": "ANTIPODES Saviour Skin Balm is a multi-purpose skin treatment and natural remedy which conditions and repairs troubled skin.\nOffering sure salvation to common skin issues such as grazes, dryness, blemishes and irritation, Saviour Skin Balm is infused with nature’s richest oils and packed with antibacterial and antifungal benefits of Totara and Australian Tea Tree. Totara Extract is rich in antioxidants which combat free radical aggressors and is extremely therapeutic whilst Tea Tree helps to absorb excess oil, clear blemishes and refines the skin tone.\nAntioxidant rich Vinanza Grape from award-winning Marlborough Sauvignon Blanc Grape Seeds helps to neutralise free radical damage, improve elasticity and firmness and prevent moisture loss. Suitable for all skin types including sensitive and irritated skin, Saviour Skin Balm utilises Echinacea to optimise cell and skin repair.\nIdeal for tending to many common skin ailments including chapped lips, sunburn, sore muscles and razor burns, Saviour Skin Balm can be used on all the family and is a bathroom essential.", "product_name": "Saviour Skin Balm", "brand": "Antipodes"},
{"price": "HK $146.20", "id": 232, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANTI0022F_2_L.jpg/b5cfbb020d3e340907e39a891dfd495c/ANTI0022F_2_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/antipodes/jubilationhandbodycream120ml/", "product_description": "ANTIPODES Jubilation Ultra Nourishing Body Cream is a deeply nourishing and hydrating body moisturiser.\nLoaded with key nutrients such as Omegas 3, 6 & 9, Vitamins A, C & E and a blend of Pure Plant Oils, Jubilation Ultra Nourishing Body Cream replenishes the skin and optimises hydration levels. Suitable for all skin types, Jubilation Ultra Nourishing Body Cream is suitable for daily use and has a rich, buttery texture which sinks deeply into the skin without any greasy residue.\nJubilation Ultra Nourishing Body Cream has a fresh, subtropical scent with an aromatic blend of Wild Blackcurrant and exotic Feijoa Fruit which also work synergistically to neutralise free radical damage. Sure to be a Beauty Bay best-seller, Jubilation Ultra Nourishing Body Cream leaves the skin feeling silky soft, hydrated and healthy.", "product_name": "Jubilation Hand & Body Cream 120ml 120ml", "brand": "Antipodes"},
{"price": "HK $266.60", "id": 233, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/talu0013f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/tanluxe/thebutter/", "product_description": "A multi-tasking false tan.\nLightweight and quick-drying, The Butter is a nourishing gradual tan that locks in moisture for up to 24 hours. Refreshing and illuminating dry, dull skin, use regularly as a skin perfecting treatment that delivers natural colour in 4-6 hours.", "product_name": "The BUTTER 200ml", "brand": "TAN-LUXE"},
{"price": "HK $322.40", "id": 234, "image_url": "http://images.contentful.com/eoaaqxyywn6o/PAIS0005F_3_L.jpg/5b8fdad8320c58d49ca40d847d50fd12/PAIS0005F_3_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/paiskincare/rosehipbioregeneratefruitseedoilblend/", "product_description": "Pai Skin Care Rosehip BioRegenerate Fruit & Seed Oil Blend is a unique formula which works to help reduce the appearance of scars, stretch marks, fine lines and UV damage in all skin types.\nIt is infused with concentrated fruit hip oil, with twice the regenerative sterols and five times the caretonoids of seed oil and delivers Trans-Retinoic Acid directly to the epidermis, which converts to Vitamin A to boost the skin's natural healing process.\nWith daily use Rosehip oil conditions the skin, improving skin firmness, elasticity and suppleness.\nClinical studies show Rosehip is effective at improving the appearance of scars, stretch marks, sun damage and fine lines.\nVolcanically sourced CO2 is used to gently extract the oils while preserving the complete properties of the plant. Unlike cold pressing it eliminates all germs and prevents oxidization of the oil.\nPai Skin Care Rosehip Oil contains a 100% natural Vitamin E (from sunflower) that reduces the photo-aging effects of UVA light on the skin. It has the dual antioxidant benefit of keeping the oil fresh and in optimum condition.", "product_name": "Rosehip BioRegenerate Fruit & Seed Oil Blend 30ml", "brand": "Pai Skincare"},
{"price": "HK $377.80", "id": 235, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COOL0048U_1_L.JPG/a4ff608fb1170d2ca607bc9ebe19d52f/COOL0048U_1_L.JPG", "colour": "", "product_url": "http://beautybay.com/bathandbody/coola/mineralmakeupprimerspf30daydreamunscented/", "product_description": "A sun shielding face primer.\nSuited to all skin tones and types, Mineral Makeup Primer SPF30 is a gentle, unscented skin perfecting cream. Lightweight and water resistant, use alone or under makeup for a radiant, long-lasting finish.", "product_name": "Mineral Makeup Primer SPF30 Daydream Unscented 30ml", "brand": "COOLA"},
{"price": "HK $142.90", "id": 236, "image_url": "http://images.contentful.com/eoaaqxyywn6o/ZESK0003F_1_L.jpg/1c8d5332ec943d1b003a088a5094457e/ZESK0003F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/zeroskin/mandarincoffeescrub/", "product_description": "A fragrant body scrub.\nEnveloping the body with a light orange scent, Mandarin Coffee Scrub gently and effectively exfoliates. Stimulating blood flow, treat acne, cellulite and eczema whilst simultaneously protecting and repairing for radiant, softer skin.", "product_name": "Mandarin Coffee Scrub 200ml", "brand": "Zeroskin"},
{"price": "HK $160.80", "id": 237, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI0039F_1_L.jpg/2a9797d02b546681526a79f206b7053e/VILI0039F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/fabulousselftanningtintedmoussemedium/medium", "product_description": "A luxurious tanning mousse.\nA new and improved formula, Fabulous Self Tanning Tinted Mousse Medium creates an odourless golden glow. With instant dry technology and minimal transfer, apply the organic mousse with a mitt for perfect, even and long-lasting results that gradually fade.", "product_name": "Fabulous Self Tanning Tinted Mousse Medium 100ml", "brand": "Vita Liberata"},
{"price": "HK $158.70", "id": 238, "image_url": "http://images.contentful.com/eoaaqxyywn6o/COSH0008F_1_L.jpg/7b13fff37c88e674139234d30c14e38a/COSH0008F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/comoshambhala/calmmassageoil/", "product_description": "Como Shambhala Calm Massage Oil is an indulgent all natural oil which recreates a spa experience in the comfort of your own home.\nRelieve pent up stress and relax the mind with this mood enhancing massage oil. Formulated to relieve and heal anxiety with a powerful blend of Lavender, Geranium and Bergamot Essential Oils, Calm Massage Oil is the perfect addition to a hand or foot massage for a truly indulgent pampering experience.", "product_name": "Calm Massage Oil 50ml", "brand": "Como Shambhala"},
{"price": "HK $285.70", "id": 239, "image_url": "http://images.contentful.com/eoaaqxyywn6o/VILI-vitaliberataphenomenal23weektanlotion_1_GL.jpg/a6a9450c264536d0f0d1defdb9cf3a70/vitaliberataphenomenal23weektanlotion_1_GL.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/vitaliberata/phenomenalfineassilk23weektanlotionmedium/", "product_description": "A long wearing seventy two hour moisture locking tan lotion for a rich bronzed hue suited to light skin tones.\npHenomenal Fine As Silk 2-3 Week Tan Lotion provides an instant tan that continues to develop for up to eight hours. Formulated with natural and organic ingredients the thick cream like consistency smoothes over the skin to provide a quick drying natural tan without the classic fake tan odour.", "product_name": "pHenomenal Fine As Silk 2-3 Week Tan Lotion Medium 150ml", "brand": "Vita Liberata"},
{"price": "HK $539.60", "id": 240, "image_url": "http://a0.bb-cdn.com/assets/productimages/large/cexc0037f_1_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/cellexc/lifteffectserum/", "product_description": "Cellex-C Lift Effect Serum is specially designed to lift, smooth and firm the neck and décolleté.", "product_name": "Lift Effect Serum 120ml", "brand": "Cellex-C"},
{"price": "HK $292.30", "id": 241, "image_url": "http://images.contentful.com/eoaaqxyywn6o/thwo0121f_3_l.jpg/5737af6a9819cb3f562c7e31779ce700/thwo0121f_3_l.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/deepsleepnightoil/", "product_description": "This Works Deep Sleep Night Oil is a highly nourishing body oil designed to encourage a peaceful night’s sleep.\nThis sumptuous, non-greasy body oil absorbs quickly and deeply into the skin to help you relax after a long, stressful day. Encouraging a peaceful slumber, Deep Sleep Night Oil is the perfect, natural solution to sleep deprivation.\nAn expert fusion of Provencal Lavender calms the senses whilst Vetivert, otherwise known as the oil of tranquillity, relieves tension and stress. A blend of soothing Wild Chamomile brings peace and wellbeing, whilst antioxidant rich Grape Seed Oil effectively locks essential moisture into the skin.\nA calming and indulgent body oil, Deep Sleep Night Oil helps lull you to sleep and leaves you feeling relaxed, hydrated and gently fragranced after your night-time bath or shower. This oil easily absorbs into the skin and also reduces the signs of ageing, whilst promoting rested radiance.", "product_name": "Deep Sleep Night Oil 120ml", "brand": "This Works"},
{"price": "HK $185.70", "id": 242, "image_url": "http://images.contentful.com/eoaaqxyywn6o/THWO0208F_1_L.jpg/17657917f58970616216561ec4d8d612/THWO0208F_1_L.jpg", "colour": "", "product_url": "http://beautybay.com/bathandbody/thisworks/energybankshowergel/", "product_description": "This Works Energy Bank Shower Gel is a mood-boosting shower gel.\nDesigned to wake you up and prepare you for the day ahead, this unique shower gel boasts Natural ingredients to super charge your body and mind.\nThe Sulphate free formula contains a fusion of aromatherapeutic benefits such as Geranium which provides balance, Ylang Ylang to boost health; Rosemary helps to boost energy whilst Sandalwood assists in stimulating the mind. The gentle blend thoroughly cleanses the body and calms the senses, preparing you to face the challenges of day to day life with ease.\nReviving and re-energising, Energy Bank Shower Gel will leave the skin feeling moisturised and truly comforted.", "product_name": "Energy Bank Shower Gel 250ml", "brand": "This Works"}
]