[
{"price": "HK $382.10", "product_description": "An innovative hot styling brush designed to deliver a 'fresh from the salon' look in the comfort of your own home.\nDeveloped to add texture and volume to a number of styles, the Big Hair styling tool is the perfect way to achieve professionally blow dried results. The 42mm rotating barrel gently rotates through the strands whilst blowing heated air which when used in synergy leaves behind a high-shine, effortlessly styled look.", "product_url": "http://beautybay.com/electrical/babyliss/bighair/", "colour": "", "product_name": "Big Hair 42mm", "id": 1, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0013H_1_L.jpg/116d138db0216a0768cdf3ed82ae4580/BABY0013H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $1434.80", "product_description": "Babyliss Pro Perfect Curl is a revolutionary styling tool which allows you to create a variety of curly styles.\nAllowing the artistic control to be in your hands, Perfect Curl features patented technology which automatically draws the hair into the Ceramic curl chamber and softly holds the hair in place whilst it is heated from all directions. The perfect way to curl the hair without putting the hair under any tension or pressure, Perfect Curl also has an audio beep indicator which reminds you when the hair is ready to be released.\nPerfect Curl features multiple temperature settings to suit all hair types and offers various settings to create tight defined curls to loose waves. Unbelievably simple and quick to use, Perfect Curl even gives you the option to select the curl direction and creates beautiful, customisable results with ease and precision.", "product_url": "http://beautybay.com/electrical/babylisspro/perfectcurl/", "colour": "", "product_name": "Perfect Curl", "id": 2, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0086H_1_L.jpg/e46aa4ffe114eb03320eee517994676f/BAPR0086H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $353.50", "product_description": "Babyliss Pro Ionic Air Styler is a powerful hot styling brush which shapes styles and builds volume in all hair types.\nFeaturing a powerful 800W motor and an instant Ionic Conditioning System, Ionic Air Styler styles and volumises whilst you dry the hair and can also be used to create bouncy curls. Ionic Air Styler has a Ceramic coating on the thermal brush for an even smoother, frizz free finish.\nAvailable in two sizes for a variety of hair types and lengths, Ionic Air Styler features 3 heat and speed settings including a cool setting for added styling control.", "product_url": "http://beautybay.com/electrical/babylisspro/ionicairstyler/", "colour": "Ionic Air Styler 34mm – HK $353.50,\nIonic Air Styler 50mm – HK $353.50", "product_name": "Ionic Air Styler", "id": 3, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR-babylissproionicairstyler_1_gl.jpg/cfbfb185c49f2d5bcdff18b6c683278e/babylissproionicairstyler_1_gl.jpg", "brand": "Babyliss Pro"},
{"price": "HK $669.10", "product_description": "Babyliss Pro Titanium Expression Deep Waver is an advanced styling iron which creates deep, defined waves.\nFeaturing Titanium Ceramic plates and stylish rose gold detailing, Titanium Expression Deep Waver is the perfect styling tool for creating fabulous waves with incredible volume and shine. With a top temperature of up to 210°C and ultra-advanced Ceramic heaters, Titanium Expression Deep Waver delivers adjustable regulated temperature control for effortless styling and longer lasting results.\nTitanium Expression Deep Waver has extra large waving plates with a superior Titanium Ceramic finish and utilises Babyliss Pro’s exclusive Titanium Ceratherm System to leave the hair shiny and full of movement and volume.", "product_url": "http://beautybay.com/electrical/babylisspro/titaniumexpressiondeepwaver/", "colour": "", "product_name": "Titanium Expression Deep Waver", "id": 4, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0094H_1_L.jpg/b57a58301a4e8fbca8bb990ba6d8ebb3/BAPR0094H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $573.40", "product_description": "A unique hot styling brush designed to leave hair with a high-shine, blow dried finish.\nDeveloped by industry experts, the Diamond Radiance Diamond Big Hair Dual is the one of the easiest ways to create a healthy, voluminous blow dry from the comfort of your own home. The innovative rotating brush comes with two different sized, diamond-infused ceramic interchangeable attachments so you can achieve a customised, frizz-free finish no matter what your hair length might be!", "product_url": "http://beautybay.com/electrical/babyliss/diamondradiancediamondbighairdual/", "colour": "", "product_name": "Diamond Radiance Diamond Big Hair Dual", "id": 5, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0014H_1_L.jpg/df9d9f2112e5132e9081177dc5749c65/BABY0014H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $85.60", "product_description": "Babyliss Pro 3 In 1 Universal Diffuser is the perfect attachment for Babyliss Pro dryers to create lift, volume and frizz free curls.\nThis 3 in 1 Universal Diffuser includes 3 separate attachments to give incredible diversity and enhance your Babyliss Pro hairdryer. Soft flexible fingers add volume to hair whilst gently massaging the scalp to promote healthy hair growth whilst ensuring air is distributed evenly so curls are maintained and frizz is eliminated.\nThis 3 in 1 Universal Diffuser is the perfect accessory to enhance curly hair types.", "product_url": "http://beautybay.com/electrical/babylisspro/3in1universaldiffuser/", "colour": "", "product_name": "3 In 1 Universal Diffuser", "id": 6, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0070H_1_L.jpg/761d3cff953044ef61bf499a3986ae35/BAPR0070H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $305.70", "product_description": "Babyliss Pro Dial A Heat Conical Wand is an iconic styling tool for creating an array of curly styles.\nDesigned for people who want total control and flexibility to express their creative flair, Dial A Heat Conical Wand is simple to use and has 25 heat settings that gives you versatility and makes the wand ideal for all hair types and thickness. This has to be the easiest curler/styler invented to date as you just simply wrap the hair around the barrel to create classic curls, flicks and soft waves.\nRecently reinvented to deliver faster heat up, improved heat recovery and higher temperatures, Dial A Heat Conical Wand guarantees faster, longer lasting styling results and is available in a variety of colours and sizes.", "product_url": "http://beautybay.com/electrical/babylisspro/dialaheatconicalwand/", "colour": "Black 32-19mm – HK $382.10,\nBlack 25-13mm – HK $305.70,\nHot Pink 32-19mm – HK $382.10", "product_name": "Dial A Heat Conical Wand", "id": 7, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR-babylissprodialaheatconicalwand_1_gl.jpg/90905381e0c554095a5de29ad2f347aa/babylissprodialaheatconicalwand_1_gl.jpg", "brand": "Babyliss Pro"},
{"price": "HK $765.20", "product_description": "A high-powered hair dryer.\nOffering high-quality salon performance at home, Boutique Salon Hair Dryer creates smooth, sleek results. With three heat and two speed settings, experience quick drying results with 30% faster air speed than BaByliss' current best seller. Neutralising the positive ion build up in hair, create a frizz and static free finish before setting with the cold shot button for long-lasting perfection.", "product_url": "http://beautybay.com/electrical/babyliss/boutiquesalonhairdryer/", "colour": "", "product_name": "Boutique Salon Hair Dryer", "id": 8, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0016H_1_L.jpg/0c58317934148f68b167c5580af18533/BABY0016H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $526.10", "product_description": "Babyliss Pro Titanium Expression Big Hair ensures that a luxuriously shaped style is effortlessly achieved.\nPowerful yet kind to the hair, Titanium Expression Big Hair creates impeccable smoothness and volume, resulting in a phenomenal finish. Incredible waves and dramatic shine is guaranteed with this fabulous hot air styler, which combines an ionic rotating premium titanium barrel and a glamorously sleek handle to allow for full creative control.\nFeaturing a mixture of natural Boar and firm Nylon bristles, Pro Titanium Expression Big Hair delivers flawless results every time, no matter the look. Promoting an elegantly frizz-free finish, this decadently designed hair styling necessity combines beauty with efficiency to create the perfect hair.\nGlamorously shape and style the tresses with the iconic Pro Titanium Expression Big Hair.", "product_url": "http://beautybay.com/electrical/babylisspro/titaniumexpressionbighair/", "colour": "", "product_name": "Titanium Expression Big Hair", "id": 9, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0129H_1_L.jpg/20348f50f5e6d1af20a6303deca6785c/BAPR0129H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $186.50", "product_description": "Blinc Heated Eyelash Curler shapes the lashes in seconds with extravagant, long lasting curves.\nDesigned to work without clamping the lashes or applying excessive pressure, Heated Eyelash Curler curls the lashes without unnecessary damage. Not only is it safer for the lashes but heated curls last longer than curls created by pressure and allows you to customise your lash curls to make your eyes look wider, more alert and youthful.\nHeated Eyelash Curler delivers the precise amount of heat that can set a long lasting curl and has a simple yet advanced design which offers optimal control and allows you to curl even the finest and shortest of lashes.\nReady to use in just 30 seconds, Heated Eyelash Curler has a built in safety guard which prevents contact with your eyes and skin.", "product_url": "http://beautybay.com/accessories/blinc/heatedeyelashcurler/", "colour": "", "product_name": "Heated Eyelash Curler", "id": 10, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BLIC0012F_1_L.jpg/b5fd6d494bfd14b0b9347ce1c6ece81c/BLIC0012F_1_L.jpg", "brand": "Blinc"},
{"price": "HK $478.30", "product_description": "A ceramic hair styler.\nCreating enviable hair styles, Boutique Salon Deep Waves combines fashion and performance with these salon quality irons to wave and crimp hair. Suitable for all hair types, it heats up in thirty seconds to a maximum temperature of 200C with three heat settings.", "product_url": "http://beautybay.com/electrical/babyliss/boutiquesalondeepwaves/", "colour": "", "product_name": "Boutique Salon Deep Waves", "id": 11, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0018H_1_L.jpg/1770879dddad48201f31ea48183fcad4/BABY0018H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $545.00", "product_description": "A hair dryer that offers super-fast, professional results.\nDeveloped with a number of hair-caring technologies, the Signature Tourmaline Ionic Hair Dryer blasts the hair with a precise heat that leaves the tresses damage-free. The lightweight, ergonomic design allows for comfortable control whilst various heat and speed settings create a customised blow dried finish you can't help but love.", "product_url": "http://beautybay.com/electrical/nume/signaturetourmalineionichairdryer/", "colour": "Black – HK $908.20,\nTurquoise – HK $545.00", "product_name": "Signature Tourmaline Ionic Hair Dryer", "id": 12, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME-numesignaturetourmalineionichairdryer_1_GL.jpg/1ad16708d0f373ab92bcb942e6bf00c3/numesignaturetourmalineionichairdryer_1_GL.jpg", "brand": "NuMe"},
{"price": "HK $430.00", "product_description": "Babyliss' GT ionic is a compact and powerful dryer that combines the technologies of ionic and ceramic to give a perfect result. This dryer is 25% more powerful, speeding up your drying time considerable. An ionic hairdryer produces a permanent stream of Ions that surrounds and conditions your hair, reducing static electricity and smoothing the outer layer of the hair cuticle to leave hair looking and feeling soft, smooth and shiny. Suitable for all hair lengths.\nFeatures:", "product_url": "http://beautybay.com/electrical/babylisspro/gtionic/", "colour": "", "product_name": "GT ionic", "id": 13, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0012H_1_L.jpg/0824d43af5bbe4fa457d1bafb801e84a/BAPR0012H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $56.90", "product_description": "Babyliss Pro Ionic Diffuser has been specifically designed for Babyliss Pro Ionic dryers.\nGently diffusing air and heat for a perfectly smooth, frizz free blow dry, this diffuser reduces drying time whilst ensuring hair is enhanced with volume, shine and left incredibly smooth.", "product_url": "http://beautybay.com/electrical/babylisspro/ionicdiffuser/", "colour": "", "product_name": "Ionic Diffuser", "id": 14, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0071H_1_L.jpg/b5aac97d17ad8a5cabfdfaa3562dbd9c/BAPR0071H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $251.10", "product_description": "Babyliss Pro Ceramic Dial A Heat Curling Tong is a re-vamped and advanced version of the classic Babyliss tongs.\nThe Ceramic barrel ensures that the tong heats up fast and gives a smooth, shiny finish. Ceramic Dial A Heat Curling Tong also distributes heat evenly resulting in a perfect natural curl. The Ceramic Dial A Heat Tong has 25 heat settings, so the temperature will always be correct to your hair type and has been renovated to become 10% hotter than the predecessors.\nAvailable in a range of sizes, Ceramic Dial A Heat Curling Tong offer faster heat up and heat recovery and a comfort grip handle for ease of use.", "product_url": "http://beautybay.com/electrical/babylisspro/ceramicdialaheatcurlingtong/", "colour": "Ceramic Dial A Heat Curling Tong 13mm – HK $251.10,\nCeramic Dial A Heat Curling Tong 24mm – HK $358.70,\nCeramic Dial A Heat Curling Tong 32mm – HK $358.70", "product_name": "Ceramic Dial A Heat Curling Tong", "id": 15, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR-babylissproceramicdialaheatcurlingtong_1_gl.jpg/853fd5652337564a6038dd6b588c67ef/babylissproceramicdialaheatcurlingtong_1_gl.jpg", "brand": "Babyliss Pro"},
{"price": "HK $382.10", "product_description": "A fiercely feminine curling wand designed to impart voluptuous waves.\nDeveloped to add enviable body and shine, the Boutique Salon Soft Waves is the perfect way to achieve an on-trend finish to any look. Then 34mm, extra-long barrel works on all hair lengths to create effortless waves and texture free from troublesome kinks.", "product_url": "http://beautybay.com/electrical/babyliss/boutiquesalonsoftwaves/", "colour": "", "product_name": "Boutique Salon Soft Waves 34mm", "id": 16, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0012H_1_L.jpg/f94303489d398e628a943d4fd627858f/BABY0012H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $2009.20", "product_description": "T3 Whirl Trio is an innovative and versatile curling wand which perfectly creates any wavy or curly style instantly.\nAesthetically pleasing with a rose gold design and offering five different heat settings, Whirl Trio features three versatile, multi-tasking, interchangeable barrels. Created with a camera inspired precision locking mechanism, this hair styling tool comes with 1\", 1.25\"-.75\" and 1.5\" inch barrels.\nWhirl Trio promotes healthy, undamaged hair whilst creating a multitude of designs with its Ionic system. SinglePassÙ Radial Technology maintains a consistent temperature for even styling whilst the Tourmaline and Ceramic barrels banish frizz and enhance shine.\nStyling the hair immediately, this incredible beauty essential provides a flawless, glossy finish that is perfect for all hair types. Big waves, singular spirals or fresh-from-the-beach waves are only a Whirl Trio away.\nIndulge inthe endless styling possibilities with this revolutionary beauty tool.", "product_url": "http://beautybay.com/electrical/t3/whirltrio/", "colour": "", "product_name": "Whirl Trio", "id": 17, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TTHR0012H_2_L.jpg/45edfeb462dfb991c6bb01211de7d759/TTHR0012H_2_L.jpg", "brand": "T3"},
{"price": "HK $209.90", "product_description": "Babyliss Pro Ceramic Hot Brush has been designed with professionals in mind, so this product is built to last and heats up fast.\nThe ceramic coated barrel ensures a fast and even heat up time and the most professional glossy results each time.\nThe Hot Brush is ideal for shaping, curling and adding volume for voluptuous styles. The ceramic barrel distributes heat evenly resulting in a more natural shape.", "product_url": "http://beautybay.com/electrical/babylisspro/ceramichotbrush/", "colour": "Ceramic Hot Brush 13mm – HK $209.90,\nCeramic Hot Brush 15mm – HK $209.90,\nCeramic Hot Brush 18mm – HK $209.90", "product_name": "Ceramic Hot Brush", "id": 18, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR-babylissproceramichotbrush_1_GL.jpg/b881e6d3e12c966fb02f9c0b747d7207/babylissproceramichotbrush_1_GL.jpg", "brand": "Babyliss Pro"},
{"price": "HK $525.60", "product_description": "A 32mm curling wand.\nFor larger curls, Classic Wand 32mm styles hair without stripping its natural moisture and oils. Made from 100% tourmaline ceramic, heat is evenly distributed throughout the barrel for even styling that's smooth and frizz free.", "product_url": "http://beautybay.com/electrical/nume/classicwand32mm/", "colour": "Black – HK $525.60,\nTurquoise – HK $525.60,\nPink – HK $525.60", "product_name": "Classic Wand 32mm", "id": 19, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME-numeclassicwand32mm_1_GL.jpg/79009cc34ecf35d83e27e85637e3cd2a/numeclassicwand32mm_1_GL.jpg", "brand": "NuMe"},
{"price": "HK $2009.20", "product_description": "The ideal battery powered hair removal device for coarse hairs.\nThrough both treating and removing hairs the Pro Hair Removal System not only provides instant results but works to achieve a long term solution without professional treatment.  Using heat pulses provided by Thermicon technology to penetrate the follicle the hairs are removed painlessly and with ease.", "product_url": "http://beautybay.com/electrical/nono/prohairremovalsystem/blue", "colour": "", "product_name": "Pro Hair Removal System", "id": 20, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NONO0007U_1_L.jpg/f93cc35be5ab5733798a39d6d6dcd9da/NONO0007U_1_L.jpg", "brand": "no!no!"},
{"price": "HK $716.90", "product_description": "Professional high-heat straighteners in a stylish mulberry hue.\nDesigned to deliver incomparably straight results, the Elegance Pro 235 Straightener will soon become a staple in your hair styling routine. Developed with a number of innovative technologies and features the ultra-sleek tool offers beautifully glossy and frizz free results time and time again.", "product_url": "http://beautybay.com/electrical/babyliss/elegancepro235straightener/", "colour": "", "product_name": "Elegance Pro 235 Straightener", "id": 21, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0006H_1_L.jpg/2199a2d0fe6c3e6c1ddef023da616653/BABY0006H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $190.80", "product_description": "A new and improved update on the classic curling wand.\nDesigned to provide you with all the features of a barrelled curling wand but with added new and improved professional features, the Volume Wave is a must-have upgrade. With increased temperature control and innovative technologies, the 38mm curling tong imparts shiny, voluptuous waves every time.", "product_url": "http://beautybay.com/electrical/babyliss/volumewaves/", "colour": "", "product_name": "Volume Waves 38mm", "id": 22, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0007H_1_L.jpg/bb5a9be5dd22170f9b485b74ecbacbc8/BABY0007H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $1153.20", "product_description": "T3 Featherweight 2 Dryer is a technologically advanced hair dryer which offers faster and healthier drying benefits.\nExpertly created using innovative T3 Tourmaline© and SoftAireÙ technologies, Featherweight 2 Dryer dries the hair in an average of just 7 minutes. Featherweight 2 Dryer is the perfect hairdryer for creating voluminous styles and is clinically proven to deliver healthier and more beautiful looking hair. Featherweight 2 Dryer is powered by the Science of Fabulous and has a sleek, ergonomic design inspired by fashion trends.\nWith variable heat and speed settings, Featherweight 2 Dryer is suitable for all hair types and has a lightweight, ergonomic design which provides a comfortable drying experience. Proven to be healthier than air drying or regular hair dryers, Featherweight 2 Dryer is a Beauty Bay favourite.", "product_url": "http://beautybay.com/electrical/t3/featherweight2dryer/", "colour": "", "product_name": "Featherweight 2 Dryer", "id": 23, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TTHR0002H_2_L.jpg/031734976fe181b7e5d2011e9481f091/TTHR0002H_2_L.jpg", "brand": "T3"},
{"price": "HK $669.10", "product_description": "A heated styling iron.\nAvailable in three colours, Fashionista Professional Styling Iron creates multiple hair looks for maximum versatility. With rounded edges, flip, straighten and curl with ease without bending and damaging. Made with infrared technology, penetrate and heat hair directly for less styling time and minimal heat exposure.", "product_url": "http://beautybay.com/electrical/nume/fashionistaprofessionalstylingiron/", "colour": "Black – HK $669.10,\nPink – HK $669.10,\nTurquoise – HK $669.10", "product_name": "Fashionista Professional Styling Iron", "id": 24, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME-numefashionistaprofessionalstylingiron_1_GL.jpg/e579d853d3a6253dd29ee980015b6652/numefashionistaprofessionalstylingiron_1_GL.jpg", "brand": "NuMe"},
{"price": "HK $860.40", "product_description": "The struggle of wanting super straight hair all the time is over thanks to these hair-loving straighteners.\nGet sleek, damage-free results every time with NuMe's Megastar Professional Ceramic Flat Iron. Developed with a number of hair-caring technologies included within a lightweight design, the straighteners are able to smooth the hair to a super pin-straight finish without any troublesome or unruly frizz.", "product_url": "http://beautybay.com/electrical/nume/megastarprofessionalceramicflatiron/", "colour": "Black – HK $860.40,\nTurquoise – HK $860.40", "product_name": "Megastar Professional Ceramic Flat Iron", "id": 25, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME-numemegastarprofessionalceramicflatiron_1_GL.jpg/d73c48debf3c25343fcf2a2f06f232a0/numemegastarprofessionalceramicflatiron_1_GL.jpg", "brand": "NuMe"},
{"price": "HK $669.10", "product_description": "Babyliss Pro 30 Piece Heated Ceramic Roller Set features various heated rollers that can be used to create fast, flawless curls.\nConvenient and versatile, 30 Piece Heated Ceramic Roller Set has four different roller sizes infused with Ceramic to deliver frizz-free results with an outstanding curl. Reaching the optimal temperature in less than five minutes, this hair styling necessity features two heat settings to suit all hair types and also includes fifteen super clips and thirty holding pins for true styling potential.\nDefined curls are guaranteed with the revolutionary 30 Piece Heated Ceramic Roller Set.", "product_url": "http://beautybay.com/electrical/babylisspro/30pieceheatedceramicrollerset/", "colour": "", "product_name": "30 Piece Heated Ceramic Roller Set", "id": 26, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0130H_1_L.jpg/a88996fdec1bfa0a2d01fb885a492928/BAPR0130H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $229.60", "product_description": "An interchangeable hair styling barrel that attaches to the innovative Whirl Convertible (sold separately). Boasting a stylish white and rose copper design, Tousled Waves Tapered Barrel can be used to craft loose, natural and shine-induced waves and curls.", "product_url": "http://beautybay.com/electrical/t3/tousledwavestaperedbarrel/", "colour": "", "product_name": "Tousled Waves Tapered Barrel", "id": 27, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TTHR0016H_1_L.jpg/32990eadfc92a59abafb410a23735c89/TTHR0016H_1_L.jpg", "brand": "T3"},
{"price": "HK $430.20", "product_description": "An innovative wand designed to impart a natural loose wave.\nCreated to deliver enviable beach waves within minutes, the Classic Wand Pearl Black is a must-have styling tool for those adventurous hair lovers. The unique bobbly wand reaches its optimum temperature almost instantly so you can produce shiny, damage-free results in minutes.", "product_url": "http://beautybay.com/electrical/nume/classicwandpearl/black", "colour": "", "product_name": "Classic Wand Pearl", "id": 28, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME0003H_1_L.jpg/5e44b6b9bf404beffe94113d661289d6/NUME0003H_1_L.jpg", "brand": "NuMe"},
{"price": "HK $525.60", "product_description": "A 25mm curling wand.\nAvailable in three colours, Classic Wand 25mm effortlessly curls and styles hair. Made from 100% tourmaline ceramic, heat is evenly distributed throughout the barrel for even styling that's smooth and frizz free.", "product_url": "http://beautybay.com/electrical/nume/classicwand25mm/", "colour": "Black – HK $525.60,\nPink – HK $525.60", "product_name": "Classic Wand 25mm", "id": 29, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME-numeclassicwand25mm_1_GL.jpg/30d8aeeb6a65dd7b3eb2cb9eb13c7be8/numeclassicwand25mm_1_GL.jpg", "brand": "NuMe"},
{"price": "HK $458.70", "product_description": "Babyliss Pro Advanced Ceramic Styler has advanced floating ceramic plates infused with nano titanium, offering super smooth results. It has ten variable heat settings and a digital temperature display built-in, unique programmable memory function and automatic safety switch-off. This is the most advanced hair straightener yet from Babyliss.\nFeatures:", "product_url": "http://beautybay.com/electrical/babylisspro/advancedceramicstyler/", "colour": "Black – HK $458.70,\nHot Pink – HK $573.40", "product_name": "Advanced Ceramic Styler", "id": 30, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR-babylissproadvancedceramicstyler_2_gl.jpg/abe2ebb51e5f0b7ca1ce7cb9a82ed548/babylissproadvancedceramicstyler_2_gl.jpg", "brand": "Babyliss Pro"},
{"price": "HK $382.10", "product_description": "Babyliss Pro Classic Ceramic Styler is a super slick hair styler that is curved so can create poker straight or curly hair. The Classic Ceramic Styler has advanced floating ceramic plates infused with nano titanium technology for smoother and faster results.\nFeatures:", "product_url": "http://beautybay.com/electrical/babylisspro/classicceramicstyler/", "colour": "", "product_name": "Classic Ceramic Styler", "id": 31, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0014H_1_L.jpg/917a05dd6643c2449dc0ae5e4f810bd4/BAPR0014H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $238.70", "product_description": "Take on one of the year's hottest hair trends with this spiral curl creating wand.\nCreated to offer you a quick and easy way to rock one of 2016's hottest trends, the Tight Curl Wand is the hair tool must-have you never knew you needed. The innovative 10mm, extra-long barrel allows for even the longest tresses to get a super curled, high shine style upgrade.", "product_url": "http://beautybay.com/electrical/babyliss/tightcurlswand/", "colour": "", "product_name": "Tight Curls Wand 10mm", "id": 32, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0009H_1_L.jpg/15a3ce48ba5988d2ed6a897b0792acb6/BABY0009H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $382.10", "product_description": "Babyliss Pro Attitude Porcelain Crimper is a ‘must have’ fashion tool for any kit bag. The 2.5 inch Porcelain crimpers which has 25 heat settings is the result of several years of research and development by Babyliss Pro Consulting, the creative leaders in professional hairdressing to describe their dream styling tool and then bringing it to life. With crimp on the rise in collections on catwalks, create edgy crimped styles and real ‘WOW’ textures and waves in no time.\nFeatures:", "product_url": "http://beautybay.com/electrical/babylisspro/attitudeporcelaincrimper/", "colour": "", "product_name": "Attitude Porcelain Crimper", "id": 33, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0017H_2_L.jpg/6213c872787c389689605c3e048efefe/BAPR0017H_2_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $477.70", "product_description": "Babyliss Pro Titanium Expression Curling Tongs create smooth, glossy curls with ease and precision.\nOffering adjustable heat up to 210°C and a Titanium Ceramic barrel, Titanium Expression Curling Tongs heat up quickly and deliver constant, even heat distribution for longer lasting results. These classic spring lever tongs have a superior design with a digital handle and stylish rose gold detailing.\nAvailable in a selection of barrel sizes for a variety of looks, Titanium Expression Curling Tongs leaves curls smooth and frizz free with an added shine.", "product_url": "http://beautybay.com/electrical/babylisspro/titaniumexpressioncurlingtongs/", "colour": "Titanium Expression Curling Tongs 25mm – HK $477.70,\nTitanium Expression Curling Tongs 32mm – HK $477.70,\nTitanium Expression Curling Tongs 38mm – HK $477.70", "product_name": "Titanium Expression Curling Tongs", "id": 34, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR-babylissprotitaniumexpressioncurlingtongs_1_gl.jpg/ae294e7db4d1f8a8c350616883330feb/babylissprotitaniumexpressioncurlingtongs_1_gl.jpg", "brand": "Babyliss Pro"},
{"price": "HK $573.40", "product_description": "A collection of eight easy to use, self-heating rollers designed to create loose, bouncy curls with ease.\nDeveloped to achieve professional curls from the comfort of your own home, the Curl Pods are the must-have styling tool for all hair types and lengths. This innovative curling solution comes complete with a heated casing and eighteen easy to use, self-sealing roller pods perfect for creating fuss-free curls as often as you like!", "product_url": "http://beautybay.com/electrical/babyliss/curlpods/", "colour": "", "product_name": "Curl Pods", "id": 35, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0015H_1_L.jpg/72c16d6f6548e242ee8eb6e6b416fae4/BABY0015H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $238.70", "product_description": "A lightweight, long life hairdryer designed to deliver professional results at home.\nDeveloped to achieve a frizz-free, high shine finish to your tresses, the BaByliss Speed Pro 2100 Hair Dryer is a heat balancing must-have. The ultra-sleek, ergonomic design harbours a number of innovative features that allow for a salon worthy finish every time.", "product_url": "http://beautybay.com/electrical/babyliss/babylissspeedpro2100hairdryer/", "colour": "", "product_name": "BaByliss Speed Pro 2100 Hair Dryer", "id": 36, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0001H_1_L.jpg/02fb97e5ba06c582f12336d9323f4de6/BABY0001H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $764.70", "product_description": "A unique wide barrelled curling wand ideal for creating curls for those with thick, long hair.\nDesigned with a larger barrel than most, the Magic Wand Professional Titanium Curling Wand 32mm Pink is the ideal solution for hair that struggles to hold its curl. The innovative technology used within the barrel ensures high-shine, damage-free result that you can enjoy with ease whenever you want.", "product_url": "http://beautybay.com/electrical/nume/magicwandprofessionaltitaniumcurlingwand32mm/", "colour": "", "product_name": "Magic Wand Professional Titanium Curling Wand 32mm 32mm", "id": 37, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME0005H_1_L.jpg/bff5f659483c21fc4e36a563f1b7a0c7/NUME0005H_1_L.jpg", "brand": "NuMe"},
{"price": "HK $190.80", "product_description": "A lightweight, 25mm barrelled curling tong designed to create effortless waves.\nDesigned to replace your conventional curling tongs, the BaByliss Curl Pro 210 Curling Tong is an essential tool for anyone who loves effortlessly bouncy tresses. The incredibly smooth, anti-snag barrel provides seamless, kink-free results with every use. Created with a number of heat settings and embedded, hair-loving technologies this wand with become your new go-to.", "product_url": "http://beautybay.com/electrical/babyliss/babylisscurlpro210curlingtong/", "colour": "", "product_name": "BaByliss Curl Pro 210 Curling Tong 25mm", "id": 38, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0008H_1_L.jpg/987f9a9fd27971850aeff4729e49428e/BABY0008H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $569.40", "product_description": "A light treatment designed to precisely tackle troublesome areas of the face.\nFree Skin Purifying Energy Booster uses specially designed light technology to penetrate the skin's surface gradually working towards eliminating pimples, excess sebum and blackheads. The streamline device uses 'touch free' technology to transmit light pulses through the skin without making direct contact for fresh and overall clearer skin.", "product_url": "http://beautybay.com/electrical/talika/freeskinpurifyingenergybooster/", "colour": "", "product_name": "Free Skin Purifying Energy Booster", "id": 39, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TALI0088F_1_L.jpg/68f504aee5c1a335402e3d4e2f2cd494/TALI0088F_1_L.jpg", "brand": "Talika"},
{"price": "HK $525.60", "product_description": "Lightweight, easy grip straighteners designed to style all hair types.\nCreated with kind-to-hair technologies to ensure a smooth, breakage-free styling experience, the Ultra 100% Tourmaline Ceramic Flat Iron is a must have styling tool for anyone's hair perfecting routine. Used for both straightening and curling, the streamlined design offers the ultimate control so you can create professional, high shine results with complete ease.", "product_url": "http://beautybay.com/electrical/nume/ultra100tourmalineceramicflatiron/", "colour": "Black – HK $525.60,\nTurquoise – HK $525.60", "product_name": "Ultra 100% Tourmaline Ceramic Flat Iron", "id": 40, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME-numeultra100tourmalineceramicflatiron_1_GL.jpg/fe55eafdf828615712c374e3cea62f80/numeultra100tourmalineceramicflatiron_1_GL.jpg", "brand": "NuMe"},
{"price": "HK $930.00", "product_description": "T3 Body Waver Professional Curling Iron is a fabulous curling iron which creates salon worthy waves.\nSuitable for all hair types including short hair, Body Waver Professional Curling Iron creates big, soft waves and loose curls with exceptional shine and volume. The hottest styling innovation for creating the most sought after runway and red carpet styles, this revolutionary curling tong delivers the smooth, shiny, frizz free finish that T3 is famous for.\nThe 45mm (1.75”) Tourmaline + Ceramic infused barrel creates polished, voluminous waves which shine with health whilst Ionic Technology seals the hair cuticle for extra silky smoothness. Body Waver Professional Curling Iron also features SinglePass™ Radial Technology which maintains a consistent temperature for even styling and the hollow barrel design allows heat to disperse consistently.\nThe slim, ergonomic handle and 3 metre swivel cord allows for ease of use and optimal control whilst 5 temperature controls up to 210°C allows Body Waver Professional Curling Iron to style all hair types and textures to perfection.", "product_url": "http://beautybay.com/electrical/t3/bodywaverprofessionalcurlingiron/", "colour": "", "product_name": "Body Waver Professional Curling Iron 45mm", "id": 41, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TTHR0005H_2_L.jpg/0fdb207a754316fa23e0aaeeb04f1f15/TTHR0005H_2_L.jpg", "brand": "T3"},
{"price": "HK $573.40", "product_description": "An innovative pink and purple ombre wrapped styler designed to deliver incomparable straightened and curled results.\nWith a host of innovative, advanced features, the Ombre Styler 235 will truly become a staple in your routine. The unique, lightweight design harbours twenty five percent longer titanium and ceramic plates to allow you to achieve ultra-sleek, frizz-free results with the ultimate control and style.", "product_url": "http://beautybay.com/electrical/babyliss/ombrestyler235/", "colour": "", "product_name": "Ombre Styler 235", "id": 42, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0004H_1_L.jpg/fda23ee646ef3364c07f1415054e7221/BABY0004H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $430.00", "product_description": "Babyliss Pro Triple Barrel Waver is the perfect styling tool for creating instant volume and glamorous waves and texture.\nEasy to use and recently renovated, Triple Barrel Waver has a 25 dial-a-heat setting with an easy temperature control and also a built in safety stand. Now reaching a maximum temperature of 210øC, Triple Barrel Waver heats up quicker and guarantees faster, longer lasting styling results.\nUltra smooth Ceramic barrels create flawless, frizz-free waves without snagging or pulling whilst the spring lever ensures styling is effortless and precise.", "product_url": "http://beautybay.com/electrical/babylisspro/triplebarrelwaver/", "colour": "Hot Pink – HK $430.00,\nBlack – HK $430.00", "product_name": "Triple Barrel Waver", "id": 43, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR-babylissprotriplebarrelwaver_1_gl.jpg/c931390572a5dcc085427b20d01a3174/babylissprotriplebarrelwaver_1_gl.jpg", "brand": "Babyliss Pro"},
{"price": "HK $764.70", "product_description": "A styling tool ideal for creating long-lasting, high-shine results on medium to thick hair.\nDeveloped to curl hair that doesn't hold its shape easily, the Magic Wand Professional Titanium Curling Wand 25mm Pink is an essential tool for creating volume and body. The heat adjustable barrel keeps the hair damage-free and looking healthy. The super smooth, professional results will leave you wanting to curl your hair every day.", "product_url": "http://beautybay.com/electrical/nume/magicwandprofessionaltitaniumcurlingwand25mm/pink", "colour": "", "product_name": "Magic Wand Professional Titanium Curling Wand 25mm 25mm", "id": 44, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME0004H_1_L.jpg/5137becb1bfe8ab3042439b7d85184a3/NUME0004H_1_L.jpg", "brand": "NuMe"},
{"price": "HK $229.60", "product_description": "An aesthetically-pleasing styling barrel that attaches to Whirl Convertible (sold separately) and creates large, undone waves. Uniquely designed with a rose copper and milk white colour scheme, Undone Waves Straight Barrel allows for full creative control and is completely travel-friendly.", "product_url": "http://beautybay.com/electrical/t3/undonewavesstraightbarrel/", "colour": "", "product_name": "Undone Waves Straight Barrel", "id": 45, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TTHR0020H_1_L.jpg/bdc0a8c28f907ac57f66b30aa61bfb2c/TTHR0020H_1_L.jpg", "brand": "T3"},
{"price": "HK $401.20", "product_description": "Babyliss Pro Powerlite Dryer is a “lite”dryer weighing in at only 445g and 1/3 lighter than most dryers! \nThis Babyliss Pro Powerlite Dryer features a unique Super Quiet 1900w LHT Motor with high torque power that sets new standards in lightweight design with 6 heat settings and gives you control for all types and conditions of hair.\nThe LHT professional motor produces one of the most powerful performances of air flow and air volume.", "product_url": "http://beautybay.com/electrical/babylisspro/powerlitedryer/", "colour": "Silver – HK $401.20,\nPanther – HK $401.20,\nMetallic Hot Pink – HK $401.20", "product_name": "Powerlite Dryer", "id": 46, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR-babylisspropowerlitedryer_1_GL.jpg/54992d423173fbe458b789e4545fd71f/babylisspropowerlitedryer_1_GL.jpg", "brand": "Babyliss Pro"},
{"price": "HK $1147.30", "product_description": "Babyliss Pro ITALIA Brava Dryer Black is a brushless engine hairdryer with creative influences from sports car manufacturer Ferrari.\nJoining forces and with a combined experience of 140 years of engineering knowledge, Babyliss Pro and Ferrari have produced the ultimate hairdrying experience.\nCreated in Italy, this latest collaboration is powered by the new MaxLife Pro brushless engine. With 6 high speed settings and a 2400 Watt engine, ITALIA Brava Dryer Black delivers stronger air pressure, faster airspeed and Nano Titanium Technology for faster drying time with less hair damage. This professional luxury hairdryer boasts a cool shot button for an extra boost of radiant shine and comes complete with 2 concentrator nozzles for easier, controlled styling.\nThe ultra-lightweight ergonomic design delivers outstanding results with quieter operation and long lasting shine.", "product_url": "http://beautybay.com/electrical/babylisspro/italiabravadryer/black", "colour": "", "product_name": "ITALIA Brava Dryer", "id": 47, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0120H_1_L.jpg/9bc4cde24766f07867991935395e01e0/BAPR0120H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $257.80", "product_description": "Babyliss Pro Black Magic Dryer provides a salon finish effect for the hair.\nWith a 1600W long life motor, Black Magic Dryer is able to deliver a powerful precision blow dry ensuring that the hair is silky smooth. The switches are conveniently positioned on the side of the device enabling you to take full control and with the long length swivel cord moving the dryer is effortless. The narrow barrel and concentrator nozzle style the hair flawlessly, alongside the six heat and speed settings which offer complete creative control.\nGet the locks you desire with the ground-breaking Black Magic Dryer.", "product_url": "http://beautybay.com/electrical/babylisspro/blackmagicdryer/", "colour": "", "product_name": "Black Magic Dryer", "id": 48, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0127H_1_L.jpg/9db676d2d79d92ab3b145cd0f70bd322/BAPR0127H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $702.50", "product_description": "A micro current light treatment to reduce discolouration in the skin.\nPigment Control is a duo of treatments, the first of which delivers penetrating light therapy to the skin, regulating melanin production to reduce the size and intensity of dark spots. A daily treatment booster aspect administers micro-currents and vibrations to enhance the absorption of daily skin cream as well stimulating the cells for an overall even toned complexion.", "product_url": "http://beautybay.com/electrical/talika/pigmentcontrol/", "colour": "", "product_name": "Pigment Control", "id": 49, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TALI0089F_1_L.jpg/40beb92bdeea4add533c4c3cd8d768c4/TALI0089F_1_L.jpg", "brand": "Talika"},
{"price": "HK $1450.80", "product_description": "T3 Featherweight Luxe 2i Dryer is an Ion generated hair dryer which offers faster and healthier drying benefits.\nExpertly created using innovative T3 Tourmaline© and SoftAireÙ technologies, Featherweight Luxe 2i Dryer dries the hair up to 75% faster than a regular hair dryer whilst delivering healthier and more beautiful looking hair.\nWith variable heat and speed settings, Featherweight Luxe 2i Dryer is suitable for all hair types and has a lightweight, ergonomic design which provides a comfortable drying experience. Complete with a Tourmaline Ceramic brush, Featherweight Luxe 2i Dryer provides all you need for a healthier, speedier blow drying experience.", "product_url": "http://beautybay.com/electrical/t3/featherweightluxe2idryer/", "colour": "", "product_name": "Featherweight Luxe 2i Dryer", "id": 50, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TTHR0001H_2_L.jpg/6d360596f3535ac31cf640bc2a2de69c/TTHR0001H_2_L.jpg", "brand": "T3"},
{"price": "HK $312.50", "product_description": "A skin clearing treatment.\nEliminating bacteria, Acne Clearing Blue Light Forever Cartridge fits perfectly into the Acne Clearing Blue Light to penetrate deep into the skin. Promoting even tone and texture, use the effective, at home treatment daily to remove blemishes and create a clear, radiant complexion.", "product_url": "http://beautybay.com/electrical/triabeauty/acneclearingbluelightforevercartridge/", "colour": "", "product_name": "Acne Clearing Blue Light Forever Cartridge", "id": 51, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TRIA0016F_1_L.jpg/203fbc01b63f9e5c4febc060f797d40a/TRIA0016F_1_L.jpg", "brand": "Tria Beauty"},
{"price": "HK $1290.80", "product_description": "Achieving customised curls has always been a challenge until now, thanks to NuMe's five barrel interchangeable wand.\nDesigned to create voluminous curls, waves and body, the Lustrum Interchangeable Curling Wand Black is a must-have styling tool for hair lovers who like to mix it up.  The collection of five barrels in different shapes and sizes included in the set allows you to create a number of styles to suit your mood. Simply clip the barrel onto the base included and away you go.", "product_url": "http://beautybay.com/electrical/nume/lustruminterchangablecurlingwand/black", "colour": "", "product_name": "Lustrum Interchangable Curling Wand", "id": 52, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NUME0001H_1_L.jpg/7862d16b04216364751c5744b3a8ed6b/NUME0001H_1_L.jpg", "brand": "NuMe"},
{"price": "HK $478.30", "product_description": "A set of heated, ceramic rollers.\nCreating long lasting curls, Boutique Salon Rollers instantly and effectively add volume. With twelve 32mm barrels, a dual source heating system and contoured clips, achieve salon perfect styles with ease.", "product_url": "http://beautybay.com/electrical/babyliss/boutiquesalonrollers/", "colour": "", "product_name": "Boutique Salon Rollers", "id": 53, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0019H_1_L.jpg/1bc87423320980448c1f82bb929953f5/BABY0019H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $382.60", "product_description": "A beautifully designed styling barrel that attaches to Whirl Convertible (sold separately) and creates large, loose waves. Uniquely designed with a rose copper and milk white colour scheme, Loose Waves Straight Barrel allows for full creative control and is completely travel-friendly.", "product_url": "http://beautybay.com/electrical/t3/loosewavesstraightbarrel/", "colour": "", "product_name": "Loose Waves Straight Barrel", "id": 54, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TTHR0019H_1_L.jpg/c22b1aeec53014b68ff7a599df12d7cf/TTHR0019H_1_L.jpg", "brand": "T3"},
{"price": "HK $382.60", "product_description": "A shine-inducing interchangeable clip barrel that attaches to Twirl Convertible (sold separately). Designed to create tight, structured curls, Defined Curls Clip Barrel allows for full creative control and further boasts an attractive design.", "product_url": "http://beautybay.com/electrical/t3/definedcurlsclipbarrel/", "colour": "", "product_name": "Defined Curls Clip Barrel", "id": 55, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TTHR0017H_1_L.jpg/ca618d8dd3f1d996427b7b3b41bd8aa6/TTHR0017H_1_L.jpg", "brand": "T3"},
{"price": "HK $573.40", "product_description": "Babyliss Pro Titanium Expression Waving Wand is a straight curling wand which creates glamorous, soft waves.\nExpertly crafted with a premium true Titanium finish and stylish rose gold detailing, Titanium Expression Waving Wand offers up to 210°C heat and digital temperature control. With ultra-advanced Ceramic heaters, Titanium Expression Waving Wand delivers instant heat, faster styling and longer lasting waves.\nThe glossy 34mm barrel gently holds the hair in place for easier styling whilst the long design is perfect for waving longer hair lengths. Ready to use in just 15 seconds, Titanium Expression Waving Wand leaves the hair with loose waves and a supreme shine.", "product_url": "http://beautybay.com/electrical/babylisspro/titaniumexpressionwavingwand/34mm", "colour": "", "product_name": "Titanium Expression Waving Wand 34mm", "id": 56, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0091H_1_L.jpg/bb79b7e3502600189560553d3ad33c6d/BAPR0091H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $1504.40", "product_description": "A cord free thermal hair removal appliance for fine hairs.\nInnovatively created Thermicon technology delivers heat pulses into the hair follicles for instant pain free hair removal. The Micro Hair Removal System achieves short term immediate results as well as a reducing hair regrowth when used over a period of time. The system works to eradicate the need for professional treatment as the same high standard of results can be achieved at home for a fraction of the price.", "product_url": "http://beautybay.com/electrical/nono/microhairremovalsystem/red", "colour": "", "product_name": "Micro Hair Removal System", "id": 57, "image_url": "http://images.contentful.com/eoaaqxyywn6o/NONO0008U_1_L.jpg/be0daa1ad98376d1fbb951a909148cac/NONO0008U_1_L.jpg", "brand": "no!no!"},
{"price": "HK $860.90", "product_description": "Smoothness and long lasting shine: everything you could want from a straighter and more.\nSpecial Edition Diamond Straightener glides through the hair delivering professional results in minutes. Designed with a classic black colour and sprinkle of silver glitter, along with innovative diamond infused ceramic plates, the straighteners offer incomparable shine and impressive sleekness, leaving the hair feeling and looking perfected.", "product_url": "http://beautybay.com/electrical/babylisspro/specialeditiondiamondstraightener/", "colour": "", "product_name": "Special Edition Diamond Straightener", "id": 58, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0132H_1_L.jpg/7031c0146e28cab9b45083c2aa48b6fe/BAPR0132H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $1262.10", "product_description": "T3 SinglePass Straightening & Styling Iron Black & Gold Edition creates sleek, straight hair effortlessly.\nWorking quickly to smooth and style world class hair, SinglePass Straightening & Styling Iron Black & Gold Edition utilises the exclusive Digital SinglePass Technology and T3 Tourmaline to seal your style in one smooth glide.\nFixed Tourmaline Ceramic plates emit infrared energy to deliver perfect results instantly whilst promoting quicker and healthier styling by reducing heat damage and over-styling. The adjustable temperature settings heat up to 232øC whilst adapting to all hair types and textures whilst the 360 degree swivel cord offers ease of use and organisation.\nThe ultimate thermal styling tool for shiny, head-turning, damage free styles, SinglePass Straightening & Styling Iron Black & Gold Edition also includes a heat proof mat and has a limited edition black and gold design.", "product_url": "http://beautybay.com/electrical/t3/singlepassstraighteningstylingironblackgoldedition/", "colour": "", "product_name": "SinglePass Straightening & Styling Iron Black & Gold Edition", "id": 59, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TTHR0009H_1_L.jpg/36b38e636808c14c830eda781dd8086e/TTHR0009H_1_L.jpg", "brand": "T3"},
{"price": "HK $669.10", "product_description": "A gold-adorned professional straightener ideal for achieving sleek, high-shine results.\nDesigned with the health of your tresses in mind, the Smooth Vibrancy 230C Straightener is the perfect way to achieve a super-smooth, seamlessly straight finish. Harbouring a number of professional features, the sleek ergonomic tool allows you to create a number of effortless styles with the ultimate ease.", "product_url": "http://beautybay.com/electrical/babyliss/smoothvibrancy230cstraightener/", "colour": "", "product_name": "Smooth Vibrancy 230C Straightener", "id": 60, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0005H_1_L.jpg/ed9fd33d0711dded61ae041be56db9e4/BABY0005H_1_L.jpg", "brand": "BaByliss"},
{"price": "HK $266.50", "product_description": "Michael Todd Hair Eraser Satin Smooth System is a handy multi tool for effective hair removal.\nThe clever device can be used as an epilator and a clipping tool. Safe and gentle, when used as an epilator, the device targets hair removal from the source of growth instead of cutting the hair at the surface. Without pulling or snagging at the skin, the painless technology delivers long-lasting silky smoothness with an extended time between hair removal treatments.\nWhen used as a clipping tool, Hair Eraser Satin Smooth System prepares the area for hair removal and is an alternative method to epilation for treating unwanted hair from the face and body. It is also ideal for removing hair from the more sensitive parts of the body for example the bikini line and under arm hair.\nDelivering beautiful results, Hair Eraser Satin Smooth System is a beauty tool you won't want to live without.", "product_url": "http://beautybay.com/electrical/michaeltodd/hairerasersatinsmoothsystem/", "colour": "", "product_name": "Hair Eraser Satin Smooth System", "id": 61, "image_url": "http://images.contentful.com/eoaaqxyywn6o/MITO0037F_1_L.jpg/677ae08528844ef33ad8c51bec7a029c/MITO0037F_1_L.jpg", "brand": "Michael Todd"},
{"price": "HK $702.50", "product_description": "A light therapy anti-ageing tool for around the eye area.\nThe first of its kind, the Time Control slim-line device achieves a gradual reduction in wrinkles, fine lines and puffiness around the eye area. The duo treatment of both light therapy and micro-currents work in synergy to increase firmness, lift and the absorption of cream based skin care for an overall brighter and more youthful looking eyes achieving an anti-ageing effect.", "product_url": "http://beautybay.com/electrical/talika/timecontrol/", "colour": "", "product_name": "Time Control", "id": 62, "image_url": "http://images.contentful.com/eoaaqxyywn6o/TALI0090F_1_L.jpg/128dab6b55ae131513b116279ee83658/TALI0090F_1_L.jpg", "brand": "Talika"},
{"price": "HK $430.00", "product_description": "Babyliss Pro 20 Piece Heated Ceramic Roller Set features various heated rollers to create fast, flawless curls.\nConvenient and versatile, 20 Piece Heated Ceramic Roller Set has 3 different roller sizes infused with Ceramic to deliver frizz free results. Heating up in less than 5 minutes, 20 Piece Heated Ceramic Roller Set features 2 heat settings to suit all hair types and also includes 10 super clips and 20 holding pins.", "product_url": "http://beautybay.com/electrical/babylisspro/20pieceheatedceramicrollerset/", "colour": "", "product_name": "20 Piece Heated Ceramic Roller Set", "id": 63, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BAPR0089H_1_L.jpg/98e09601d0f5e55b23499cdf2952e5a7/BAPR0089H_1_L.jpg", "brand": "Babyliss Pro"},
{"price": "HK $286.40", "product_description": "A diamond infused wand designed to impart classic loose waves.\nInnovatively designed to make adding texture and bounce super-simple, the Diamond Radiance Diamond Waves is an on-trend must-have. Designed with a unique waved barrel that aims to produce effortless dimension and volume, this wand is the perfect way to amp up even the simplest of styles.", "product_url": "http://beautybay.com/electrical/babyliss/diamondradiancediamondwaves/", "colour": "", "product_name": "Diamond Radiance Diamond Waves", "id": 64, "image_url": "http://images.contentful.com/eoaaqxyywn6o/BABY0011H_1_L.jpg/9e553e1d502f2b0864a2f446a1325eaf/BABY0011H_1_L.jpg", "brand": "BaByliss"}
]