[
{"price": "HK $99.60", "product_name": "Elasto Seamoillient Hand Cream", "id": 1, "product_url": "http://beautybay.com/bathandbody/mariobadescu/elastoseamoillienthandcream/", "colour": "", "brand": "Mario Badescu", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0060F_1_L.jpg/aaf1d77bc61baba40a019a7bd71c2c1a/MABA0060F_1_L.jpg", "product_description": "Mario Badescu Elasto Seamoillient Hand Cream (118ml) contains a unique formulation of protective Seamollient and nourishing Vitamin E, making this thick, rich hand cream perfect for frequently washed hands."},
{"price": "HK $43.00", "product_name": "Nail And Body Stickers", "id": 2, "product_url": "http://beautybay.com/nailcare/annasui/nailandbodystickers/", "colour": "", "brand": "Anna Sui", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANSU0345F_1_L.jpg/f92f5eba58f78defd50938520a533985/ANSU0345F_1_L.jpg", "product_description": "A pack of decorative body stickers.\nWith intricate summer patterns, Nail And Body Stickers by Anna Sui add bright pops of colour. Suitable for application to the nails and body, the sea prints and neon colourways are perfect accessories for festivals and days in the sun."},
{"price": "HK $116.20", "product_name": "Cuticle Cream", "id": 3, "product_url": "http://beautybay.com/nailcare/mariobadescu/cuticlecream/", "colour": "", "brand": "Mario Badescu", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0109F_1_L.jpg/1ba9a39f7a98d804fb72c3f3be27e49a/MABA0109F_1_L.jpg", "product_description": "Mario Badescu Cuticle Cream (14ml) is a rich treatment which heals dry, torn and damaged cuticles overnight.\nEnriched with Glycolic and Salicylic Acids, Cuticle Cream gently exfoliates the build-up of rough skin around the cuticles whilst restoring moisture. Suitable for all skin types, Cuticle Cream has a thick gel-cream consistency which offers exceptional moisturisation for severely dry and damaged cuticles and leaves the nail beds looking perfectly manicured."},
{"price": "HK $265.30", "product_name": "Rose Hand Cream 125ml", "id": 4, "product_url": "http://beautybay.com/bathandbody/jurlique/rosehandcream/", "colour": "", "brand": "Jurlique", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/JURL-jurliquerosehandcream_2_gl.jpg/f1a5cbfe991105c9af11baa24cafad9a/jurliquerosehandcream_2_gl.jpg", "product_description": "Jurlique Rose Hand Cream is an award winning hand cream which restores smoothness and keeps hands looking youthful.\nThis rich, protective hand cream deeply moisturises skin and is enriched with Safflower Seed Oil and Macadamia Oil to rebalance dryness and protect skin from moisture loss. Vitamin E provides antioxidant protection for hands whereas Carrot Root Extract and Aloe Vera work to sooth dryness whilst calming and softening the skin.\nRose Hand Cream leaves hands soft, smooth and hydrated for a youthful appearance."},
{"price": "HK $92.50", "product_name": "Let It Snow Twins 2x4.5ml", "id": 5, "product_url": "http://beautybay.com/nailcare/littleondine/letitsnowtwins/", "colour": "", "brand": "Little Ondine", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/LION0042F_1_L.jpg/2db6d926890eaa25eb9547d517b06700/LION0042F_1_L.jpg", "product_description": "A true white polish paired with a sheer silver glitter hue, Let It Snow Twins create a manicure reminiscent of glistening snow.\nDesigned to offer a professional looking, customisable manicure housed in one place, the Little Ondine Twins is a must-have for those on the go nail varnish appliers. The unique peel-off formula dries quickly to a high shine finish but can be removed within a moment's notice so you can change up your look. Try mix and matching the two complimentary shades from the set for a completely unique finish you can't help but love."},
{"price": "HK $75.80", "product_name": "Coconut Protecting Hand and Cuticle Cream 85ml", "id": 6, "product_url": "http://beautybay.com/bathandbody/yesto/coconutprotectinghandandcuticlecream/", "colour": "", "brand": "Yes To", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/YETO0127F_1_L.jpg/779c602389f9b65a91771c4b7cd660de/YETO0127F_1_L.jpg", "product_description": "Yes To Coconut Protecting Hand and Cuticle Cream is a tropical scented hand cream which protect and hydrates dry, hardworking hands.\nCritically acclaimed as a hand and cuticle saviour, Coconut Protecting Hand and Cuticle Cream is enriched with Virgin Coconut Oil which acts as a tropical moisturiser for the skin and provides essential nutrients such as Vitamins A, C and E to keep the hands and cuticles protected.\nNon-greasy yet super moisturising, this Coconut scented hand cream is also infused with a 97% Natural blend of Shea Butter, Avocado Oil and other Botanical Extracts which work harmoniously to protect the skin from dehydration, restore suppleness and improve the appearance of dry skin delivering an Antioxidant shield against free radical aggression.\nIdeal for adding a tropical touch to your handbag or desk drawer, Coconut Protecting Hand and Cuticle Cream is a Beauty Bay essential for keeping the hands soft and healthy."},
{"price": "HK $116.20", "product_name": "Hydrating Hand Cream", "id": 7, "product_url": "http://beautybay.com/bathandbody/mariobadescu/hydratinghandcream/", "colour": "", "brand": "Mario Badescu", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0061F_1_L.jpg/f52ffb3784c459bbe17c70b0edea1d4a/MABA0061F_1_L.jpg", "product_description": "Mario Badescu Hydrating Hand Cream (118ml) is formulated with Hyaluronic Acid to lock in the skins natural moisture."},
{"price": "HK $36.90", "product_name": "Oh K! Nail File Duo", "id": 8, "product_url": "http://beautybay.com/nailcare/ohk/ohknailfileduo/", "colour": "", "brand": "Oh K!", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/OHKB0008F_1_L.jpg/8071f45d6b4faa5fe291061f3767409e/OHKB0008F_1_L.jpg", "product_description": "A duo of rabbit and cat themed double-sided nail files.\nDesigned to help you keep your nails in shape, the Oh K! Nail File Duo are a must-have for any handbag. The fine grit files effortlessly glide along the nail edge creating a smooth edged manicured finish with every use."},
{"price": "HK $210.80", "product_name": "Age Delay Hand & Cuticle Care Cream 100ml", "id": 9, "product_url": "http://beautybay.com/bathandbody/alphah/agedelayhandcuticlecarecream/", "colour": "", "brand": "Alpha-H", "meta_tag": "", "image_url": "http://a0.bb-cdn.com/assets/productimages/large/alph0030f_1_l.jpg", "product_description": "Alpha-H Age Delay Hand & Cuticle Care Cream is a richly moisturising anti aging cream for all skin types.\nFormulated with 10% Glycolic Acid and Keratin, this cream is also enriched with Flower Extracts and Antioxidants and has a non greasy texture that is quickly absorbed. The skin is gently hydrated, softened, smoothed and youthful once more."},
{"price": "HK $135.20", "product_name": "Pushy & Nail Cleaner", "id": 10, "product_url": "http://beautybay.com/nailcare/tweezerman/pushynailcleaner/", "colour": "", "brand": "Tweezerman", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0124U_1_L.jpg/a0eee9a20546df14f52506b6f745d03d/TWEE0124U_1_L.jpg", "product_description": "Tweezerman Pushy & Nail Cleaner is an innovative 2 in 1 manicure tool which neatens cuticles and cleans nails.\nExpertly crafted using the finest Stainless Steel, Pushy & Nail Cleaner combines Tweezerman's famous Pushy® cuticle pusher with a convenient nail cleaner. Super-thin edges are buffed smooth to prevent scratching while the textured body provides a perfectly secure grip.\nA must-have classic for professional quality manicures and pedicures, Pushy & Nail Cleaner can also be used on acrylic nails. Nails are left superbly clean whilst cuticles appear healthy and perfectly groomed.\n"},
{"price": "HK $300.40", "product_name": "Grip & Snip Spiral Spring Cuticle Nipper", "id": 11, "product_url": "http://beautybay.com/nailcare/tweezerman/gripsnipspiralspringcuticlenipper/", "colour": "", "brand": "Tweezerman", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0199U_1_L.jpg/988ee374cc832b933272223e29f3e77d/TWEE0199U_1_L.jpg", "product_description": "Tweezerman Grip & Snip Spiral Spring Cuticle Nipper is a stylish manicure tool for keeping cuticles perfectly groomed.\nConventional cuticle nippers are a thing of the past; Grip & Snip Spiral Spring Cuticle Nipper features a sleek and one of a kind design which will stand out amongst your regular stainless steel manicure tools.\nThe closed back loop maximises handling comfort whilst the handles cannot penetrate your hand, regardless of how you handle the nipper. The unique coil structure improves grip and offers a defined surface structure which reduces slip.\nThe ultimate tool for trimming hangnails and neatening rough cuticles, Grip & Snip Spiral Spring Cuticle Nipper offers high tension and a small closing force which remains consistent throughout the grooming process.\nWith sharp blades which have perfectly aligned tips and hand-filed to meticulous sharpness, Grip & Snip Spiral Spring Cuticle Nipper offers precise nipping and trimming and is a dream to use."},
{"price": "HK $62.80", "product_name": "Professional Nail File", "id": 12, "product_url": "http://beautybay.com/nailcare/nailsinc/professionalnailfile/", "colour": "", "brand": "Nails Inc", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NAIN0121F_2_L.jpg/9411a816d862c427911e43b7002080d1/NAIN0121F_2_L.jpg", "product_description": "Nails Inc Professional Nail File is perfect for keeping your nails in beautiful shape."},
{"price": "HK $28.00", "product_name": "Shaper File", "id": 13, "product_url": "http://beautybay.com/nailcare/redcarpetmanicure/shaperfile/", "colour": "", "brand": "Red Carpet Manicure", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/RECM0132F_1_L.JPG/c6508bf5894b3c15854559a17afb98f2/RECM0132F_1_L.JPG", "product_description": "Red Carpet Manicure Shaper File is a professional nail file specially developed for enhanced nails such as acrylic or gel nails.\nExpertly crafted with firm padding which allows for greater control and faster refinement when shaping and reducing length on acrylic or gel enhanced nails, Shaper File has a coarse 180/180 grit for professional results.\nA Beauty Bay essential for your gel manicure, Shaper File has a durable design which is loved by professional nail technicians."},
{"price": "HK $90.10", "product_name": "Two Timing The Zones 15ml", "id": 14, "product_url": "http://beautybay.com/nailcare/opi/twotimingthezones/", "colour": "", "brand": "OPI", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/OPIN1120F_1_L.jpg/719d347d0b313fa6bbd05d6a6b9bd680/OPIN1120F_1_L.jpg", "product_description": "A bright, hot pink polish, Two Timing The Zones offers a fierce, feminine touch to the tips.\nInspired by the culture and colours of Fiji, OPI's Spring 2017 collection offers 12 bright, bold colours with a rich and creamy formula. Two to three coats leaves nails with a full, opaque coverage that lasts, leaving a strong and shiny finish."},
{"price": "HK $135.20", "product_name": "Dual Sided Pushy", "id": 15, "product_url": "http://beautybay.com/nailcare/tweezerman/dualsidedpushy/", "colour": "", "brand": "Tweezerman", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0215U_1_L.jpg/5bb95acf43899ad0191b3703a42cccef/TWEE0215U_1_L.jpg", "product_description": "Tweezerman Dual Sided Pushy is the ultimate tool for treating the cuticles and caring for the skin around the nails.\nDuo ended and effortless to control, Dual Sided Pushy ensures that the cuticles can be shaped, flattening and perfected, whilst guaranteeing that the nails remain unmarked, with no scratches or ridges. Featuring a scoop, to gently follow the natural shape of the cuticle and a flat end to flawlessly sculpt and define, this exquisite beauty tool is a must have addition to any manicure collection.\nAlways have an enchanting set of nails with Dual Sided Pushy."},
{"price": "HK $20.00", "product_name": "Cheetah Girl French Tips", "id": 16, "product_url": "http://beautybay.com/nailcare/redcarpetmanicure/cheetahgirlfrenchtips/", "colour": "", "brand": "Red Carpet Manicure", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/RECM0228F_1_L.jpg/d707762ea1e16f12d0c988603e74498c/RECM0228F_1_L.jpg", "product_description": "Welcome to the wild side with these unique purple cheetah print tips.\nAchieving a perfectly smooth line to recreate a classic style has always been seen as a hassle, until now! Cheetah Girl French Tips are self-adhesive strips of polish that apply smoothly to the very tip of the nail for seamless professional looking results in minutes."},
{"price": "HK $295.90", "product_name": "Nail Regenerator Serum 1.8ml", "id": 17, "product_url": "http://beautybay.com/nailcare/talika/nailregeneratorserum/", "colour": "", "brand": "Talika", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TALI0028F_1_L.jpg/bf6621cc68d1b51a7f1004e702a9047f/TALI0028F_1_L.jpg", "product_description": "Talika Nail Generator Serum is a complete nail treatment for weak, fragile and problematic nails.\nSpecially formulated to nourish, hydrate and restructure fragile and lifeless nails, Nail Generator Serum stimulates the growth of dry, brittle, split and uneven nails whilst softening the cuticles and healing damaged nails.\nInfuse with regenerating Myrrh and Incense, Nail Generator Serum fortifies and purifies the nails whilst Benzoin offers astringent and antiseptic properties to repair damage. Clinically proven by the Salpetrière Hospital in Paris to strengthen the nails in just 28 days, Nail Generator Serum stimulates growth by 20% and improves the appearance of the nails and cuticles by up to 300%.\nFree from Artificial Fragrances, Colours and Preservatives, Nail Generator Serum is an innovative answer to all common nail problems and is packaged in a convenient pen applicator with a foam tip for easy application to massage into the nail and cuticle.\nNail Generator Serum leaves weak and damaged nails looking healthy, longer and stronger."},
{"price": "HK $110.70", "product_name": "Hand Cream Vanilla & Orange Peel", "id": 18, "product_url": "http://beautybay.com/bathandbody/grownalchemist/handcreamvanillaorangepeel/", "colour": "Hand Cream Vanilla & Orange Peel 65ml – HK $110.70", "brand": "Grown Alchemist", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/GRAL-grownalchemhcreamvaniloranpeel_1_gl.jpg/5f867428d5042de0632a5b46c8977c21/grownalchemhcreamvaniloranpeel_1_gl.jpg", "product_description": "Grown Alchemist Hand Cream Vanilla & Orange Peel is a non-greasy hand cream which naturally soothes, softens and hydrates dry and undernourished hands, nails and cuticles.\nInfused with a moisturising blend of Organic Botanicals, Hand Cream Vanilla & Orange Peel is rich in free radical fighting Antioxidants derived from Grape Seed, Wheat Germ and Rosehip Oils which help to promote radiance whilst shielding the skin from environmental aggressors.\nCold Pressed Orange Peel Oil tones the skin and restores suppleness whilst Rosehip and Camellia Seed Oil noticeably improves hydration levels and repairs the appearance of skin damage due to oxidative stress by increasing the smoothness of the skin surface. Polysaccharides from Aloe Vera de-stress the skin and soothe irritation whilst Vanillin from Vanilla Extract envelops the hands in an uplifting yet calming aroma.\nHand Cream Vanilla & Orange Peel also utilises Flavonoids and Omega 3 and 6 from Sea Buckthorn Berry visibly improves skin elasticity, tone and firmness. A Beauty Bay handbag or desk essential for healthy, hydrated hands, this indulgently therapeutic hand cream is free from Parabens, Sulphates and animal ingredients and leaves the hands looking smooth, radiant and rejuvenated."},
{"price": "HK $55.10", "product_name": "Neon Filemates Set", "id": 19, "product_url": "http://beautybay.com/nailcare/tweezerman/neonfilematesset/", "colour": "", "brand": "Tweezerman", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0184U_1_L.jpg/f19fd7cd146a38d71b8324edad1a5b49/TWEE0184U_1_L.jpg", "product_description": "Tweezerman Neon Filemates Set is a stylish trio of nail files to smooth and shape the nails.\nFeaturing a new and improved professional quality grit of 100/180, Neon Filemates Set is perfect for filing natural nails or sanding and shaping acrylic nails. Neon Filemates Set contains three of Tweezerman’s innovative nail files in vibrant neon shades and is packed in a convenient carry case to keep the files clean and protected.\nAn essential manicure tool for neat and tidy nails, Neon Filemates Set can be used again and again for high-performance, effective filing and are a great way to add a touch of vibrant style to your nail grooming regime."},
{"price": "HK $170.20", "product_name": "Deliverance Kowhai Flower Hand Cream 75ml", "id": 20, "product_url": "http://beautybay.com/bathandbody/antipodes/deliverancekowhaiflowerhandcream/", "colour": "", "brand": "Antipodes", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/ANTI0021F_1_L.jpg/bcdb2a127e902c5f8bd75521f7ce6ab5/ANTI0021F_1_L.jpg", "product_description": "ANTIPODES Deliverance Kowhai Flower Hand Cream is a non-greasy hand cream which moisturises and heals hard working hands.\nDesigned to soften, smooth and sooth, Deliverance Kowhai Flower Hand Cream is rich in Vitamin E and Avocado Oil which work synergistically to nurture the skin with antioxidant protection and essential Fatty Acids.\nA stunning infusion of Sweet Orange and Cedarwood fragrances help to alleviate sensations of stress whilst the natural Kowhai formula helps to eliminate harmful bacteria from the hands. Deliverance Kowhai Flower Hand Cream is a handbag essential and leaves the hands silky soft, clean and moisturised without any greasy or sticky residue."},
{"price": "HK $137.60", "product_name": "Hand Conditioner 114g", "id": 21, "product_url": "http://beautybay.com/bathandbody/nailtiques/handconditioner/", "colour": "", "brand": "Nailtiques", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NATQ0015F_4_L.jpg/aa17ec8007e72a275255f4d52a475e12/NATQ0015F_4_L.jpg", "product_description": "Nailtiques Hand Conditioner is a nourishing hand cream specially formulated to soften cuticles and skin without softening or weakening nails.\nFeaturing a lightweight, non-greasy formula enriched with a highly concentrated blend of pure Aloe and Jojoba Oils, Hand Conditioner rehydrates and conditions the hands and cuticles. Fast absorbing, this high-performance hand treatment leaves the hands and cuticles soft, healthy and nourished whilst maintaining strong, healthy, flexible nails."},
{"price": "HK $152.90", "product_name": "Nail Moisturiser 28g", "id": 22, "product_url": "http://beautybay.com/nailcare/nailtiques/nailmoisturiser/", "colour": "", "brand": "Nailtiques", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/NATQ0013F_4_L.jpg/39bab6f52dee3552c7d1fd56abd982c0/NATQ0013F_4_L.jpg", "product_description": "Nailtiques Nail Moisturiser restores essential moisture into nails whilst promoting flexibility.\nThe ideal treatment cream to maintain healthy nails, Nail Moisturiser is a greaseless conditioning nail crème which is infused with Soluble Collagen, Jojoba and Aloe which work harmoniously to fortify and strengthen nails.\nThe aloe and jojoba provide nourishing and conditioning benefits while collagen restores moisture and promotes flexibility. Perfect as part of your nightly routine, Nail Moisturiser penetrates deeply into skin during the night to leave healthy nails strong and flexible."},
{"price": "HK $99.60", "product_name": "Special Hand Cream Vitamin E", "id": 23, "product_url": "http://beautybay.com/bathandbody/mariobadescu/specialhandcreamvitamine/", "colour": "", "brand": "Mario Badescu", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/MABA0059F_1_L.jpg/29db04e94fe7adb128ab42c6c1411ccd/MABA0059F_1_L.jpg", "product_description": "Mario Badescu Special Hand Cream Vitamin E (118ml) is a Rich, non-greasy formula of Vitamin A, Vitamin E, Wheat Germ Oil and Honey."},
{"price": "HK $130.20", "product_name": "Combo Clipper Set", "id": 24, "product_url": "http://beautybay.com/nailcare/tweezerman/comboclipperset/", "colour": "", "brand": "Tweezerman", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0185U_1_L.jpg/79d3c716cdb182e57cf002ef45eebdfe/TWEE0185U_1_L.jpg", "product_description": "Tweezerman Combo Clipper Set is a duo of extra durable, heavy duty nail clippers.\nExpertly crafted for those who understand that good hands and nails can make a great impression, Combo Clipper Set has a small nail clipper ideally suited for finger nails whilst the larger clipper is perfect for toenails.\nThe sharp cutting edges of both clippers are the ultimate in quality and performance. Combo Clipper Set delivers precise, straight cuts for perfectly groomed nails and prevention of ingrown nails. Expertly crafted from high-quality Stainless Steel, Combo Clipper Set is designed for long-lasting use and is a manicure essential."},
{"price": "HK $90.10", "product_name": "File Buff Shine Pad", "id": 25, "product_url": "http://beautybay.com/nailcare/tweezerman/filebuffshinepad/", "colour": "", "brand": "Tweezerman", "meta_tag": "", "image_url": "http://images.contentful.com/eoaaqxyywn6o/TWEE0032U_1_L.jpg/91a48012341dac731e8afdff0b790cb1/TWEE0032U_1_L.jpg", "product_description": "Tweezerman File Buff Shine Pad shapes and shines nails to a perfectly manicured finish without the need for nail polish.\nThis gorgeous combination set combines an essential nail file with a multi-purpose buffing block to shape, smooth and buff nails to an amazing natural shine finish. Achieve a beautiful manicure in minutes, File Buff Shine Pad decreases any ridges and removes any oils on top of the nail as well as helping nail polish stick to your nails by roughing up the surface.\nThe professional nail file is packaged in a colourful FileMate™ carry case for safe and clean storage whilst the high-quality buffing pad features multi-surfaces for a variety of finishes. File Buff Shine Pad leaves nails looking healthy, shiny and perfectly manicured."},
{"price": "HK $75.80", "product_name": "Carrots Moisturising Hand Cream 80ml", "id": 26, "product_url": "http://beautybay.com/bathandbody/yesto/carrotsmoisturisinghandcream/", "colour": "", "brand": "Yes To", "meta_tag": "", "image_url": "-", "product_description": "Yes To Carrots Moisturising Hand Cream hydrates and protects hard working hands.\nSpecially formulated for normal to dry skin types, Carrots Moisturising Hand Cream has a 97% natural formula which utilises Organic Carrots and Shea butter to rehydrate, soften and nourish the hands.\nCarrots Moisturising Hand Cream promotes healthy moisture retention and leaves the hands feeling silky soft and is sure to be a Beauty Bay best-seller."}
]